{
    "503.1": {
        "navigation": {
            "nextRule": "503.2",
            "previousRule": "502.29b"
        },
        "ruleNumber": "503.1",
        "examples": null,
        "ruleText": "A copy card is a card that creates or becomes a \"copy\" of a spell, permanent, or card. (Certain older cards were printed with the phrase \"search for a copy.\" These aren't copy cards; they have received new text in the Oracle card reference.)"
    },
    "421.4": {
        "navigation": {
            "nextRule": "421.5",
            "previousRule": "421.3"
        },
        "ruleNumber": "421.4",
        "examples": null,
        "ruleText": "If the loop contains only mandatory actions, the game ends in a draw. (See rule 102.6.)"
    },
    "502.26f": {
        "navigation": {
            "nextRule": "502.27",
            "previousRule": "502.26e"
        },
        "ruleNumber": "502.26f",
        "examples": null,
        "ruleText": "See rule 504, \"Face-Down Spells and Permanents,\" for more information on how to play cards with morph."
    },
    "217.3a": {
        "navigation": {
            "nextRule": "217.3b",
            "previousRule": "217.3"
        },
        "ruleNumber": "217.3a",
        "examples": null,
        "ruleText": "The hand is where a player holds cards that have been drawn but not yet played."
    },
    "408.1c": {
        "navigation": {
            "nextRule": "408.1d",
            "previousRule": "408.1b"
        },
        "ruleNumber": "408.1c",
        "examples": null,
        "ruleText": "The active player gets priority at the beginning of most phases and steps, after special actions and abilities that trigger at the beginning of that phase or step go on the stack. (The exceptions are the untap step and the cleanup step.) The active player also gets priority after combat damage resolves. The player with priority may either play a spell or ability, or pass. If he or she plays a spell or ability, the player again receives priority; otherwise, his or her opponent receives priority. If both players pass in succession (that is, if both players pass without taking any actions in between passing), the top spell or ability on the stack resolves, then the active player receives priority. If the stack is empty when both players pass in succession, the phase or step ends and the next one begins."
    },
    "214.7": {
        "navigation": {
            "nextRule": "214.7a",
            "previousRule": "214.6b"
        },
        "ruleNumber": "214.7",
        "examples": null,
        "ruleText": "Creatures"
    },
    "310.1d": {
        "navigation": {
            "nextRule": "310.2",
            "previousRule": "310.1c"
        },
        "ruleNumber": "310.1d",
        "examples": null,
        "ruleText": "A blocking creature will assign combat damage, divided as its controller chooses (no fractions), to the attacking creatures it's blocking. If it isn't currently blocking any creatures (if, for example, they were destroyed or removed from combat), it will assign no combat damage."
    },
    "408.1e": {
        "navigation": {
            "nextRule": "408.1f",
            "previousRule": "408.1d"
        },
        "ruleNumber": "408.1e",
        "examples": null,
        "ruleText": "When a spell is played, it goes on top of the stack. When an activated ability is played, a pseudospell representing it goes on the stack."
    },
    "416.1": {
        "navigation": {
            "nextRule": "416.2",
            "previousRule": "415.4"
        },
        "ruleNumber": "416.1",
        "examples": null,
        "ruleText": "When a spell or ability resolves, it may create one or more effects. There are three main types: one-shot effects, continuous effects, and replacement and prevention effects. Effects of a fourth category, state-based effects, are generated by specific states of the game."
    },
    "412.3": {
        "navigation": {
            "nextRule": "412.4",
            "previousRule": "412.2"
        },
        "ruleNumber": "412.3",
        "examples": null,
        "ruleText": "Some static abilities apply while a spell is on the stack. These are often abilities that refer to countering the spell. Also, abilities that say \"As an additional cost to play . . .\" and \"You may pay [cost] rather than paying [this card]'s mana cost\" work while the card is a spell on the stack."
    },
    "200.1": {
        "navigation": {
            "nextRule": "201.1",
            "previousRule": "103.2"
        },
        "ruleNumber": "200.1",
        "examples": null,
        "ruleText": "When a rule or text on a card refers to a \"card,\" it means a Magic card with a Magic card front and the Magic card back. Tokens aren't considered cards-even an Unglued™ card that represents a token isn't considered a card for rules purposes."
    },
    "217.5b": {
        "navigation": {
            "nextRule": "217.5c",
            "previousRule": "217.5a"
        },
        "ruleNumber": "217.5b",
        "examples": null,
        "ruleText": "A spell or ability affects and checks only the in-play zone unless it specifically mentions a player or another zone. Permanents exist only in the in-play zone. Only permanents are legal targets for spells and abilities, unless a spell or ability (a) specifies that it can target a player or a card in another zone, or (b) affects an object that can't exist in the in-play zone, such as a spell."
    },
    "502.28b": {
        "navigation": {
            "nextRule": "502.28c",
            "previousRule": "502.28a"
        },
        "ruleNumber": "502.28b",
        "examples": null,
        "ruleText": "During the combat damage step, if at least one attacking or blocking creature has double strike or first strike, creatures without double strike or first strike (see rule 502.2) don't assign combat damage. Instead of proceeding to end of combat, the phase gets a second combat damage step to handle the remaining creatures. Creatures with double strike also assign combat damage during the second combat damage step."
    },
    "500.3": {
        "navigation": {
            "nextRule": "500.4",
            "previousRule": "500.2"
        },
        "ruleNumber": "500.3",
        "examples": null,
        "ruleText": "As part of declaring blockers, the defending player checks each creature he or she controls to see whether it must block, can't block, or has some other blocking restriction or requirement. If such a restriction or requirement conflicts with the proposed set of blocking creatures, the block is illegal, and the defending player must then propose another set of blocking creatures. (Creatures with unpaid costs to block are exempt from effects that would require them to block.)"
    },
    "206.3": {
        "navigation": {
            "nextRule": "207.1",
            "previousRule": "206.2"
        },
        "ruleNumber": "206.3",
        "examples": null,
        "ruleText": "A spell or ability that affects cards from a particular set \"looks\" only for that set's expansion symbol. A card reprinted in the basic set receives the basic set's expansion symbol; any reprinted version of the card no longer counts as part of its original set unless it was reprinted with that set's expansion symbol. The first five editions of the basic set had no expansion symbol."
    },
    "502.4": {
        "navigation": {
            "nextRule": "502.4a",
            "previousRule": "502.3c"
        },
        "ruleNumber": "502.4",
        "examples": null,
        "ruleText": "Flying"
    },
    "502.23b": {
        "navigation": {
            "nextRule": "502.23c",
            "previousRule": "502.23a"
        },
        "ruleNumber": "502.23b",
        "examples": null,
        "ruleText": "Cards and permanents with threshold have the threshold text only if their controller has seven or more cards in his or her graveyard. Otherwise, the text after \"Threshold -\" is treated as though it did not appear on the card or permanent."
    },
    "214.7c": {
        "navigation": {
            "nextRule": "214.8",
            "previousRule": "214.7b"
        },
        "ruleNumber": "214.7c",
        "examples": null,
        "ruleText": "A creature's activated ability with the tap symbol in its activation cost can't be played unless the creature has been under its controller's control since the start of his or her most recent turn. A creature can't attack unless it has been under its controller's control since the start of his or her most recent turn. Ignore this rule for creatures with haste (see rule 502.5)."
    },
    "505.6": {
        "navigation": {
            "nextRule": "505.7",
            "previousRule": "505.5"
        },
        "ruleNumber": "505.6",
        "examples": "Example: Void reads, \"Choose a number. Destroy all artifacts and creatures with converted mana cost equal to that number. Then target player reveals his or her hand and discards from it all nonland cards with converted mana cost equal to the number.\" If a player plays Void and chooses 1 or 4, his or her opponent would discard Assault/Battery. If the player chooses 5, Assault/Battery would be unaffected, because neither half has a converted mana cost of 5.",
        "ruleText": "Effects that ask if a split card's characteristic matches a given value get only one answer. This answer is \"yes\" if either side of the split card matches the given value."
    },
    "502.25b": {
        "navigation": {
            "nextRule": "502.26",
            "previousRule": "502.25a"
        },
        "ruleNumber": "502.25b",
        "examples": null,
        "ruleText": "A creature with fear can't be blocked except by artifact creatures and/or black creatures."
    },
    "406.2e": {
        "navigation": {
            "nextRule": "407.1",
            "previousRule": "406.2d"
        },
        "ruleNumber": "406.2e",
        "examples": null,
        "ruleText": "A delayed triggered ability will trigger only once-the next time its trigger event occurs-unless it has a stated duration, such as \"this turn.\""
    },
    "418.3a": {
        "navigation": {
            "nextRule": "418.3b",
            "previousRule": "418.3"
        },
        "ruleNumber": "418.3a",
        "examples": null,
        "ruleText": "A continuous effect generated by the resolution of a spell or ability lasts as long as stated by the spell or ability creating it (such as \"until end of turn\"). If no duration is stated, it lasts until the end of the game."
    },
    "308.1": {
        "navigation": {
            "nextRule": "308.2",
            "previousRule": "307.1"
        },
        "ruleNumber": "308.1",
        "examples": null,
        "ruleText": "The active player declares which, if any, creatures he or she controls will attack. Only creatures can attack, and the following creatures can't attack: tapped creatures (even those that can attack without tapping), Walls, and creatures the active player didn't control continuously since the beginning of the turn. This declaration is simultaneous, not sequential, and doesn't go on the stack. Any triggered ability generated during this action waits until a player would receive priority."
    },
    "203.2": {
        "navigation": {
            "nextRule": "203.3",
            "previousRule": "203.1"
        },
        "ruleNumber": "203.2",
        "examples": null,
        "ruleText": "A card is the color or colors of the mana symbols in its mana cost, regardless of the color of its border. For example, a card with a mana cost of 2W is white, and one with a mana cost of 2WB is both white and black. Cards with no colored mana symbols in their mana costs are colorless. Cards with more than one of the five colored mana symbols in their mana costs are multicolored. Multicolored cards are printed with a gold frame, but this is not a requirement for a card to be multicolored."
    },
    "409.1d": {
        "navigation": {
            "nextRule": "409.1e",
            "previousRule": "409.1c"
        },
        "ruleNumber": "409.1d",
        "examples": null,
        "ruleText": "If the spell or ability affects several targets in different ways, the player announces how it will affect each target."
    },
    "502.9": {
        "navigation": {
            "nextRule": "502.9a",
            "previousRule": "502.8c"
        },
        "ruleNumber": "502.9",
        "examples": null,
        "ruleText": "Trample"
    },
    "214.4b": {
        "navigation": {
            "nextRule": "214.5",
            "previousRule": "214.4a"
        },
        "ruleNumber": "214.4b",
        "examples": null,
        "ruleText": "If a permanent's type changes, the subtypes of its old permanent type don't exist in any way under the new type. The subtype disappears completely for the entire time the card's permanent type is changed. This does not override the rule that a permanent retains its legendary status when its type changes (see rule 215.2)."
    },
    "502.24": {
        "navigation": {
            "nextRule": "502.24a",
            "previousRule": "502.23c"
        },
        "ruleNumber": "502.24",
        "examples": null,
        "ruleText": "Madness"
    },
    "413.2b": {
        "navigation": {
            "nextRule": "413.2c",
            "previousRule": "413.2a"
        },
        "ruleNumber": "413.2b",
        "examples": null,
        "ruleText": "The controller of the spell or ability follows its instructions in the order written. However, replacement effects may modify these actions. In some cases, later text on the card may modify the meaning of earlier text (for example, \"Destroy target creature. It can't be regenerated\" or \"Counter target spell. Put it on top of its owner's library instead of into its owner's graveyard.\") Don't just apply effects step by step without thinking in these cases-read the whole card and apply the rules of English to the text."
    },
    "217.7b": {
        "navigation": {
            "nextRule": "217.7c",
            "previousRule": "217.7a"
        },
        "ruleNumber": "217.7b",
        "examples": null,
        "ruleText": "Cards in the removed-from-the-game zone are kept face up and may be examined by either player at any time. Cards \"removed from the game face down\" can't be examined by either player except when instructions allow it."
    },
    "210.1": {
        "navigation": {
            "nextRule": "211.1",
            "previousRule": "209.1"
        },
        "ruleNumber": "210.1",
        "examples": null,
        "ruleText": "Legal text (the fine print at the bottom of the card) lists the copyright information. It has no effect on game play."
    },
    "503.6": {
        "navigation": {
            "nextRule": "503.7",
            "previousRule": "503.5"
        },
        "ruleNumber": "503.6",
        "examples": "Example: A Clone comes into play as a copy of Chameleon Spirit. Chameleon Spirit reads, in part, \"As Chameleon Spirit comes into play, choose a color.\" The Clone won't copy the color choice of the Spirit; rather, the controller of the Clone will get to make a new choice.",
        "ruleText": "When copying a permanent, the \"choices\" of the permanent aren't copied. Instead, if a card comes into play as a copy of another permanent, the copy's controller will get to make any \"as comes into play\" choices for it."
    },
    "410.1": {
        "navigation": {
            "nextRule": "410.2",
            "previousRule": "409.4"
        },
        "ruleNumber": "410.1",
        "examples": null,
        "ruleText": "Because they aren't played, triggered abilities can trigger even when it isn't legal to play spells and abilities, and effects that prevent abilities from being played don't affect them."
    },
    "412.4": {
        "navigation": {
            "nextRule": "412.5",
            "previousRule": "412.3"
        },
        "ruleNumber": "412.4",
        "examples": null,
        "ruleText": "Some static abilities apply while a card is in any zone that you could play it from (usually your hand). These are limited to those that read, \"You may play [this card] . . .\" and \"You can't play [this card] . . . .\""
    },
    "502.24a": {
        "navigation": {
            "nextRule": "502.24b",
            "previousRule": "502.24"
        },
        "ruleNumber": "502.24a",
        "examples": null,
        "ruleText": "Madness is a keyword that represents two abilities. The first is a static ability that functions while the card with madness is in a player's hand. The second is a triggered ability that functions when the first ability is applied. The phrase \"Madness [cost]\" means \"If a player would discard this card from his or her hand, that player discards it, but may remove it from the game instead of putting it into his or her graveyard\" and \"When this card is removed from the game this way, until that player passes next, the player may play it any time he or she could play an instant as though it were in his or her hand by paying [cost] rather than paying its mana cost. When the player passes next, he or she puts it into his or her graveyard.\""
    },
    "402.1": {
        "navigation": {
            "nextRule": "402.2",
            "previousRule": "401.3"
        },
        "ruleNumber": "402.1",
        "examples": null,
        "ruleText": "An ability is text on a card or permanent that's not reminder text, flavor text, characteristic-setting text, or spell text (see rule 400.1). The result of following such an instruction or of following a spell's text is an effect. (See rule 416, \"Effects.\") Abilities can affect the cards or permanents they're on; they can also affect other cards, permanents, and/or players. Abilities can grant abilities to other cards or permanents or to the cards or permanents they're on; they do so when the words \"has,\" \"have,\" \"gains,\" or \"gain\" are used."
    },
    "503.9": {
        "navigation": {
            "nextRule": "503.10",
            "previousRule": "503.8"
        },
        "ruleNumber": "503.9",
        "examples": "Example: Quirion Elves comes into play and an Unstable Shapeshifter copies it. The printed values of the Shapeshifter now match those of the Elves, except that the Shapeshifter also has the printed ability \"Whenever a creature comes into play, Unstable Shapeshifter becomes a copy of that creature and gains this ability.\" Then, a Clone comes into play as a copy of the Unstable Shapeshifter. The Clone copies the new printed values of the Shapeshifter, including the ability that the Shapeshifter gave itself when it copied the Elves.",
        "ruleText": "Some copy cards give an ability to the copy as part of the copying process. This ability becomes part of the printed values for the copy, along with any other abilities that were copied. Also, some copy cards specifically state that they don't copy certain values; they retain their original values instead."
    },
    "503.4": {
        "navigation": {
            "nextRule": "503.5",
            "previousRule": "503.3"
        },
        "ruleNumber": "503.4",
        "examples": "Example: Unstable Shapeshifter reads, \"Whenever a creature comes into play, Unstable Shapeshifter becomes a copy of that creature and gains this ability.\" A Shapeshifter is affected by Giant Growth, which reads \"Target creature gets +3/+3 until end of turn.\" If a creature comes into play later this turn, the Shapeshifter will become a copy of that creature, but it will still get +3/+3 from the Giant Growth.",
        "ruleText": "Some effects cause a permanent that's copying a permanent or card to copy a different permanent or card while remaining in play. The change doesn't trigger comes-into-play or leaves-play abilities. This also doesn't change any noncopy effects presently affecting the copy."
    },
    "215.1": {
        "navigation": {
            "nextRule": "215.2",
            "previousRule": "214.9h"
        },
        "ruleNumber": "215.1",
        "examples": null,
        "ruleText": "The word Legend or Legendary may appear in a card's type or subtype. The permanent created when that card enters play is subject to the Legend rule (see rule 420, \"State-Based Effects\") as well as the rules for its type and subtype."
    },
    "103.2": {
        "navigation": {
            "nextRule": "200.1",
            "previousRule": "103.1"
        },
        "ruleNumber": "103.2",
        "examples": null,
        "ruleText": "When one effect says something can happen and another says it can't, the \"can't\" effect wins. For example, if one effect reads \"You may play an additional land this turn\" and another reads \"You can't play land cards this turn,\" the effect that keeps you from playing lands wins out. Note that adding abilities to cards and removing abilities from cards don't fall under this rule. See rule 407, \"Adding and Removing Abilities.\""
    },
    "502.15a": {
        "navigation": {
            "nextRule": "502.15b",
            "previousRule": "502.15"
        },
        "ruleNumber": "502.15a",
        "examples": null,
        "ruleText": "Phasing is a static ability that modifies the rules of the untap step."
    },
    "418.5e": {
        "navigation": {
            "nextRule": "419.1",
            "previousRule": "418.5d"
        },
        "ruleNumber": "418.5e",
        "examples": null,
        "ruleText": "The value of a permanent's characteristic is determined by starting with the printed or token value, then applying copy effects (see rule 503, \"Copying Spells and Abilities\"), then applying continuous effects generated by type-changing abilities, then applying any power or toughness changes due to counters, and then applying all other continuous effects."
    },
    "419.4": {
        "navigation": {
            "nextRule": "419.5",
            "previousRule": "419.3"
        },
        "ruleNumber": "419.4",
        "examples": "Example: A player can play a regeneration ability in response to a spell that would destroy a creature he or she controls.",
        "ruleText": "Replacement or prevention effects must exist before the appropriate event occurs-they can't \"go back in time\" and change something that's already happened. Usually spells and abilities that generate these effects are played in response to whatever would produce the event and thus resolve before that event would occur."
    },
    "503.3": {
        "navigation": {
            "nextRule": "503.4",
            "previousRule": "503.2"
        },
        "ruleNumber": "503.3",
        "examples": "Example: A Vesuvan Doppelganger comes into play as a copy of Grizzly Bears (a 2/2 green creature with no abilities). Vesuvan Doppelganger reads, \"As Vesuvan Doppelganger comes into play, you may choose a creature in play. If you do, Vesuvan Doppelganger comes into play as a copy of that creature except for its color and gains 'At the beginning of your upkeep, you may have this creature become a copy of target creature except for its color. If you do, this creature gains this ability.'\" Then, a Clone comes into play as a copy of the Doppelganger. The Clone is a 2/2 blue Bear named Grizzly Bears that has the Doppelganger's upkeep ability.",
        "ruleText": "The copied information becomes the printed values for the copy, replacing its originally printed values. Cards that copy the copy will use the new printed values."
    },
    "406.1d": {
        "navigation": {
            "nextRule": "406.1e",
            "previousRule": "406.1c"
        },
        "ruleNumber": "406.1d",
        "examples": null,
        "ruleText": "A mana ability can be activated or triggered. However, the rules for playing and resolving mana abilities differ slightly from those for playing other abilities. See rule 411, \"Playing Mana Abilities,\" for details."
    },
    "416.2": {
        "navigation": {
            "nextRule": "416.3",
            "previousRule": "416.1"
        },
        "ruleNumber": "416.2",
        "examples": "Example: An effect that changes all lands to creatures won't alter land cards in the players' graveyards.",
        "ruleText": "Effects apply only to permanents unless the instruction's text states otherwise or they clearly can apply only to cards in one or more other zones."
    },
    "413.2g": {
        "navigation": {
            "nextRule": "413.2h",
            "previousRule": "413.2f"
        },
        "ruleNumber": "413.2g",
        "examples": "Example: An effect that reads \"Destroy all black creatures\" destroys a white-and-black creature, but one that reads \"Destroy all nonblack creatures\" doesn't.",
        "ruleText": "An effect that refers to characteristics of a permanent checks only for the value of the specified characteristics, regardless of any related ones the permanent may also have."
    },
    "414.2": {
        "navigation": {
            "nextRule": "415.1",
            "previousRule": "414.1"
        },
        "ruleNumber": "414.2",
        "examples": null,
        "ruleText": "The player who played the countered spell or ability doesn't get a \"refund\" of any costs that were paid."
    },
    "502.13b": {
        "navigation": {
            "nextRule": "502.14",
            "previousRule": "502.13a"
        },
        "ruleNumber": "502.13b",
        "examples": "Example: A creature has two instances of \"Cumulative upkeep-Pay 1 life.\" The creature currently has no counters but both cumulative upkeep abilities trigger. When the first ability resolves, the controller adds a counter and then chooses to pay 1 life. When the second ability resolves, the controller adds another counter and then chooses to pay an additional 2 life.",
        "ruleText": "If a permanent has multiple instances of cumulative upkeep, each triggers separately. However, the age counters are not linked to any particular ability; each cumulative upkeep ability will count the total number of age counters on the permanent at the time that ability resolves."
    },
    "217.6c": {
        "navigation": {
            "nextRule": "217.7",
            "previousRule": "217.6b"
        },
        "ruleNumber": "217.6c",
        "examples": null,
        "ruleText": "When both players pass in succession, the top (last-played) spell or ability resolves. If the stack is empty when both players pass, the current step or phase ends and the next begins."
    },
    "409.3": {
        "navigation": {
            "nextRule": "409.4",
            "previousRule": "409.2"
        },
        "ruleNumber": "409.3",
        "examples": null,
        "ruleText": "A creature's activated ability with the tap symbol in its activation cost can't be played unless the creature has been under its controller's control since the start of his or her most recent turn. Creatures with haste may ignore this rule (see rule 502.5)."
    },
    "502.10d": {
        "navigation": {
            "nextRule": "502.10e",
            "previousRule": "502.10c"
        },
        "ruleNumber": "502.10d",
        "examples": null,
        "ruleText": "Once an attacking band has been announced, it lasts for the rest of combat, even if something later removes the banding ability from one or more creatures. However, creatures in a band that are removed from combat are also removed from the band."
    },
    "314.1": {
        "navigation": {
            "nextRule": "314.1a",
            "previousRule": "313.2"
        },
        "ruleNumber": "314.1",
        "examples": null,
        "ruleText": "The cleanup step proceeds in the following order."
    },
    "502.16a": {
        "navigation": {
            "nextRule": "502.17",
            "previousRule": "502.16"
        },
        "ruleNumber": "502.16a",
        "examples": null,
        "ruleText": "Buyback is a static ability of some instants and sorceries that functions while the card is on the stack (that is, while it's a spell). The phrase \"Buyback [cost]\" means \"You may pay an additional [cost] as you play this spell. If you do, put this card into your hand instead of into your graveyard as the spell resolves.\" Paying a spell's buyback cost follows the rules for paying additional costs in rules 409.1b and 409.1f."
    },
    "215.3": {
        "navigation": {
            "nextRule": "216.1",
            "previousRule": "215.2"
        },
        "ruleNumber": "215.3",
        "examples": null,
        "ruleText": "If an effect makes a non-Legend creature into a Legend, and the creature then becomes another permanent type, such as an enchantment, that effect may no longer apply (if the permanent is no longer a creature). If it doesn't, the resulting permanent will not be legendary."
    },
    "505.3": {
        "navigation": {
            "nextRule": "505.4",
            "previousRule": "505.2"
        },
        "ruleNumber": "505.3",
        "examples": null,
        "ruleText": "Because every split card consists of two halves with different colored mana symbols in their mana costs, each split card is a multicolored card except while it's on the stack. While it's on the stack, it's only the color of the half being played."
    },
    "214.9g": {
        "navigation": {
            "nextRule": "214.9h",
            "previousRule": "214.9f"
        },
        "ruleNumber": "214.9g",
        "examples": null,
        "ruleText": "Any land that isn't a basic land is a nonbasic land. Basic and nonbasic are not types; they're categories."
    },
    "101.2": {
        "navigation": {
            "nextRule": "101.3",
            "previousRule": "101.1"
        },
        "ruleNumber": "101.2",
        "examples": null,
        "ruleText": "After the decks have been shuffled, the players determine who chooses which player goes first using any mutually agreeable method (flipping a coin, rolling dice, etc.). In a match of several games, the loser of the previous game decides who will take the first turn. If the previous game was a draw, the person who determined who would take the first turn in the previous game decides."
    },
    "502.9b": {
        "navigation": {
            "nextRule": "502.9c",
            "previousRule": "502.9a"
        },
        "ruleNumber": "502.9b",
        "examples": null,
        "ruleText": "The controller of an attacking creature with trample first assigns damage to the creature(s) blocking it. If all those blocking creatures are assigned lethal damage, any remaining damage is assigned as its controller chooses among the blocking creatures and the defending player. When checking for assigned lethal damage, take into account damage already on the creature and damage from other creatures that is to be assigned at the same time (see rule 502.9f). The controller need not assign lethal damage to all blocking creatures but in that case can't assign any damage to the defending player."
    },
    "417.1": {
        "navigation": {
            "nextRule": "417.2",
            "previousRule": "416.3"
        },
        "ruleNumber": "417.1",
        "examples": null,
        "ruleText": "A one-shot effect does something just once and doesn't have a duration. Examples include damage dealing, destruction of permanents, and moving cards between zones."
    },
    "420.5c": {
        "navigation": {
            "nextRule": "420.5d",
            "previousRule": "420.5b"
        },
        "ruleNumber": "420.5c",
        "examples": null,
        "ruleText": "A creature with lethal damage is destroyed. Lethal damage is an amount of damage greater than 0 and greater than or equal to a creature's toughness. Regeneration does replace this event."
    },
    "419.8": {
        "navigation": {
            "nextRule": "419.8a",
            "previousRule": "419.7c"
        },
        "ruleNumber": "419.8",
        "examples": null,
        "ruleText": "Interaction of Replacement or Prevention Effects"
    },
    "313.1": {
        "navigation": {
            "nextRule": "313.2",
            "previousRule": "312.1"
        },
        "ruleNumber": "313.1",
        "examples": null,
        "ruleText": "As the end of turn step begins, all abilities that trigger \"at end of turn\" go on the stack. (See rule 404, \"Triggered Abilities.\") The active player gets priority, then players may play spells and abilities."
    },
    "502.15b": {
        "navigation": {
            "nextRule": "502.15c",
            "previousRule": "502.15a"
        },
        "ruleNumber": "502.15b",
        "examples": null,
        "ruleText": "During each player's untap step, before that player untaps his or her permanents, all permanents with phasing the player controls phase out. Simultaneously, all permanents that had phased out under that player's control phase in. (See rule 217.8, \"Phased-Out,\" and rule 302.3.)"
    },
    "408.1b": {
        "navigation": {
            "nextRule": "408.1c",
            "previousRule": "408.1a"
        },
        "ruleNumber": "408.1b",
        "examples": null,
        "ruleText": "Spells and activated abilities are played by players (if they choose) using a system of priority, while other types of abilities and effects are automatically generated by the game rules. Each time a player would get priority, all applicable state-based effects resolve first as a single event (see rule 420, \"State-Based Effects\"). Then, if any new state-based effects have been generated, they resolve as a single event. This process repeats until no more applicable state-based effects are generated. Then triggered abilities are added to the stack (see rule 410, \"Handling Triggered Abilities\"). These steps repeat in order until no further state-based effects or triggered abilities are generated. Then the player who would have received priority does so and may play a spell, ability, or land as governed by the rules for that phase. The game also checks for state-based effects and triggered abilities during the cleanup step (see rule 314, \"Cleanup Step\"). If any state-based effects resolve or abilities trigger, the active player gets priority afterward."
    },
    "502.26c": {
        "navigation": {
            "nextRule": "502.26d",
            "previousRule": "502.26b"
        },
        "ruleNumber": "502.26c",
        "examples": null,
        "ruleText": "You can't play a card face down if it doesn't have morph."
    },
    "419.8a": {
        "navigation": {
            "nextRule": "419.8b",
            "previousRule": "419.8"
        },
        "ruleNumber": "419.8a",
        "examples": "Example: Two cards are in play. One is an enchantment that reads \"If a card would be put into a graveyard, instead remove it from the game,\" and the other is a creature that reads \"If [this card] would be put into a graveyard, instead shuffle it into its owner's library.\" The controller of the creature that would be destroyed decides which replacement to apply first; the other does nothing.",
        "ruleText": "If two or more replacement or prevention effects are attempting to modify the way an event affects a permanent or player, the affected permanent's controller or the affected player chooses one to apply to that permanent or player. Then the other applies if it is still appropriate. If one or more of the applicable replacement effects is a \"self-replacement effect\" (see rule 419.6d), that effect is applied before any other replacement effects."
    },
    "402.9": {
        "navigation": {
            "nextRule": "402.10",
            "previousRule": "402.8"
        },
        "ruleNumber": "402.9",
        "examples": null,
        "ruleText": "Some cards have abilities that can be played when the card is not in play. These are clearly marked (for example, \"Play this ability only if [this card] is in your graveyard\"). These abilities aren't of any particular permanent type-cards not in play aren't permanents. Some cards have abilities that can trigger while the card is in a zone other than the in-play zone. Such abilities specify the zone from which they trigger. They aren't abilities of any particular permanent type because cards not in play aren't permanents."
    },
    "502.5": {
        "navigation": {
            "nextRule": "502.5a",
            "previousRule": "502.4c"
        },
        "ruleNumber": "502.5",
        "examples": null,
        "ruleText": "Haste"
    },
    "217.4a": {
        "navigation": {
            "nextRule": "217.4b",
            "previousRule": "217.4"
        },
        "ruleNumber": "217.4a",
        "examples": null,
        "ruleText": "A graveyard is a discard pile. Any card that's countered, discarded, destroyed, or sacrificed is put on top of its owner's graveyard, as is any instant or sorcery spell that's finished resolving. Each player's graveyard starts out empty."
    },
    "305.1": {
        "navigation": {
            "nextRule": "305.2",
            "previousRule": "304.1"
        },
        "ruleNumber": "305.1",
        "examples": null,
        "ruleText": "There are two main phases in a turn. In each turn, the first main phase, known as the precombat main phase, and second main phase, known as the postcombat main phase, are separated by the combat phase (see rule 306, \"Combat Phase\"). The precombat and postcombat main phases are individually and collectively known as the \"main phase.\""
    },
    "306.2": {
        "navigation": {
            "nextRule": "307.1",
            "previousRule": "306.1"
        },
        "ruleNumber": "306.2",
        "examples": null,
        "ruleText": "A creature is removed from combat if it stops being a creature (as a result of leaving play by any means, such as by being destroyed or removed from the game), if it regenerates (see rule 419.6b), or if its controller changes. \"Removed from combat\" means the creature stops being an attacking, blocking, blocked, and/or unblocked creature. Once a creature has been declared as an attacking or blocking creature, spells or abilities that would have kept that creature from attacking or blocking don't remove the creature from combat. Tapping or untapping a creature that's already been declared as an attacker or blocker doesn't remove it from combat and doesn't prevent its combat damage."
    },
    "502.9a": {
        "navigation": {
            "nextRule": "502.9b",
            "previousRule": "502.9"
        },
        "ruleNumber": "502.9a",
        "examples": null,
        "ruleText": "Trample is a static ability that modifies the rules for assigning an attacking creature's combat damage. A creature with trample has no special abilities when blocking or dealing noncombat damage."
    },
    "418.3": {
        "navigation": {
            "nextRule": "418.3a",
            "previousRule": "418.2"
        },
        "ruleNumber": "418.3",
        "examples": null,
        "ruleText": "Continuous Effects from Spells or Abilities"
    },
    "303.1": {
        "navigation": {
            "nextRule": "304.1",
            "previousRule": "302.3"
        },
        "ruleNumber": "303.1",
        "examples": null,
        "ruleText": "As the upkeep step begins, any abilities that trigger at the beginning of that upkeep step or that triggered during that turn's untap step go on the stack. (See rule 404, \"Triggered Abilities.\") Once all such abilities have gone onto the stack, the active player gets priority. Then players may play spells and abilities."
    },
    "422.1": {
        "navigation": {
            "nextRule": "422.2",
            "previousRule": "421.5"
        },
        "ruleNumber": "422.1",
        "examples": null,
        "ruleText": "If a player realizes that he or she can't legally take an action after starting to do so, the entire action is reversed and any payments already made are canceled. No abilities trigger and no effects apply as a result of an undone action. If the action was playing a spell, the spell card returns to the zone it came from. The player may also reverse any legal mana abilities played while making the illegal play, unless mana from them or from any triggered mana abilities they triggered was spent on another mana ability that wasn't reversed. Players may not reverse actions that moved cards to a library or from a library to any zone other than the stack. Players may not reverse actions that involved a random choice or random zone change."
    },
    "217.4c": {
        "navigation": {
            "nextRule": "217.5",
            "previousRule": "217.4b"
        },
        "ruleNumber": "217.4c",
        "examples": null,
        "ruleText": "If an effect puts two or more cards into the same graveyard at the same time, the owner of those cards may arrange them in any order."
    },
    "502.6a": {
        "navigation": {
            "nextRule": "502.6b",
            "previousRule": "502.6"
        },
        "ruleNumber": "502.6a",
        "examples": null,
        "ruleText": "Landwalk and snow-covered landwalk are generic terms; a card's rules text usually names a specific type of land (such as in \"islandwalk\" or \"snow-covered swampwalk\")."
    },
    "415.2": {
        "navigation": {
            "nextRule": "415.2a",
            "previousRule": "415.1"
        },
        "ruleNumber": "415.2",
        "examples": null,
        "ruleText": "The target of a spell or ability can change only to another legal target. If the new target is illegal when the change resolves, the original target is unchanged."
    },
    "208.2": {
        "navigation": {
            "nextRule": "209.1",
            "previousRule": "208.1"
        },
        "ruleNumber": "208.2",
        "examples": null,
        "ruleText": "Some creature cards have power and/or toughness of *, where * is a value determined by the text in the creature's text box. As long as the creature card is in play, the value of * is treated just as if that number were actually printed on the card. The * is 0 while the card is not in play."
    },
    "406.2a": {
        "navigation": {
            "nextRule": "406.2b",
            "previousRule": "406.2"
        },
        "ruleNumber": "406.2a",
        "examples": null,
        "ruleText": "An effect may create a delayed triggered ability that can do something at a later time."
    },
    "420.3": {
        "navigation": {
            "nextRule": "420.4",
            "previousRule": "420.2"
        },
        "ruleNumber": "420.3",
        "examples": null,
        "ruleText": "Whenever a player would get priority to play a spell or ability (see rule 408, \"Timing of Spells and Abilities\"), the game checks for any of the listed conditions for state-based effects. All applicable effects resolve as a single event, then the check is repeated. Once no more state-based effects have been generated, triggered abilities go on the stack, then the appropriate player gets priority. This check is also made during the cleanup step (see rule 314); if any of the listed conditions apply, the active player receives priority."
    },
    "410.9c": {
        "navigation": {
            "nextRule": "410.9d",
            "previousRule": "410.9b"
        },
        "ruleNumber": "410.9c",
        "examples": null,
        "ruleText": "An ability that reads \"Whenever a creature blocks [this creature]\" triggers once for each creature that blocks the named creature. It doesn't trigger if the attacking creature becomes blocked by an effect rather than a blocking creature."
    },
    "419.5": {
        "navigation": {
            "nextRule": "419.6",
            "previousRule": "419.4"
        },
        "ruleNumber": "419.5",
        "examples": null,
        "ruleText": "If an event is prevented or replaced, it never happens. A modified event occurs instead, which may in turn trigger abilities. Note that the modified event may contain instructions that can't be carried out, in which case the player simply ignores the impossible instruction. If a source would deal 0 damage, it does not deal damage at all. That means abilities that trigger on damage being dealt won't trigger. It also means that replacement effects that increase damage dealt have no event to replace when 0 damage is dealt, so they have no effect. Some abilities read, \"Whenever [X], you may [Y]. If you do, [Z].\" The \"if you do\" clause refers to doing any part of the event Y. If Y is replaced entirely or in part by a different event, the \"if you do\" clause refers to the event that replaced Y."
    },
    "406.1c": {
        "navigation": {
            "nextRule": "406.1d",
            "previousRule": "406.1b"
        },
        "ruleNumber": "406.1c",
        "examples": "Example: A card has an ability that reads \"T: Add G to your mana pool for each creature you control.\" This is still a mana ability even if you control no creatures, or if the card is already tapped.",
        "ruleText": "A mana ability remains a mana ability even if the game state doesn't allow it to produce mana."
    },
    "305.2": {
        "navigation": {
            "nextRule": "305.3",
            "previousRule": "305.1"
        },
        "ruleNumber": "305.2",
        "examples": null,
        "ruleText": "The main phase has no steps, so a main phase ends when both players pass in succession while the stack is empty."
    },
    "401.2": {
        "navigation": {
            "nextRule": "401.3",
            "previousRule": "401.1"
        },
        "ruleNumber": "401.2",
        "examples": null,
        "ruleText": "Each card type other than land has a corresponding spell type. For example, a played creature card is a creature spell until it resolves, is countered, or leaves the stack. An instant or sorcery spell is targeted if it uses the phrase \"target [something]\" in its spell text, where the \"something\" is a phrase that describes a permanent, spell, ability, card, or player. Also, local enchantment spells target the permanent they will enchant."
    },
    "410.2": {
        "navigation": {
            "nextRule": "410.3",
            "previousRule": "410.1"
        },
        "ruleNumber": "410.2",
        "examples": null,
        "ruleText": "Whenever a game event or game state matches a triggered ability's trigger event, that ability triggers. When a phase or step begins, all abilities that trigger \"at the beginning of\" that phase or step trigger. The ability doesn't do anything when it triggers but automatically puts a pseudospell (see rule 217.6b) on the stack as soon as a player would receive priority. The ability (and the pseudospell) is controlled by the player who controlled its source at the time it triggered. If the ability says a player \"may\" do something, that player makes all choices for that instruction. If the ability says this for more than one player, each player specified makes the choices for their instructions. See also rule 410.6."
    },
    "412.5": {
        "navigation": {
            "nextRule": "413.1",
            "previousRule": "412.4"
        },
        "ruleNumber": "412.5",
        "examples": null,
        "ruleText": "Unlike spells and other kinds of abilities, static abilities can't use a card or permanent's last known information for purposes of determining how their effects are applied."
    },
    "308.5a": {
        "navigation": {
            "nextRule": "308.6",
            "previousRule": "308.5"
        },
        "ruleNumber": "308.5a",
        "examples": null,
        "ruleText": "A creature is considered attacking alone if it's the sole creature declared as an attacker in a given combat phase."
    },
    "209.1": {
        "navigation": {
            "nextRule": "210.1",
            "previousRule": "208.2"
        },
        "ruleNumber": "209.1",
        "examples": null,
        "ruleText": "The illustration credit for a card is printed directly below the text box. The credit has no effect on game play."
    },
    "502.20": {
        "navigation": {
            "nextRule": "502.20a",
            "previousRule": "502.19a"
        },
        "ruleNumber": "502.20",
        "examples": null,
        "ruleText": "Fading"
    },
    "213.2": {
        "navigation": {
            "nextRule": "214.1",
            "previousRule": "213.1"
        },
        "ruleNumber": "213.2",
        "examples": null,
        "ruleText": "A spell's spell type is the same as its card type. Its subtypes are the same as its card's subtypes."
    },
    "502.7": {
        "navigation": {
            "nextRule": "502.7a",
            "previousRule": "502.6e"
        },
        "ruleNumber": "502.7",
        "examples": null,
        "ruleText": "Protection"
    },
    "214.8": {
        "navigation": {
            "nextRule": "214.8a",
            "previousRule": "214.7c"
        },
        "ruleNumber": "214.8",
        "examples": null,
        "ruleText": "Enchantments"
    },
    "202.3": {
        "navigation": {
            "nextRule": "203.1",
            "previousRule": "202.2"
        },
        "ruleNumber": "202.3",
        "examples": null,
        "ruleText": "Two cards have the same name if the English versions of their names are identical, regardless of anything else printed on the cards."
    },
    "418.5b": {
        "navigation": {
            "nextRule": "418.5c",
            "previousRule": "418.5a"
        },
        "ruleNumber": "418.5b",
        "examples": null,
        "ruleText": "An effect is said to \"depend on\" another if applying the other would change the text or the existence of the first effect, what it applies to, or what it does to any of the things it applies to. Otherwise, the effect is considered to be independent of the first effect."
    },
    "502.18b": {
        "navigation": {
            "nextRule": "502.19",
            "previousRule": "502.18a"
        },
        "ruleNumber": "502.18b",
        "examples": null,
        "ruleText": "Although the cycling ability is playable only if the card is in a player's hand, it continues to exist while the card is in play. Therefore cards with cycling will be affected by effects that depend on a card in a graveyard or a permanent having one or more activated abilities."
    },
    "504.3": {
        "navigation": {
            "nextRule": "504.4",
            "previousRule": "504.2"
        },
        "ruleNumber": "504.3",
        "examples": null,
        "ruleText": "You may look at a face-down spell you control on the stack or a face-down permanent you control at any time. You can't look at face-down cards in any other zone or face-down spells or permanents controlled by another player. The card or rules that allow a permanent to be face down may also allow the permanent's controller to turn it face up. Spells normally can't be turned face up."
    },
    "412.1": {
        "navigation": {
            "nextRule": "412.2",
            "previousRule": "411.3a"
        },
        "ruleNumber": "412.1",
        "examples": null,
        "ruleText": "A static ability may generate a continuous effect or a prevention or replacement effect. These effects last as long as the permanent with the static ability remains in play."
    },
    "410.10e": {
        "navigation": {
            "nextRule": "410.11",
            "previousRule": "410.10d"
        },
        "ruleNumber": "410.10e",
        "examples": null,
        "ruleText": "Some permanents have text that reads \"[This permanent] comes into play with . . . ,\" \"As [this permanent] comes into play . . . ,\" \"[This permanent] comes into play as . . . ,\" or \"[This permanent] comes into play tapped.\" Such text is a static ability-not a triggered ability-whose effect occurs as part of the event that puts the permanent into play."
    },
    "217.4b": {
        "navigation": {
            "nextRule": "217.4c",
            "previousRule": "217.4a"
        },
        "ruleNumber": "217.4b",
        "examples": null,
        "ruleText": "Each graveyard is kept in a single face-up pile. A player can examine the cards in any graveyard at any time but can't change their order."
    },
    "214.8a": {
        "navigation": {
            "nextRule": "214.8b",
            "previousRule": "214.8"
        },
        "ruleNumber": "214.8a",
        "examples": null,
        "ruleText": "A global enchantment simply has \"enchantment\" as its type. Local enchantments comprise various subtypes: enchant artifact, enchant creature, enchant enchantment, enchant land, and enchant permanent."
    },
    "502.10c": {
        "navigation": {
            "nextRule": "502.10d",
            "previousRule": "502.10b"
        },
        "ruleNumber": "502.10c",
        "examples": null,
        "ruleText": "A player may declare as many attacking bands as he or she wants, but each creature may be a member of only one of them."
    },
    "502.15g": {
        "navigation": {
            "nextRule": "502.15h",
            "previousRule": "502.15f"
        },
        "ruleNumber": "502.15g",
        "examples": "Example: A creature is affected by Giant Growth and then phases out during the same turn. If the creature phases back in somehow before the turn is over, it won't get the +3/+3 bonus from the Giant Growth because its effect has a limited duration.",
        "ruleText": "Effects with limited duration and delayed triggered abilities that specifically reference a permanent will be unable to further affect that permanent if it phases out. However, other effects that reference the permanent (including effects with unlimited duration) can affect the permanent when it returns to play."
    },
    "410.10a": {
        "navigation": {
            "nextRule": "410.10b",
            "previousRule": "410.10"
        },
        "ruleNumber": "410.10a",
        "examples": null,
        "ruleText": "Comes-into-play abilities trigger when a permanent enters the in-play zone. These are written, \"When [this card] comes into play, . . . \" or \"Whenever a [type] comes into play, . . .\" Each time an event puts one or more permanents into play, all permanents in play (including the newcomers) are checked for any comes-into-play triggers that match the event."
    },
    "502.10f": {
        "navigation": {
            "nextRule": "502.10g",
            "previousRule": "502.10e"
        },
        "ruleNumber": "502.10f",
        "examples": null,
        "ruleText": "Banding doesn't cause attacking creatures to share abilities, nor does it remove any abilities. The attacking creatures in a band are separate permanents."
    },
    "410.3": {
        "navigation": {
            "nextRule": "410.4",
            "previousRule": "410.2"
        },
        "ruleNumber": "410.3",
        "examples": null,
        "ruleText": "If multiple abilities have triggered since the last time a player received priority, pseudospells controlled by the active player go on the stack first, in any order he or she chooses, then those controlled by the opponent go on the stack in any order that opponent chooses. Then players once again check for and resolve state-based effects until none are generated, then abilities that triggered during this process go on the stack. This process repeats until no new state-based effects are generated and no abilities trigger. Then the appropriate player gets priority."
    },
    "217.9b": {
        "navigation": {
            "nextRule": "217.9c",
            "previousRule": "217.9a"
        },
        "ruleNumber": "217.9b",
        "examples": null,
        "ruleText": "When playing for ante, each player puts one random card from his or her deck into his or her ante zone at the beginning of the game. Cards in the ante zone may be examined by either player at any time. At the end of the game, the winner becomes the owner of the cards in each player's ante zone."
    },
    "502.4b": {
        "navigation": {
            "nextRule": "502.4c",
            "previousRule": "502.4a"
        },
        "ruleNumber": "502.4b",
        "examples": null,
        "ruleText": "A creature with flying can't be blocked by creatures without flying. A creature with flying can block a creature with or without flying."
    },
    "502.4a": {
        "navigation": {
            "nextRule": "502.4b",
            "previousRule": "502.4"
        },
        "ruleNumber": "502.4a",
        "examples": null,
        "ruleText": "Flying is an evasion ability."
    },
    "410.11": {
        "navigation": {
            "nextRule": "411.1",
            "previousRule": "410.10e"
        },
        "ruleNumber": "410.11",
        "examples": "Example: A permanent's ability reads, \"When your hand is empty, draw a card.\" If its controller plays the last card from his or her hand, the ability will trigger once and won't trigger again until it has resolved. If its controller plays a spell that reads \"Discard your hand, then draw the same number of cards,\" the ability will trigger during the spell's resolution because the player's hand was momentarily empty.",
        "ruleText": "Some triggered abilities trigger on a game state, such as a player controlling no permanents of a particular type, rather than triggering when an event occurs. These abilities trigger as soon as the game state matches the condition (even if it's not legal to play a spell or ability at that time). These are called state triggers. (Note that state triggers aren't the same as state-based effects.) A state-triggered ability doesn't trigger again until the pseudospell it created has resolved or been countered. Then, if the permanent with the ability is still in play and the game state still matches its trigger condition, the ability will trigger again."
    },
    "100.5": {
        "navigation": {
            "nextRule": "101.1",
            "previousRule": "100.4"
        },
        "ruleNumber": "100.5",
        "examples": null,
        "ruleText": "Most Magic tournaments have special rules (not included here) and may limit the use of some cards, including barring all cards from some older sets. See the Magic DCI Floor Rules for more information."
    },
    "502.10i": {
        "navigation": {
            "nextRule": "502.11",
            "previousRule": "502.10h"
        },
        "ruleNumber": "502.10i",
        "examples": null,
        "ruleText": "Multiple instances of banding on the same creature are redundant."
    },
    "214.8c": {
        "navigation": {
            "nextRule": "214.8d",
            "previousRule": "214.8b"
        },
        "ruleNumber": "214.8c",
        "examples": "Example: An enchant creature spell requires a target creature; a creature enchantment in play must enchant a creature. (See rules 420.5d and 214.8g.)",
        "ruleText": "A local-enchantment spell requires a target whose type is indicated by the enchantment subtype. The local-enchantment permanent the spell puts into play must enchant that type of permanent and comes into play attached to the permanent the spell targeted. Any additional targeting requirements are indicated by phrases like \"[This card] can enchant only a [permanent with specified characteristics].\" These restrictions apply to playing the spell, and they become restrictions on what the resulting permanent can enchant. Similar restrictions can limit what a permanent can be enchanted by. For example, a permanent might have an ability that reads \"[This card] can't be enchanted by [local enchantments with specified characteristics].\""
    },
    "308.6": {
        "navigation": {
            "nextRule": "309.1",
            "previousRule": "308.5a"
        },
        "ruleNumber": "308.6",
        "examples": null,
        "ruleText": "After a legal attack has been declared and all required costs have been paid, the active player receives priority to play spells and abilities."
    },
    "421.2": {
        "navigation": {
            "nextRule": "421.3",
            "previousRule": "421.1"
        },
        "ruleNumber": "421.2",
        "examples": null,
        "ruleText": "If the loop contains one or more optional actions and one player controls them all, that player chooses a number. The loop is treated as repeating that many times or until the other player intervenes, whichever comes first."
    },
    "415.3": {
        "navigation": {
            "nextRule": "415.4",
            "previousRule": "415.2b"
        },
        "ruleNumber": "415.3",
        "examples": "Example: If an effect changes a black creature spell to white, the creature is white when it comes into play and remains white for the duration of the effect changing its color.",
        "ruleText": "If an effect edits any characteristics of a spell that becomes a permanent, the effect continues to apply to the permanent when the spell resolves."
    },
    "419.6c": {
        "navigation": {
            "nextRule": "419.6d",
            "previousRule": "419.6b"
        },
        "ruleNumber": "419.6c",
        "examples": null,
        "ruleText": "Some effects replace damage dealt to one creature or player with the same damage dealt to another creature or player; such effects are called \"redirection\" effects. If either creature is no longer in play or is no longer a creature when the damage would be redirected, the effect does nothing. Likewise, if either player is no longer in the game, the effect does nothing."
    },
    "502.15j": {
        "navigation": {
            "nextRule": "502.15k",
            "previousRule": "502.15i"
        },
        "ruleNumber": "502.15j",
        "examples": null,
        "ruleText": "If a local enchantment phased out directly (rather than phasing out along with the permanent it's attached to), then it \"remembers\" the permanent it was enchanting and returns to play attached to that permanent. If the permanent has left play or is no longer legal to enchant, the enchantment returns to play and then is placed in its owner's graveyard afterwards. (This is a state-based effect. See rule 420.)"
    },
    "418.5c": {
        "navigation": {
            "nextRule": "418.5d",
            "previousRule": "418.5b"
        },
        "ruleNumber": "418.5c",
        "examples": null,
        "ruleText": "Whenever one effect depends on another, the independent one is applied first. If several dependent effects form a loop, or if none depends on another, they're applied in \"timestamp order.\" A card or permanent's timestamp is the time it entered the zone it's currently in, with two exceptions: (1) If two or more cards or permanents enter a zone (or zones) simultaneously, the active player determines their timestamp order at the time they enter that zone, but a local enchantment must be timestamped after what it enchants. (2) Whenever a local enchantment becomes attached to a permanent, the enchantment receives a new timestamp. Continuous effects generated by static abilities have the same timestamp as the card or permanent that generated them. Continuous effects generated by the resolution of a spell or ability receive a timestamp when the spell or ability creating them resolves."
    },
    "420.5j": {
        "navigation": {
            "nextRule": "421.1",
            "previousRule": "420.5i"
        },
        "ruleNumber": "420.5j",
        "examples": null,
        "ruleText": "A copy of a spell in a zone other than the stack ceases to exist."
    },
    "401.1": {
        "navigation": {
            "nextRule": "401.2",
            "previousRule": "400.1"
        },
        "ruleNumber": "401.1",
        "examples": null,
        "ruleText": "A card on the stack is a spell. As the first step of being played, the card becomes a spell and goes on the stack from the zone it was played from (usually the player's hand). (See rule 217.6, \"Stack.\") A copy of a spell is also a spell, even if it has no card associated with it. A spell stops being a spell when it resolves (see rule 413.2), is countered (see rule 414, \"Countering Spells and Abilities\"), or leaves the stack somehow."
    },
    "308.4": {
        "navigation": {
            "nextRule": "308.5",
            "previousRule": "308.3"
        },
        "ruleNumber": "308.4",
        "examples": null,
        "ruleText": "If no creatures are declared as attackers, the game proceeds directly to the end of combat step, skipping the remainder of the declare attackers step as well as the entire declare blockers and combat damage steps."
    },
    "502.3c": {
        "navigation": {
            "nextRule": "502.4",
            "previousRule": "502.3b"
        },
        "ruleNumber": "502.3c",
        "examples": null,
        "ruleText": "If a creature has multiple instances of flanking, each triggers separately."
    },
    "502.15h": {
        "navigation": {
            "nextRule": "502.15i",
            "previousRule": "502.15g"
        },
        "ruleNumber": "502.15h",
        "examples": "Example: Diseased Vermin reads, in part, \"At the beginning of your upkeep, Diseased Vermin deals X damage to target opponent previously dealt damage by it, where X is the number of infection counters on it.\" If Diseased Vermin phases out, it \"remembers\" how many counters it has and also which opponents it has previously damaged. When it phases back in, it will still be able to target those opponents with its upkeep-triggered ability.",
        "ruleText": "Phased-out cards \"remember\" their past histories and will return to play in the same state. They \"remember\" any counters they had on them, any choices made when they first came into play, and whether they were tapped or untapped when they left play. They also \"remember\" who controlled them when they phased out, although they may phase in under the control of a different player if a control effect with limited duration has expired. "
    },
    "217.8": {
        "navigation": {
            "nextRule": "217.8a",
            "previousRule": "217.7c"
        },
        "ruleNumber": "217.8",
        "examples": null,
        "ruleText": "Phased-Out"
    },
    "505.7": {
        "navigation": {
            "nextRule": null,
            "previousRule": "505.6"
        },
        "ruleNumber": "505.7",
        "examples": null,
        "ruleText": "If an effect instructs a player to name a card and the player wants to name a split card, the player must name both halves of the split card."
    },
    "501.3": {
        "navigation": {
            "nextRule": "502.1",
            "previousRule": "501.2"
        },
        "ruleNumber": "501.3",
        "examples": null,
        "ruleText": "Some creatures have abilities that restrict how they can block. As with evasion abilities, these modify only the rules for the declare blockers step of combat. (If a creature gains an evasion ability after a legal block has been declared, it doesn't affect that block.)"
    },
    "100.2": {
        "navigation": {
            "nextRule": "100.3",
            "previousRule": "100.1"
        },
        "ruleNumber": "100.2",
        "examples": null,
        "ruleText": "In constructed play, each player needs his or her own deck of at least sixty cards, small objects to represent any tokens and counters, and some way to clearly track life totals. A constructed deck can have any number of basic land cards and no more than four of any card with a particular English name other than basic land cards. "
    },
    "502.11": {
        "navigation": {
            "nextRule": "502.11a",
            "previousRule": "502.10i"
        },
        "ruleNumber": "502.11",
        "examples": null,
        "ruleText": "Bands with Other"
    },
    "201.2": {
        "navigation": {
            "nextRule": "202.1",
            "previousRule": "201.1"
        },
        "ruleNumber": "201.2",
        "examples": null,
        "ruleText": "A card, spell, or permanent's characteristics are name, mana cost, color, type and subtype, expansion symbol, rules text, power, and toughness. Any other information about a card, spell, or permanent isn't a characteristic. Characteristics don't include any other information, such as whether a permanent is tapped, a spell's target, a spell or permanent's controller, what a local enchantment enchants, and so on."
    },
    "505.2": {
        "navigation": {
            "nextRule": "505.3",
            "previousRule": "505.1"
        },
        "ruleNumber": "505.2",
        "examples": null,
        "ruleText": "In every zone except the stack, split cards have two sets of characteristics. As long as a split card is on the stack, only the characteristics of the half being played exist. The other half's characteristics are treated as though they didn't exist."
    },
    "502.15m": {
        "navigation": {
            "nextRule": "502.15n",
            "previousRule": "502.15k"
        },
        "ruleNumber": "502.15m",
        "examples": null,
        "ruleText": "A permanent that phases in can attack and tap to play abilities as though it has haste. (This applies even if that permanent phased out and phased back in the turn it came into play.) The permanent remains able to attack and tap to play abilities until it changes controllers or leaves play."
    },
    "214.3": {
        "navigation": {
            "nextRule": "214.4",
            "previousRule": "214.2"
        },
        "ruleNumber": "214.3",
        "examples": null,
        "ruleText": "A card becomes a permanent when it comes into play and stops being a permanent when it leaves play. The term \"card\" is often used to refer to a card that's not in play, such as a creature card in a player's hand. \"Spell\" is often used to refer to a card while it's on the stack. \"Spell card\" is used to refer to cards that aren't in play and aren't land cards. For more information, see rule 217, \"Zones.\""
    },
    "502.17": {
        "navigation": {
            "nextRule": "502.17a",
            "previousRule": "502.16a"
        },
        "ruleNumber": "502.17",
        "examples": null,
        "ruleText": "Horsemanship"
    },
    "100.1": {
        "navigation": {
            "nextRule": "100.2",
            "previousRule": "505.7"
        },
        "ruleNumber": "100.1",
        "examples": null,
        "ruleText": "These Magic rules assume a game between two players. Optional rules allow for more players but aren't discussed here. These rules can be found at the Wizards of the Coast website at www.wizards.com/default.asp?x=magic/rules/multiplayer."
    },
    "409.1c": {
        "navigation": {
            "nextRule": "409.1d",
            "previousRule": "409.1b"
        },
        "ruleNumber": "409.1c",
        "examples": null,
        "ruleText": "If the spell or ability requires any targets, the player first announces how many targets he or she will choose (if the spell or ability has a variable number of targets), then announces the targets themselves. A spell or ability can't be played unless the required number of legal targets are chosen. The same target can't be chosen multiple times. If the spell or ability targets one or more targets only if an alternative, additional, or special cost (such as a buyback or kicker cost) is paid for it, or if a particular mode is chosen for it, its controller chooses those targets only if he or she announced the intention to pay that cost or chose that mode. Otherwise, the spell or ability is played as though it did not have those targets."
    },
    "408.2f": {
        "navigation": {
            "nextRule": "408.2g",
            "previousRule": "408.2e"
        },
        "ruleNumber": "408.2f",
        "examples": null,
        "ruleText": "Characteristic-setting text, such as \"[This card] is a forest,\" is simply read and followed as applicable. (See also rule 402.3.)"
    },
    "502.7a": {
        "navigation": {
            "nextRule": "502.7b",
            "previousRule": "502.7"
        },
        "ruleNumber": "502.7a",
        "examples": null,
        "ruleText": "Protection is a static ability, written \"Protection from [quality].\" This quality is usually a color (as in \"protection from black\") but can be any characteristic. If the quality is a type, the protection applies to sources that are permanents with that type and to any sources that aren't in play that are of that type."
    },
    "502.5a": {
        "navigation": {
            "nextRule": "502.5b",
            "previousRule": "502.5"
        },
        "ruleNumber": "502.5a",
        "examples": null,
        "ruleText": "Haste is a static ability."
    },
    "300.5": {
        "navigation": {
            "nextRule": "300.6",
            "previousRule": "300.4"
        },
        "ruleNumber": "300.5",
        "examples": null,
        "ruleText": "When a phase or step begins, any abilities that trigger \"at the beginning of\" that phase or step are added to the stack."
    },
    "420.5a": {
        "navigation": {
            "nextRule": "420.5b",
            "previousRule": "420.5"
        },
        "ruleNumber": "420.5a",
        "examples": null,
        "ruleText": "A player with 0 life or less loses the game."
    },
    "502.15p": {
        "navigation": {
            "nextRule": "502.16",
            "previousRule": "502.15n"
        },
        "ruleNumber": "502.15p",
        "examples": null,
        "ruleText": "Multiple instances of phasing on the same permanent are redundant."
    },
    "214.6a": {
        "navigation": {
            "nextRule": "214.6b",
            "previousRule": "214.6"
        },
        "ruleNumber": "214.6a",
        "examples": null,
        "ruleText": "Artifacts have no characteristics specific to their type. Because artifact spells have no colored mana in their mana costs, they're colorless, and the permanents they create are also colorless. Effects can give artifact spells or artifacts one or more colors, however."
    },
    "420.2": {
        "navigation": {
            "nextRule": "420.3",
            "previousRule": "420.1"
        },
        "ruleNumber": "420.2",
        "examples": null,
        "ruleText": "State-based effects are always active and are not controlled by either player."
    },
    "214.8f": {
        "navigation": {
            "nextRule": "214.8g",
            "previousRule": "214.8e"
        },
        "ruleNumber": "214.8f",
        "examples": null,
        "ruleText": "A local enchantment can't be attached to itself. If this occurs somehow, the local enchantment is put into its owner's graveyard as a state-based effect (see rule 420.5d)."
    },
    "502.28d": {
        "navigation": {
            "nextRule": "502.28e",
            "previousRule": "502.28c"
        },
        "ruleNumber": "502.28d",
        "examples": null,
        "ruleText": "Giving double strike to a creature after combat damage has been put onto the stack in the first combat damage step will allow the creature to assign combat damage in the second combat damage step, even if it already assigned combat damage in the first combat damage step."
    },
    "502.15n": {
        "navigation": {
            "nextRule": "502.15p",
            "previousRule": "502.15m"
        },
        "ruleNumber": "502.15n",
        "examples": null,
        "ruleText": "A spell or ability that targets a permanent will resolve normally with respect to that permanent if the permanent phases out and back in before the spell or ability resolves."
    },
    "217.8c": {
        "navigation": {
            "nextRule": "217.8d",
            "previousRule": "217.8b"
        },
        "ruleNumber": "217.8c",
        "examples": null,
        "ruleText": "Phased-out cards do not count as tapped or untapped, nor are they controlled by anyone. However, cards in this zone \"remember\" their previous state and return to play in the same state as when they left. (See rule 502.15, \"Phasing.\") This is an exception to rule 217.5c."
    },
    "502.10h": {
        "navigation": {
            "nextRule": "502.10i",
            "previousRule": "502.10g"
        },
        "ruleNumber": "502.10h",
        "examples": null,
        "ruleText": "A player who controls a banding creature chooses how combat damage is assigned by creatures blocking or blocked by that creature. If the creature had banding when it attacked or blocked, but the ability was removed before the combat damage step, damage is assigned normally."
    },
    "419.3": {
        "navigation": {
            "nextRule": "419.4",
            "previousRule": "419.2"
        },
        "ruleNumber": "419.3",
        "examples": null,
        "ruleText": "There are no special restrictions on playing a spell or ability that generates a replacement or prevention effect. Such effects last until they're used up or their duration has expired."
    },
    "502.28c": {
        "navigation": {
            "nextRule": "502.28d",
            "previousRule": "502.28b"
        },
        "ruleNumber": "502.28c",
        "examples": null,
        "ruleText": "Removing double strike from a creature during the first combat damage step will stop it from assigning combat damage in the second combat damage step."
    },
    "408.2b": {
        "navigation": {
            "nextRule": "408.2c",
            "previousRule": "408.2a"
        },
        "ruleNumber": "408.2b",
        "examples": null,
        "ruleText": "Static abilities continuously generate effects and don't go on the stack."
    },
    "217.7c": {
        "navigation": {
            "nextRule": "217.8",
            "previousRule": "217.7b"
        },
        "ruleNumber": "217.7c",
        "examples": null,
        "ruleText": "Cards that might return to play should be kept in separate piles to keep track of their respective ways of returning. Cards with no way of returning may be kept in one pile for each player, regardless of what removed them."
    },
    "419.7c": {
        "navigation": {
            "nextRule": "419.8",
            "previousRule": "419.7b"
        },
        "ruleNumber": "419.7c",
        "examples": null,
        "ruleText": "Some prevention effects apply to damage from a specified source-for example, \"The next time a red source of your choice would deal damage to you this turn, prevent that damage.\" The source is chosen when the spell or ability resolves. If an effect requires a player to choose a source, he or she may choose either a permanent or a spell on the stack (including one that creates a permanent) or any card or permanent referred to by a spell or pseudospell on the stack. If the player chooses a permanent or a permanent spell, the prevention will apply to the next damage from that permanent or the permanent resulting from the spell, regardless of whether it's from one of that permanent's abilities or combat damage dealt by it. It's possible for the source to be out of play by the time the spell or ability resolves. Some abilities that generate prevention effects can affect damage only from a source with certain characteristics, such as a creature or a source of a particular color. When the chosen source would deal damage, a prevention \"shield\" with this type of restriction rechecks the source's characteristics. If the characteristics no longer match, the damage isn't prevented. If for any reason the shield prevents no damage, the shield isn't used up."
    },
    "502.28": {
        "navigation": {
            "nextRule": "502.28a",
            "previousRule": "502.27b"
        },
        "ruleNumber": "502.28",
        "examples": null,
        "ruleText": "Double Strike"
    },
    "204.1": {
        "navigation": {
            "nextRule": "205.1",
            "previousRule": "203.4"
        },
        "ruleNumber": "204.1",
        "examples": null,
        "ruleText": "The illustration is printed on the upper half of a card and has no game significance. For example, a creature doesn't have the flying ability unless stated in its rules text, even if it's depicted as flying."
    },
    "415.4": {
        "navigation": {
            "nextRule": "416.1",
            "previousRule": "415.3"
        },
        "ruleNumber": "415.4",
        "examples": null,
        "ruleText": "An effect that changes the text of a spell or permanent only changes words that are of the correct type (for example, a Magic color word being used as a color word, a land type word used as a land type, or a creature type word used as a creature type). The effect can't change a proper noun, such as a card name, even if that proper noun contains a word or a series of letters that is the same as a Magic color word, basic land type, or creature type. Spells and abilities that create creature tokens use creature types to define both the creature types and the names of the tokens. These words can be changed, because they are being used as creature types, even though they're also being used as names. Once a token has been created, it has its creature type and name printed on it. The creature type of a creature token in play can be changed, but its name can't."
    },
    "214.7a": {
        "navigation": {
            "nextRule": "214.7b",
            "previousRule": "214.7"
        },
        "ruleNumber": "214.7a",
        "examples": "Example: \"Merfolk\" or \"Wizard\" is acceptable, but \"Merfolk Wizard\" is not. Words like \"artifact,\" \"opponent,\" \"swamp,\" or \"truck\" can't be chosen because they aren't creature types.",
        "ruleText": "If a card instruction requires choosing a creature subtype, you must choose one, and only one, existing creature type."
    },
    "206.2": {
        "navigation": {
            "nextRule": "206.3",
            "previousRule": "206.1"
        },
        "ruleNumber": "206.2",
        "examples": null,
        "ruleText": "The color of the expansion symbol indicates the rarity of the card within its set. A gold symbol signifies the card is rare; silver, uncommon; and black, common or basic land. (Prior to the Exodus™ set, all expansion symbols were black, regardless of rarity. Also, prior to the Classic™ (Sixth Edition) set, Magic basic sets didn't have expansion symbols at all.)"
    },
    "309.4": {
        "navigation": {
            "nextRule": "309.4a",
            "previousRule": "309.3"
        },
        "ruleNumber": "309.4",
        "examples": null,
        "ruleText": "A creature becomes a blocking creature when it has been declared as part of a legal block and all block costs have been paid, but only if it's controlled by the defending player. An attacking creature with one or more creatures declared as blockers for it becomes a blocked creature; one with no blockers becomes an unblocked creature. The creature's status remains unchanged until the creature is removed from combat or the combat phase ends, whichever comes first."
    },
    "502.23c": {
        "navigation": {
            "nextRule": "502.24",
            "previousRule": "502.23b"
        },
        "ruleNumber": "502.23c",
        "examples": null,
        "ruleText": "An instant or sorcery card with threshold has the threshold text only while the card is on the stack (that is, while it's a spell). An artifact, creature, enchantment, or land card with threshold, or any permanent with threshold, has the threshold text only if the card or permanent is in play. "
    },
    "418.5d": {
        "navigation": {
            "nextRule": "418.5e",
            "previousRule": "418.5c"
        },
        "ruleNumber": "418.5d",
        "examples": "Example: Two enchantments are played on the same creature: \"Enchanted creature gains flying\" and \"Enchanted creature loses flying.\" Neither of these depends on the other, since nothing changes what they affect or what they're doing to it. Applying them in timestamp order means the one that was generated last \"wins.\" It's irrelevant whether an effect is temporary (such as \"Target creature loses flying until end of turn\") or global (such as \"All creatures lose flying\").",
        "ruleText": "A continuous effect can override another."
    },
    "217.1c": {
        "navigation": {
            "nextRule": "217.1d",
            "previousRule": "217.1b"
        },
        "ruleNumber": "217.1c",
        "examples": null,
        "ruleText": "A card that moves from one zone to another is treated as a new card. Effects connected with its previous location will no longer affect it. There are two exceptions to this rule: Effects that edit the characteristics of a spell on the stack will continue to apply to the permanent that spell creates, and abilities that trigger when a card moves from one zone to another (for example, \"When Rancor is put into a graveyard from play\") can find the card in the zone it moved to when the ability triggered."
    },
    "504.2": {
        "navigation": {
            "nextRule": "504.3",
            "previousRule": "504.1"
        },
        "ruleNumber": "504.2",
        "examples": null,
        "ruleText": "Face-down cards on the stack, face-down cards and tokens in play, and face-down cards in the phased-out zone have no characteristics other than those listed by the card or rules that allow the card or token to be face down. Any listed characteristics are that card or token's initial characteristics. Permanents that are put into play face down are turned face down before they come into play, so the permanent's comes-into-play abilities won't trigger (if triggered) or have any effect (if static). Spells that are played face down are turned face down before they are put onto the stack, so effects that care about the characteristics of a spell will see only the face-down spell's characteristics."
    },
    "502.2": {
        "navigation": {
            "nextRule": "502.2a",
            "previousRule": "502.1"
        },
        "ruleNumber": "502.2",
        "examples": null,
        "ruleText": "First Strike"
    },
    "214.9a": {
        "navigation": {
            "nextRule": "214.9b",
            "previousRule": "214.9"
        },
        "ruleNumber": "214.9a",
        "examples": null,
        "ruleText": "A land card isn't a spell card, and at no time is it a spell. When a player plays a land card, it's simply put into play. The land card doesn't go on the stack, so players can't respond to it with instants or activated abilities."
    },
    "409.4": {
        "navigation": {
            "nextRule": "410.1",
            "previousRule": "409.3"
        },
        "ruleNumber": "409.4",
        "examples": null,
        "ruleText": "A player can't begin to play a spell or activated ability that's prohibited from being played by an effect. "
    },
    "410.10b": {
        "navigation": {
            "nextRule": "410.10c",
            "previousRule": "410.10a"
        },
        "ruleNumber": "410.10b",
        "examples": "Example: If an effect reads \"All lands are creatures\" and a land card is played, the effect makes the land card into a creature the moment it enters play, so it would trigger abilities that trigger when a creature comes into play. Conversely, if an effect reads \"All creatures lose all abilities\" and a creature card with a comes-into-play triggered ability enters play, that effect will cause it to lose its abilities the moment it enters play, so the comes-into-play ability won't trigger.",
        "ruleText": "Continuous effects that modify characteristics of a permanent do so the moment the permanent is in play (and not before then). The permanent is never in play with its unmodified characteristics. Continuous effects don't apply before the permanent is in play, however (see rule 410.10e)."
    },
    "500.4": {
        "navigation": {
            "nextRule": "500.5",
            "previousRule": "500.3"
        },
        "ruleNumber": "500.4",
        "examples": null,
        "ruleText": "A restriction conflicts with a proposed set of attackers or blockers if it isn't being followed. A requirement conflicts with a proposed set of attackers or blockers if it isn't being followed and 1) the requirement could be obeyed without conflicting with a restriction that the set does obey and 2) obeying the requirement will increase the number of requirements that the set obeys."
    },
    "409.1b": {
        "navigation": {
            "nextRule": "409.1c",
            "previousRule": "409.1a"
        },
        "ruleNumber": "409.1b",
        "examples": null,
        "ruleText": "If the spell or ability is modal (uses the phrase \"Choose one -\" or \"[specified player] chooses one -\"), the player announces the mode choice. If the spell or ability has a variable mana cost (indicated by \"X\") or some other variable cost, the player announces the value of that variable at this time. If the spell or ability has alternative, additional, or other special costs (such as buyback or kicker costs), the player announces his or her intentions to pay any or all of those costs (see rule 409.1f). Previously made choices (such as choosing to play a spell with flashback from his or her graveyard or choosing to play a creature with morph face down) may restrict the player's options when making these choices."
    },
    "102.5": {
        "navigation": {
            "nextRule": "102.6",
            "previousRule": "102.4"
        },
        "ruleNumber": "102.5",
        "examples": null,
        "ruleText": "If a player would both win and lose simultaneously, he or she loses."
    },
    "408.1a": {
        "navigation": {
            "nextRule": "408.1b",
            "previousRule": "408.1"
        },
        "ruleNumber": "408.1a",
        "examples": null,
        "ruleText": "Spells and abilities can be played only at certain times and follow a set of rules for doing so."
    },
    "102.8": {
        "navigation": {
            "nextRule": "103.1",
            "previousRule": "102.7"
        },
        "ruleNumber": "102.8",
        "examples": null,
        "ruleText": "If a player has ten or more poison counters, he or she loses the game the next time a player would receive priority. (This is a state-based effect. See rule 420.)"
    },
    "305.3": {
        "navigation": {
            "nextRule": "305.4",
            "previousRule": "305.2"
        },
        "ruleNumber": "305.3",
        "examples": null,
        "ruleText": "As the main phase begins, any abilities that trigger at the beginning of that main phase go on the stack. (See rule 404, \"Triggered Abilities.\") Then the active player gets priority, and players may play spells and abilities. (This is the only phase in which a player can normally play artifact, creature, enchantment, and sorcery spells, and only the active player may play these spells.)"
    },
    "206.1": {
        "navigation": {
            "nextRule": "206.2",
            "previousRule": "205.1"
        },
        "ruleNumber": "206.1",
        "examples": null,
        "ruleText": "The expansion symbol indicates which Magic set a card is from. It's printed below the right edge of the illustration."
    },
    "213.1": {
        "navigation": {
            "nextRule": "213.2",
            "previousRule": "212.2d"
        },
        "ruleNumber": "213.1",
        "examples": null,
        "ruleText": "Every nonland card is a spell while it's being played (see rules 409.1a-409.1f) and while it's on the stack. Once it's played, a card remains a spell until it resolves or is countered. For more information, see rule 401, \"Spells.\""
    },
    "502.9f": {
        "navigation": {
            "nextRule": "502.9g",
            "previousRule": "502.9e"
        },
        "ruleNumber": "502.9f",
        "examples": "Example: A 2/2 creature with an ability that enables it to block multiple attackers blocks two attackers: a 1/1 with no special abilities a 3/3 with trample. The active player could assign 1 damage from the first attacker and 1 damage from the second to the blocking creature, and 2 damage to the defending player from the creature with trample.",
        "ruleText": "When there are several attacking creatures, it's legal to assign damage from those without trample so as to maximize the damage of those with trample."
    },
    "417.2": {
        "navigation": {
            "nextRule": "418.1",
            "previousRule": "417.1"
        },
        "ruleNumber": "417.2",
        "examples": null,
        "ruleText": "Some one-shot effects instruct a player to do something later in the game (usually at a specific time) rather than when they resolve. This kind of effect actually creates a new ability that waits to be triggered. (See rule 406.2, \"Delayed Triggered Abilities.\")"
    },
    "502.5b": {
        "navigation": {
            "nextRule": "502.5c",
            "previousRule": "502.5a"
        },
        "ruleNumber": "502.5b",
        "examples": null,
        "ruleText": "A creature with haste can attack or use activated abilities whose cost includes the tap symbol even if it hasn't been controlled by its controller continuously since the beginning of his or her most recent turn."
    },
    "500.1": {
        "navigation": {
            "nextRule": "500.2",
            "previousRule": "422.2"
        },
        "ruleNumber": "500.1",
        "examples": null,
        "ruleText": "Some abilities and continuous effects restrict declaring attackers or blockers in combat or require certain creatures to be declared as attackers or blockers. (See rule 308, \"Declare Attackers Step,\" and rule 309, \"Declare Blockers Step.\") A restriction is an effect which says that a creature can't block (or attack) or that it can't block (or attack) unless some condition is met. A requirement is an effect which says that a creature must block (or attack) or that it must block (or attack) if some condition is met."
    },
    "305.4": {
        "navigation": {
            "nextRule": "306.1",
            "previousRule": "305.3"
        },
        "ruleNumber": "305.4",
        "examples": null,
        "ruleText": "During either main phase, the active player may play one land from his or her hand if the stack is empty, if the player has priority, and if he or she hasn't yet taken this special action this turn. (See rule 214.9, \"Lands.\") This action doesn't use the stack and it isn't a spell or ability of any kind. It can't be countered, and players can't respond to it with instants or activated abilities."
    },
    "404.1": {
        "navigation": {
            "nextRule": "404.2",
            "previousRule": "403.3"
        },
        "ruleNumber": "404.1",
        "examples": null,
        "ruleText": "A triggered ability begins with the word \"when,\" \"whenever,\" or \"at.\" The phrase containing one of these words is the trigger condition, which defines the trigger event. A delayed triggered ability will also contain one of these three words, although that word won't usually begin the ability."
    },
    "202.1": {
        "navigation": {
            "nextRule": "202.2",
            "previousRule": "201.2"
        },
        "ruleNumber": "202.1",
        "examples": null,
        "ruleText": "The name of a card is printed on its upper left corner."
    },
    "300.2": {
        "navigation": {
            "nextRule": "300.3",
            "previousRule": "300.1"
        },
        "ruleNumber": "300.2",
        "examples": null,
        "ruleText": "A phase or step ends when the stack is empty and both players pass in succession. No game events can occur between turns, phases, or steps. (Simply having the stack become empty doesn't cause the phase or step to end; both players have to pass with the stack empty. Because of this, each player always gets a chance to add new things to the stack before the current phase or step ends.)"
    },
    "418.5a": {
        "navigation": {
            "nextRule": "418.5b",
            "previousRule": "418.5"
        },
        "ruleNumber": "418.5a",
        "examples": null,
        "ruleText": "Sometimes the results of one effect determine whether another effect applies or what it does. For example, one effect might read, \"All white creatures get +1/+1\" and another, \"Enchanted creature is white.\""
    },
    "502.2a": {
        "navigation": {
            "nextRule": "502.2b",
            "previousRule": "502.2"
        },
        "ruleNumber": "502.2a",
        "examples": null,
        "ruleText": "First strike is a static ability that modifies the rules for the combat damage step."
    },
    "419.2": {
        "navigation": {
            "nextRule": "419.3",
            "previousRule": "419.1"
        },
        "ruleNumber": "419.2",
        "examples": null,
        "ruleText": "Replacement and prevention effects apply continuously as events happen-they aren't locked in ahead of time."
    },
    "502.21c": {
        "navigation": {
            "nextRule": "502.21d",
            "previousRule": "502.21b"
        },
        "ruleNumber": "502.21c",
        "examples": null,
        "ruleText": "If spell text that depends on a kicker cost being paid targets one or more permanents and/or players, the spell's controller chooses those targets only if he or she declared the intention to pay the appropriate kicker cost. Otherwise, the targets aren't chosen at all."
    },
    "217.6a": {
        "navigation": {
            "nextRule": "217.6b",
            "previousRule": "217.6"
        },
        "ruleNumber": "217.6a",
        "examples": null,
        "ruleText": "When a spell or ability is played, it goes on top of the stack and waits to resolve. The stack keeps track of the order that spells and/or abilities were added to it. (See rule 408, \"Timing of Spells and Abilities,\" and rule 409.1.)"
    },
    "502.11a": {
        "navigation": {
            "nextRule": "502.11b",
            "previousRule": "502.11"
        },
        "ruleNumber": "502.11a",
        "examples": null,
        "ruleText": "Bands with other is a special form of banding. If an effect causes a permanent to lose banding, the permanent loses all bands with other abilities as well."
    },
    "500.2": {
        "navigation": {
            "nextRule": "500.3",
            "previousRule": "500.1"
        },
        "ruleNumber": "500.2",
        "examples": "Example: A player controls two creatures, each with a restriction that states \"[This creature] can't attack alone.\" It's legal to declare both as attackers.\nExample: A player controls two creatures: one that \"attacks if able\" and one with no abilities. An effect states, \"No more than one creature may attack each turn.\" The only legal attack is for just the creature that \"attacks if able\" to attack. It's illegal to attack with the other creature, attack with both, or attack with neither.",
        "ruleText": "As part of declaring attackers, the active player checks each creature he or she controls to see whether it must attack, can't attack, or has some other attacking restriction or requirement. If such a restriction or requirement conflicts with the proposed attack, the attack is illegal, and the active player must then propose another set of attacking creatures. (Tapped creatures and creatures with unpaid costs to attack are exempt from effects that would require them to attack.)"
    },
    "503.7": {
        "navigation": {
            "nextRule": "503.8",
            "previousRule": "503.6"
        },
        "ruleNumber": "503.7",
        "examples": "Example: Voice of All comes into play and Unstable Shapeshifter copies it. Voice of All reads, in part, \"As Voice of All comes into play, choose a color. / Voice of All has protection from the chosen color.\" Unstable Shapeshifter never got a chance to choose a color, because it didn't come into play as a Voice of All card, so the Shapeshifter's protection ability doesn't protect it from anything at all.",
        "ruleText": "Because the \"choices\" of a permanent aren't copied, sometimes a copy card will gain an ability that refers to a choice that was never made. In that case, the choice is considered to be \"zero\" or \"undefined.\""
    },
    "502.9d": {
        "navigation": {
            "nextRule": "502.9e",
            "previousRule": "502.9c"
        },
        "ruleNumber": "502.9d",
        "examples": null,
        "ruleText": "Ignore this rule."
    },
    "402.4": {
        "navigation": {
            "nextRule": "402.5",
            "previousRule": "402.3"
        },
        "ruleNumber": "402.4",
        "examples": null,
        "ruleText": "An additional cost or alternative cost to play a card isn't an ability of the card. Such text is spell text."
    },
    "217.5": {
        "navigation": {
            "nextRule": "217.5a",
            "previousRule": "217.4c"
        },
        "ruleNumber": "217.5",
        "examples": null,
        "ruleText": "In Play"
    },
    "410.9b": {
        "navigation": {
            "nextRule": "410.9c",
            "previousRule": "410.9a"
        },
        "ruleNumber": "410.9b",
        "examples": null,
        "ruleText": "An ability that reads \"Whenever [this creature] blocks a creature\" triggers once for each attacking creature the named creature blocks."
    },
    "407.3": {
        "navigation": {
            "nextRule": "408.1",
            "previousRule": "407.2"
        },
        "ruleNumber": "407.3",
        "examples": "Example: If a creature with flying is enchanted with Flight, it has two instances of the flying ability. A single effect that reads \"Target creature loses flying\" will remove both.",
        "ruleText": "Effects that remove an ability remove all instances of it."
    },
    "402.10": {
        "navigation": {
            "nextRule": "403.1",
            "previousRule": "402.9"
        },
        "ruleNumber": "402.10",
        "examples": null,
        "ruleText": "There are three general types of abilities: activated, triggered, and static. Mana abilities are an ability subtype. Abilities can generate one-shot effects or continuous effects. Replacement effects and prevention effects are effect subtypes. An activated or triggered ability is targeted if it uses the phrase \"target [something]\" in its text, where the \"something\" is a phrase that describes a permanent, spell, ability, card, or player."
    },
    "217.1d": {
        "navigation": {
            "nextRule": "217.2",
            "previousRule": "217.1c"
        },
        "ruleNumber": "217.1d",
        "examples": null,
        "ruleText": "If a card or permanent would move from one zone to another, first determine what event is moving the card. Then apply any appropriate replacement effects to that event. If an effect tries to do two or more contradictory or mutually exclusive things to a particular card or permanent, that card or permanent's controller-or its owner if it has no controller-chooses what the effect does to the card or permanent. Then the event moves the card or permanent."
    },
    "505.5": {
        "navigation": {
            "nextRule": "505.6",
            "previousRule": "505.4"
        },
        "ruleNumber": "505.5",
        "examples": "Example: Infernal Genesis has an ability that reads, \"At the beginning of each player's upkeep, that player puts the top card of his or her library into his or her graveyard. He or she then puts X 1/1 black Minion creature tokens into play, where X is that card's converted mana cost.\" If the top card of your library is Assault/Battery when this ability resolves, you get five 1/1 creature tokens because Assault's converted mana cost is 1 and Battery's is 4, for a total of 5.",
        "ruleText": "Effects that ask for a particular characteristic of a split card while it's in a zone other than the stack get an answer that consists of a combination of the split card's two halves."
    },
    "309.5": {
        "navigation": {
            "nextRule": "310.1",
            "previousRule": "309.4a"
        },
        "ruleNumber": "309.5",
        "examples": null,
        "ruleText": "After all legal blocks have been declared and all required costs have been paid, the active player receives priority to play spells and abilities."
    },
    "502.21b": {
        "navigation": {
            "nextRule": "502.21c",
            "previousRule": "502.21a"
        },
        "ruleNumber": "502.21b",
        "examples": null,
        "ruleText": "Cards with kicker have additional spell text or abilities that specify what happens if the kicker cost is paid. Cards with more than one kicker cost have spell text and/or abilities that correspond to each kicker cost."
    },
    "410.10d": {
        "navigation": {
            "nextRule": "410.10e",
            "previousRule": "410.10c"
        },
        "ruleNumber": "410.10d",
        "examples": "Example: Two creatures are in play along with an artifact that has the ability \"Whenever a creature is put into a graveyard from play, you gain 1 life.\" Someone plays a spell that destroys all artifacts, creatures, and enchantments. The artifact's ability triggers twice, even though the artifact goes to its owner's graveyard at the same time as the creatures.",
        "ruleText": "Abilities that trigger on one or more permanents leaving play, or on a player losing control of a permanent, must be treated specially because the permanent with the ability may no longer be in play after the event. The game has to \"look back in time\" to determine what triggered. Each time an event removes from play or changes who controls one or more permanents, all the permanents in play just before the event (with continuous effects that existed at that time) are checked for trigger events that match what just left play or changed control."
    },
    "214.8i": {
        "navigation": {
            "nextRule": "214.8k",
            "previousRule": "214.8h"
        },
        "ruleNumber": "214.8i",
        "examples": null,
        "ruleText": "A local enchantment's controller is separate from the enchanted permanent's controller; the two need not be the same. Changing control of the permanent doesn't change control of the enchantment, and vice versa. Only the enchantment's controller can play its abilities. However, if the enchantment adds an ability to the enchanted permanent (with \"gains\" or \"has\"), that enchanted permanent's controller is the only one who can play that ability."
    },
    "505.4": {
        "navigation": {
            "nextRule": "505.5",
            "previousRule": "505.3"
        },
        "ruleNumber": "505.4",
        "examples": null,
        "ruleText": "Although split cards have two playable halves, each split card is only one card. For example, a player who has drawn or discarded a split card has drawn or discarded one card, not two."
    },
    "502.27b": {
        "navigation": {
            "nextRule": "502.28",
            "previousRule": "502.27a"
        },
        "ruleNumber": "502.27b",
        "examples": null,
        "ruleText": "If a creature has multiple instances of amplify, each one works separately."
    },
    "408.2c": {
        "navigation": {
            "nextRule": "408.2d",
            "previousRule": "408.2b"
        },
        "ruleNumber": "408.2c",
        "examples": null,
        "ruleText": "State-based effects (see rule 420) resolve whenever a player would receive priority as long as the required game condition is true."
    },
    "502.22a": {
        "navigation": {
            "nextRule": "502.23",
            "previousRule": "502.22"
        },
        "ruleNumber": "502.22a",
        "examples": null,
        "ruleText": "Flashback is a static ability of some instant and sorcery cards that functions while the card is in a player's graveyard. The phrase \"Flashback [cost]\" means \"You may play this card from your graveyard by paying [cost] rather than paying its mana cost. If you do, remove this card from the game instead of putting it anywhere else any time it would leave the stack.\" Playing a spell using its flashback ability follows the rules for paying alternative costs in rules 409.1b and 409.1f."
    },
    "502.16": {
        "navigation": {
            "nextRule": "502.16a",
            "previousRule": "502.15p"
        },
        "ruleNumber": "502.16",
        "examples": null,
        "ruleText": "Buyback"
    },
    "502.12a": {
        "navigation": {
            "nextRule": "502.12b",
            "previousRule": "502.12"
        },
        "ruleNumber": "502.12a",
        "examples": null,
        "ruleText": "Rampage is a triggered ability. \"Rampage [X]\" means \"Whenever this creature becomes blocked by two or more creatures, it gets +X/+X until end of turn for each creature blocking it beyond the first.\""
    },
    "503.2": {
        "navigation": {
            "nextRule": "503.3",
            "previousRule": "503.1"
        },
        "ruleNumber": "503.2",
        "examples": "Example: Chimeric Staff is an artifact that reads \"X: Chimeric Staff becomes an X/X artifact creature until end of turn.\" Clone is a creature that reads, \"As Clone comes into play, you may choose a creature in play. If you do, Clone comes into play as a copy of that creature.\" After a Staff has become a 5/5 artifact creature, a Clone comes into play as a copy of it. The Clone is an artifact, not a 5/5 artifact creature. (The copy has the Staff's ability, however, and will become a creature if that ability is activated.)",
        "ruleText": "When copying a permanent, the copy acquires the printed values of the name, mana cost, color, type and subtype, expansion symbol, rules text, power, and toughness of the permanent being copied. Also, if the copied permanent was printed as legendary or as an enchant world, this is copied as well. Effects (including type-changing effects) and counters are not copied. (The exception is that copy effects are themselves copied; see rule 503.3.)"
    },
    "500.5": {
        "navigation": {
            "nextRule": "501.1",
            "previousRule": "500.4"
        },
        "ruleNumber": "500.5",
        "examples": "Example: A player controls one creature that \"blocks if able\" and another creature with no abilities. An effect states, \"Creatures can't be blocked except by two or more creatures.\" The creature with no abilities isn't required to block. It's legal to declare both creatures as blockers, or to declare neither creature as a blocker, but illegal to block with only one of the two.",
        "ruleText": "A requirement on one creature can't be combined with a restriction to produce such a requirement on another creature."
    },
    "415.1": {
        "navigation": {
            "nextRule": "415.2",
            "previousRule": "414.2"
        },
        "ruleNumber": "415.1",
        "examples": null,
        "ruleText": "A few effects can \"edit\" a spell or ability after it goes on the stack, changing its target, rules text, or other characteristics."
    },
    "309.1": {
        "navigation": {
            "nextRule": "309.2",
            "previousRule": "308.6"
        },
        "ruleNumber": "309.1",
        "examples": null,
        "ruleText": "The defending player declares which, if any, creatures he or she controls are blocking and which attacking creature each one blocks. Noncreature permanents and tapped creatures can't be declared as blockers. Each creature may block only one attacking creature, although any number of creatures may block the same attacking creature. (Note that blocking doesn't cause a creature to tap.) This declaration is simultaneous, not sequential, and doesn't go on the stack. Any triggered ability generated during this action waits until a player would receive priority."
    },
    "413.2c": {
        "navigation": {
            "nextRule": "413.2d",
            "previousRule": "413.2b"
        },
        "ruleNumber": "413.2c",
        "examples": "Example: A spell's instruction reads, \"You may sacrifice a creature. If you don't, you lose 4 life.\" A player who controls no creatures can't choose the sacrifice option.",
        "ruleText": "If an effect offers any choices other than choices already made as part of playing the spell or ability, the player announces these while applying the effect. The player can't choose an option that's illegal or impossible. (For example, a player can't avoid the consequences of not taking an optional action if he or she can't meet all the immediate requirements of that action.)"
    },
    "214.9f": {
        "navigation": {
            "nextRule": "214.9g",
            "previousRule": "214.9e"
        },
        "ruleNumber": "214.9f",
        "examples": null,
        "ruleText": "If an effect changes a permanent into a basic land, the permanent no longer has its old land type and has only the mana ability of that basic land. It is now a basic land, and its name is that basic land's name. If that permanent was \"Legendary,\" it is no longer. This rule doesn't apply to effects that cause a land to gain one or more land types in addition to its own."
    },
    "410.7": {
        "navigation": {
            "nextRule": "410.8",
            "previousRule": "410.6"
        },
        "ruleNumber": "410.7",
        "examples": "Example: An ability that triggers on damage being dealt won't trigger if all the damage is prevented.",
        "ruleText": "An ability triggers only if its trigger event actually occurs. An event that's prevented or replaced won't trigger anything."
    },
    "411.2": {
        "navigation": {
            "nextRule": "411.3",
            "previousRule": "411.1"
        },
        "ruleNumber": "411.2",
        "examples": null,
        "ruleText": "A player may play an activated mana ability whenever he or she has priority. A player may also play one whenever a rule or effect asks for a mana payment, even in the middle of playing or resolving a spell or ability."
    },
    "409.1f": {
        "navigation": {
            "nextRule": "409.1g",
            "previousRule": "409.1e"
        },
        "ruleNumber": "409.1f",
        "examples": "Example: You play Death Bomb, which costs 3B and has an additional cost of sacrificing a creature. You sacrifice Thunderscape Familiar, whose effect makes your black spells cost 1 less to play. Because a spell's total cost is \"locked in\" before payments are actually made, Death Bomb costs 2B, not 3B, even though you're sacrificing the Familiar.",
        "ruleText": "The player determines the total cost of the spell or ability. Usually this is just the mana cost (for spells) or activation cost (for abilities). Some cards list additional or alternative costs in their text, and some effects may increase or reduce the cost to pay. Costs may include paying mana, tapping permanents, sacrificing permanents, discarding cards, and so on. The total cost is the mana or activation cost, plus all cost increases and minus all cost reductions. Once the total cost is determined, it becomes \"locked in,\" and the player then has a chance to play mana abilities (see rule 411, \"Playing Mana Abilities\"). Once the player has enough mana in his or her mana pool, he or she pays all costs in any order. Partial payments are not allowed. If effects would change the total cost after this time, they have no effect. Playing a spell or ability that alters costs won't do anything to spells and abilities that are already on the stack. "
    },
    "403.2": {
        "navigation": {
            "nextRule": "403.3",
            "previousRule": "403.1"
        },
        "ruleNumber": "403.2",
        "examples": null,
        "ruleText": "Only a permanent's controller (or a card's owner, for cards outside the in-play zone) can play its activated ability unless the card specifically says otherwise."
    },
    "207.1": {
        "navigation": {
            "nextRule": "207.2",
            "previousRule": "206.3"
        },
        "ruleNumber": "207.1",
        "examples": null,
        "ruleText": "The text box is printed on the lower half of the card. It usually contains rules text stating what the card does and any special requirements for playing it."
    },
    "310.2": {
        "navigation": {
            "nextRule": "310.3",
            "previousRule": "310.1d"
        },
        "ruleNumber": "310.2",
        "examples": null,
        "ruleText": "All assignments of combat damage go on the stack as though they were a single pseudospell. Then the active player receives priority to play spells and abilities."
    },
    "502.5c": {
        "navigation": {
            "nextRule": "502.6",
            "previousRule": "502.5b"
        },
        "ruleNumber": "502.5c",
        "examples": null,
        "ruleText": "Multiple instances of haste on the same creature are redundant."
    },
    "420.5e": {
        "navigation": {
            "nextRule": "420.5f",
            "previousRule": "420.5d"
        },
        "ruleNumber": "420.5e",
        "examples": null,
        "ruleText": "If two or more Legends or legendary permanents with the same name are in play, all except the one that has been a Legend or legendary permanent with that name the longest are put into their owners' graveyards. This is called \"the Legend rule.\" In the event of a tie, each Legend or legendary permanent with the same name is put into its owner's graveyard. (If two permanents have the same name but only one is a Legend or is legendary, this rule doesn't apply.)"
    },
    "217.9": {
        "navigation": {
            "nextRule": "217.9a",
            "previousRule": "217.8d"
        },
        "ruleNumber": "217.9",
        "examples": null,
        "ruleText": "Ante"
    },
    "418.2": {
        "navigation": {
            "nextRule": "418.3",
            "previousRule": "418.1"
        },
        "ruleNumber": "418.2",
        "examples": null,
        "ruleText": "Continuous effects that modify characteristics of permanents do so simultaneously with the permanent coming into play. They don't wait until the permanent is in play and then change it. Because such effects apply as the permanent comes into play, apply them before determining whether the permanent will cause an ability to trigger when it comes into play."
    },
    "419.6a": {
        "navigation": {
            "nextRule": "419.6b",
            "previousRule": "419.6"
        },
        "ruleNumber": "419.6a",
        "examples": "Example: A player controls two permanents, each with an ability that reads \"Instead of dealing their normal damage, creatures you control deal double that damage.\" A creature that normally deals 1 damage will deal 4 damage-not just 2, and not an infinite amount.",
        "ruleText": "A replacement effect doesn't invoke itself repeatedly and gets only one opportunity for each event."
    },
    "503.10": {
        "navigation": {
            "nextRule": "503.10a",
            "previousRule": "503.9"
        },
        "ruleNumber": "503.10",
        "examples": "Example: A player plays Fork, targeting an Emerald Charm. Fork reads, \"Put a copy of target instant or sorcery spell onto the stack, except that it copies Fork's color and you may choose new targets for the copy.\" Emerald Charm reads, \"Choose one - Untap target permanent; or destroy target global enchantment; or target creature loses flying until end of turn.\" When the Fork resolves, it puts a copy of the Emerald Charm on the stack. The copy has the same mode that was chosen for the original Emerald Charm. It does not necessarily have the same target, but only because Fork allows choosing of new targets.",
        "ruleText": "To copy a spell means to put a copy of the spell onto the stack; a copy of a spell isn't \"played.\" When copying a spell, all information that is normally copied from a permanent is copied. In addition, all decisions made when the spell was played are copied. These include mode, targets, the value of X, and optional additional costs such as buyback. (See rule 409, \"Playing Spells and Activated Abilities.\") Choices that are normally made on resolution are not copied. A copy of a spell is itself a spell, but it has no spell card associated with it. It works just like a normal spell: It can be countered or it can resolve, and it uses the same timing rules as normal spells."
    },
    "301.1": {
        "navigation": {
            "nextRule": "302.1",
            "previousRule": "300.6"
        },
        "ruleNumber": "301.1",
        "examples": null,
        "ruleText": "The beginning phase consists of three steps, in this order: untap, upkeep, and draw."
    },
    "413.2f": {
        "navigation": {
            "nextRule": "413.2g",
            "previousRule": "413.2e"
        },
        "ruleNumber": "413.2f",
        "examples": null,
        "ruleText": "If an effect requires information from the game (such as the number of creatures in play), the answer is determined only once, when the effect is applied. The effect uses the current information of a specific permanent if that permanent is still in play, or of a specific card in the stated zone; otherwise, the effect uses the last known information the card or permanent had before leaving that zone. The exception is that static abilities can't use last known information; see rule 412.5. If the ability text states that a permanent does something, it's the permanent as it exists (or most recently existed) that does it, not the ability."
    },
    "214.8d": {
        "navigation": {
            "nextRule": "214.8e",
            "previousRule": "214.8c"
        },
        "ruleNumber": "214.8d",
        "examples": null,
        "ruleText": "As part of playing a local-enchantment spell, the player announces the spell's target. The local enchantment comes into play attached to that target permanent. If a local enchantment is coming into play by any other means, the player putting it into play chooses a permanent for it to enchant as it comes into play. In this case, the enchantment doesn't target the permanent, but the player still must choose a permanent that the enchantment can enchant. If no legal permanent is available, the enchantment remains in the zone from which it attempted to move instead of coming into play. The same rule applies to moving a local enchantment from one permanent to another. The permanent to which the enchantment is to be moved must be able to be enchanted by it. If it isn't legal, the enchantment doesn't move."
    },
    "211.1": {
        "navigation": {
            "nextRule": "212.1",
            "previousRule": "210.1"
        },
        "ruleNumber": "211.1",
        "examples": null,
        "ruleText": "Some card sets feature collector numbers. This information is printed in the form [card number]/[total cards in the set], immediately following the legal text. These numbers have no effect on game play."
    },
    "205.1": {
        "navigation": {
            "nextRule": "206.1",
            "previousRule": "204.1"
        },
        "ruleNumber": "205.1",
        "examples": null,
        "ruleText": "The type (and subtype, if applicable) of a card is printed directly below the illustration. (See rules 212-215.)"
    },
    "504.4": {
        "navigation": {
            "nextRule": "504.5",
            "previousRule": "504.3"
        },
        "ruleNumber": "504.4",
        "examples": null,
        "ruleText": "If you control multiple face-down spells on the stack or face-down permanents in play, you must ensure at all times that your face-down spells and permanents can be easily differentiated from each other. This includes, but is not limited to, knowing the order spells were played, the order that face-down permanents came into play, which creature attacked last turn, and any other differences between face-down spells or permanents. Common methods for distinguishing between face-down cards include using counters or dice to mark the different permanents, or clearly placing those permanents in order on the table."
    },
    "502.2b": {
        "navigation": {
            "nextRule": "502.2c",
            "previousRule": "502.2a"
        },
        "ruleNumber": "502.2b",
        "examples": null,
        "ruleText": "During the combat damage step, if at least one attacking or blocking creature has first strike or double strike (see rule 502.28), creatures without first strike or double strike don't assign combat damage. Instead of proceeding to end of combat, the phase gets a second combat damage step to handle the remaining creatures."
    },
    "502.26e": {
        "navigation": {
            "nextRule": "502.26f",
            "previousRule": "502.26d"
        },
        "ruleNumber": "502.26e",
        "examples": null,
        "ruleText": "If a face-up permanent is turned face down by a spell or ability, it becomes a 2/2 face-down creature, with no text, no name, no subtypes, no expansion symbol, and a mana cost of 0. The rules for morph and face-down spells and permanents apply to it normally."
    },
    "102.6": {
        "navigation": {
            "nextRule": "102.7",
            "previousRule": "102.5"
        },
        "ruleNumber": "102.6",
        "examples": null,
        "ruleText": "If the game somehow enters a \"loop,\" repeating a sequence of events with no way to stop, the game is a draw. Loops that contain an optional action don't result in a draw."
    },
    "311.1": {
        "navigation": {
            "nextRule": "312.1",
            "previousRule": "310.4"
        },
        "ruleNumber": "311.1",
        "examples": null,
        "ruleText": "All \"at end of combat\" abilities trigger and go on the stack. (See rule 404, \"Triggered Abilities.\") Then the active player receives priority to play spells and abilities."
    },
    "406.2": {
        "navigation": {
            "nextRule": "406.2a",
            "previousRule": "406.1e"
        },
        "ruleNumber": "406.2",
        "examples": null,
        "ruleText": "Delayed Triggered Abilities"
    },
    "413.2": {
        "navigation": {
            "nextRule": "413.2a",
            "previousRule": "413.1"
        },
        "ruleNumber": "413.2",
        "examples": null,
        "ruleText": "Resolution of a spell or ability may involve several steps but is treated by the game as a single indivisible action. These steps are followed in the order listed below."
    },
    "401.3": {
        "navigation": {
            "nextRule": "402.1",
            "previousRule": "401.2"
        },
        "ruleNumber": "401.3",
        "examples": null,
        "ruleText": "As the final part of an instant or sorcery spell's resolution, the card is put into its owner's graveyard. As the final part of an artifact, creature, or enchantment spell's resolution, the card becomes a permanent and is put into the in-play zone under the control of the spell's controller. If any spell is countered, the card is put into its owner's graveyard as part of the resolution of the countering spell or ability. (See rule 413, \"Resolving Spells and Abilities.\")"
    },
    "420.5g": {
        "navigation": {
            "nextRule": "420.5h",
            "previousRule": "420.5f"
        },
        "ruleNumber": "420.5g",
        "examples": null,
        "ruleText": "A player who was required to draw more cards than were in his or her library loses the game."
    },
    "214.6b": {
        "navigation": {
            "nextRule": "214.7",
            "previousRule": "214.6a"
        },
        "ruleNumber": "214.6b",
        "examples": null,
        "ruleText": "Artifact creatures combine the characteristics of both the creature and artifact types and are subject to spells and abilities that affect either or both types."
    },
    "304.1": {
        "navigation": {
            "nextRule": "305.1",
            "previousRule": "303.1"
        },
        "ruleNumber": "304.1",
        "examples": null,
        "ruleText": "As the draw step begins, any abilities that trigger at the beginning of the draw step go on the stack. (See rule 404, \"Triggered Abilities.\") Then the draw step action-the active player drawing a card-goes on the stack. This action is a triggered ability, but it isn't controlled by either player. It simply goes on the stack on top of all abilities players control that trigger at the beginning of the draw step. Then the active player gets priority, and players may play spells and abilities."
    },
    "502.11c": {
        "navigation": {
            "nextRule": "502.12",
            "previousRule": "502.11b"
        },
        "ruleNumber": "502.11c",
        "examples": null,
        "ruleText": "If a creature is blocked by at least two creatures with the same \"bands with other [creature type]\" ability, the defending player chooses how the attacking creature's damage is assigned. Similarly, if a creature blocks at least two attacking creatures with the same \"bands with other [creature type]\" ability, the attacking player chooses how the blocking creature's damage is assigned."
    },
    "217.8a": {
        "navigation": {
            "nextRule": "217.8b",
            "previousRule": "217.8"
        },
        "ruleNumber": "217.8a",
        "examples": null,
        "ruleText": "Permanents that phase out are placed in the phased-out zone. (See rule 502.15, \"Phasing.\")"
    },
    "502.10g": {
        "navigation": {
            "nextRule": "502.10h",
            "previousRule": "502.10f"
        },
        "ruleNumber": "502.10g",
        "examples": null,
        "ruleText": "If one member of a band would become blocked as the result of a spell or ability, the entire band becomes blocked."
    },
    "307.1": {
        "navigation": {
            "nextRule": "308.1",
            "previousRule": "306.2"
        },
        "ruleNumber": "307.1",
        "examples": null,
        "ruleText": "As this step begins, triggered abilities (if any) are added to the stack, and then the active player gets priority to play spells and abilities."
    },
    "419.7b": {
        "navigation": {
            "nextRule": "419.7c",
            "previousRule": "419.7a"
        },
        "ruleNumber": "419.7b",
        "examples": null,
        "ruleText": "Some prevention effects refer to a specific amount of damage-for example, \"Prevent the next 3 damage to target creature or player this turn.\" These work like ablative shields. Each 1 damage that would be dealt to the \"shielded\" creature or player is prevented. Preventing 1 damage reduces the remaining shield by 1. If damage would be dealt to the shielded creature or player by two or more sources at the same time, the player or the controller of the creature can choose which damage the shield prevents first. Once the shield has been reduced to 0, any remaining damage is dealt normally. Such effects count only the amount of damage; the number of events or sources dealing it doesn't matter."
    },
    "202.2": {
        "navigation": {
            "nextRule": "202.3",
            "previousRule": "202.1"
        },
        "ruleNumber": "202.2",
        "examples": null,
        "ruleText": "Card text that refers to the card it's on by name means just that particular card and not any other duplicates of it, regardless of any name changes caused by game effects. Also, if a card has an effect on or grants an ability that includes that card's name to another card, the name refers only to the card generating the effect or granting the ability, not to duplicates of cards with the same name."
    },
    "502.14": {
        "navigation": {
            "nextRule": "502.14a",
            "previousRule": "502.13b"
        },
        "ruleNumber": "502.14",
        "examples": null,
        "ruleText": "Snow-Covered"
    },
    "217.1": {
        "navigation": {
            "nextRule": "217.1a",
            "previousRule": "216.3"
        },
        "ruleNumber": "217.1",
        "examples": null,
        "ruleText": "A zone is a place where Magic cards can be during a game. There are six basic zones: library, hand, graveyard, in play, stack, and removed from the game. Each player has his or her own set of zones, except for the in-play and stack zones, which are shared."
    },
    "100.3": {
        "navigation": {
            "nextRule": "100.4",
            "previousRule": "100.2"
        },
        "ruleNumber": "100.3",
        "examples": null,
        "ruleText": "For sealed deck or draft play, only forty cards are required in a deck, and a player may use as many duplicates of a card as he or she has. See the most current Magic: The Gathering DCI™ Floor Rules for more information. They can be found at www.wizards.com/DCI/main.asp?x=UTR_Intro."
    },
    "313.2": {
        "navigation": {
            "nextRule": "314.1",
            "previousRule": "313.1"
        },
        "ruleNumber": "313.2",
        "examples": null,
        "ruleText": "If \"at end of turn\"-triggered abilities are created or if cards with \"at end of turn\"-triggered abilities come into play after preexisting ones have already gone on the stack at the beginning of the end of turn step, those abilities won't go on the stack until the next turn's end phase. In other words, the step doesn't \"back up\" so new \"at end of turn\"-triggered abilities can go on the stack."
    },
    "406.1b": {
        "navigation": {
            "nextRule": "406.1c",
            "previousRule": "406.1a"
        },
        "ruleNumber": "406.1b",
        "examples": null,
        "ruleText": "Spells that put mana into a player's mana pool aren't mana abilities. They're played and resolved exactly like any other spells. Triggered abilities that put mana into a player's mana pool aren't mana abilities if they trigger from events other than activating mana abilities. They go on the stack and resolve like any other triggered abilities."
    },
    "418.3d": {
        "navigation": {
            "nextRule": "418.4",
            "previousRule": "418.3c"
        },
        "ruleNumber": "418.3d",
        "examples": "Example: Endoskeleton is an artifact with an activated ability that reads \"2, T: Target creature gets +0/+3 as long as Endoskeleton remains tapped.\" If you play this ability and then Endoskeleton becomes untapped before the ability resolves, it does nothing, because its duration-remaining tapped-was over before the effect began.",
        "ruleText": "Some effects from activated or triggered abilities have durations worded \"as long as . . . .\" If the \"as long as\" duration ends between the end of announcing the activated ability or putting the triggered ability onto the stack and the moment when the effect would first be applied, the effect does nothing. It doesn't start and immediately stop again, and it doesn't last forever."
    },
    "502.17a": {
        "navigation": {
            "nextRule": "502.17b",
            "previousRule": "502.17"
        },
        "ruleNumber": "502.17a",
        "examples": null,
        "ruleText": "Horsemanship is an evasion ability that appeared in the Portal Three Kingdoms™ set."
    },
    "217.2d": {
        "navigation": {
            "nextRule": "217.2e",
            "previousRule": "217.2c"
        },
        "ruleNumber": "217.2d",
        "examples": null,
        "ruleText": "If an effect puts two or more cards on the top or bottom of a library at the same time, the owner of those cards may arrange them in any order. That library's owner doesn't reveal the order in which the cards go into his or her library."
    },
    "217.3": {
        "navigation": {
            "nextRule": "217.3a",
            "previousRule": "217.2e"
        },
        "ruleNumber": "217.3",
        "examples": null,
        "ruleText": "Hand"
    },
    "502.4c": {
        "navigation": {
            "nextRule": "502.5",
            "previousRule": "502.4b"
        },
        "ruleNumber": "502.4c",
        "examples": null,
        "ruleText": "Multiple instances of flying on the same creature are redundant."
    },
    "418.5": {
        "navigation": {
            "nextRule": "418.5a",
            "previousRule": "418.4b"
        },
        "ruleNumber": "418.5",
        "examples": null,
        "ruleText": "Interaction of Continuous Effects"
    },
    "217.4": {
        "navigation": {
            "nextRule": "217.4a",
            "previousRule": "217.3c"
        },
        "ruleNumber": "217.4",
        "examples": null,
        "ruleText": "Graveyard"
    },
    "310.1b": {
        "navigation": {
            "nextRule": "310.1c",
            "previousRule": "310.1a"
        },
        "ruleNumber": "310.1b",
        "examples": null,
        "ruleText": "An unblocked creature will assign all its combat damage to the defending player."
    },
    "103.1": {
        "navigation": {
            "nextRule": "103.2",
            "previousRule": "102.8"
        },
        "ruleNumber": "103.1",
        "examples": null,
        "ruleText": "The Magic Golden Rule: Whenever a card's text directly contradicts these rules, the card takes precedence. The card overrides only the rule that applies to that specific situation. If an instruction requires taking an impossible action, it's ignored. (In many cases the card will specify consequences for this; if it doesn't, there's no effect.)"
    },
    "502.3": {
        "navigation": {
            "nextRule": "502.3a",
            "previousRule": "502.2d"
        },
        "ruleNumber": "502.3",
        "examples": null,
        "ruleText": "Flanking"
    },
    "214.9c": {
        "navigation": {
            "nextRule": "214.9d",
            "previousRule": "214.9b"
        },
        "ruleNumber": "214.9c",
        "examples": null,
        "ruleText": "Each land card is in one of two categories: basic or nonbasic. Basic and nonbasic are not types or subtypes."
    },
    "502.14c": {
        "navigation": {
            "nextRule": "502.15",
            "previousRule": "502.14b"
        },
        "ruleNumber": "502.14c",
        "examples": null,
        "ruleText": "Some effects can add or remove the snow-covered ability. This doesn't change the existing name of the land. For example, a card named Snow-Covered Forest is named \"Snow-Covered Forest,\" while a forest that has been granted the snow-covered ability is still named \"Forest.\""
    },
    "502.26b": {
        "navigation": {
            "nextRule": "502.26c",
            "previousRule": "502.26a"
        },
        "ruleNumber": "502.26b",
        "examples": null,
        "ruleText": "To play a spell using its morph ability, turn it face down. It becomes a 2/2 face-down creature spell, with no text, no name, no subtypes, no expansion symbol, and a mana cost of 0. Put it onto the stack (it stays face down with the same characteristics), and pay 3 rather than pay its mana cost. This follows the rules for paying alternative costs. You can use morph to play a spell from any zone from which you could normally play it. When the spell resolves, it comes into play with the same characteristics the spell had. The morph effect applies to the face-down card wherever it is, and it ends when the card is turned face up."
    },
    "217.2e": {
        "navigation": {
            "nextRule": "217.3",
            "previousRule": "217.2d"
        },
        "ruleNumber": "217.2e",
        "examples": null,
        "ruleText": "Some effects tell a player to play with the top card of his or her library revealed. If the top card of the player's library changes during the announcement of a spell or ability, the new top card won't be revealed until the announcement is complete."
    },
    "404.3": {
        "navigation": {
            "nextRule": "405.1",
            "previousRule": "404.2"
        },
        "ruleNumber": "404.3",
        "examples": null,
        "ruleText": "A triggered ability may read \"When/Whenever/At . . . , if [condition], [effect].\" The ability checks for the stated condition to be true when the trigger event occurs. If it is, the ability triggers and goes on the stack. On resolution, the ability rechecks the condition. If the condition isn't true at either of those times, the ability does nothing. This rule is referred to as the \"intervening 'if' clause\" rule. Note that the word \"if\" has only its normal English meaning anywhere else in the text of a card; this rule only applies to an \"if\" that immediately follows a trigger condition."
    },
    "406.2b": {
        "navigation": {
            "nextRule": "406.2c",
            "previousRule": "406.2a"
        },
        "ruleNumber": "406.2b",
        "examples": "Example: Part of an effect reads \"when this card leaves play,\" but the card in question leaves play before the spell or ability creating the effect resolves. In this case, the delayed ability never triggers. As another example, if an effect reads \"when this card becomes untapped\" and the named card becomes untapped before the effect resolves, the ability waits for the next time that card untaps.",
        "ruleText": "Delayed triggered abilities come from spells or other abilities that create them on resolution. That means a delayed triggered ability won't trigger until it has actually been created, even if its trigger event occurred just beforehand. Other events that happen earlier may make the trigger event impossible."
    },
    "502.29b": {
        "navigation": {
            "nextRule": "503.1",
            "previousRule": "502.29a"
        },
        "ruleNumber": "502.29b",
        "examples": null,
        "ruleText": "If a creature has multiple instances of provoke, each triggers separately."
    },
    "217.1b": {
        "navigation": {
            "nextRule": "217.1c",
            "previousRule": "217.1a"
        },
        "ruleNumber": "217.1b",
        "examples": null,
        "ruleText": "The order of cards in a library, in a graveyard, or on the stack can't be changed except when effects allow it. Cards in other zones can be arranged however their owners wish, although who controls those cards, whether they're tapped, and what enchants them must remain clear to both players."
    },
    "413.2d": {
        "navigation": {
            "nextRule": "413.2e",
            "previousRule": "413.2c"
        },
        "ruleNumber": "413.2d",
        "examples": "Example: Stronghold Gambit reads, in part, \"Each player chooses a card in his or her hand. Then each player reveals his or her chosen card.\" First the active player chooses a card, then the nonactive player does so. Each player reveals the cards simultaneously.",
        "ruleText": "If an effect requires both players to make choices or take actions at the same time, the active player makes and announces his or her choices first, and then his or her opponent does (knowing the first player's choices). Then the actions take place simultaneously. This is called the \"active player rule.\" If a player must make more than one choice at a time, he or she makes the choices in the order written, or in the order he or she chooses if the choices aren't ordered. Then, the actions are processed simultaneously. Some spells and abilities have multiple steps or actions, denoted by separate sentences or clauses. In these cases, the active player makes any choices required for the first action, then the nonactive player makes any choices required for that action, then the first action is processed simultaneously. Then, the active player makes any choices required for the second action, then the nonactive player makes any choices required for that action, then that action is processed simultaneously, and so on."
    },
    "212.2c": {
        "navigation": {
            "nextRule": "212.2d",
            "previousRule": "212.2b"
        },
        "ruleNumber": "212.2c",
        "examples": null,
        "ruleText": "Land subtypes are also called \"land types\" and are always the same as the name of the land card; they aren't listed on the type line. A card named \"Island\" has land type \"island\"; a card named \"Karplusan Forest\" has land type \"Karplusan Forest\" (remember that it isn't a forest or a basic land). Only lands with a basic land type get abilities just for being a given land type. (See rule 214.9e.) \"Basic land\" and \"nonbasic land\" aren't types or subtypes; they're categories of lands."
    },
    "308.2": {
        "navigation": {
            "nextRule": "308.3",
            "previousRule": "308.1"
        },
        "ruleNumber": "308.2",
        "examples": null,
        "ruleText": "The active player determines whether the attack is legal. (See section 5, \"Additional Rules.\") If it is, he or she taps all creatures that will attack. Tapping a creature when it is declared as an attacker is not a cost; attacking simply causes creatures to become tapped. Then the player pays all required costs. (See rule 409.1f.) The active player may play mana abilities at this time only if an attack cost includes a mana payment."
    },
    "406.1e": {
        "navigation": {
            "nextRule": "406.2",
            "previousRule": "406.1d"
        },
        "ruleNumber": "406.1e",
        "examples": null,
        "ruleText": "Mana abilities are played and resolved like other abilities, but they don't go on the stack, so they can't be countered or responded to. (See rule 408.2, \"Actions That Don't Use the Stack.\") Abilities (other than mana abilities) that trigger on playing mana abilities do go on the stack, however."
    },
    "502.26": {
        "navigation": {
            "nextRule": "502.26a",
            "previousRule": "502.25b"
        },
        "ruleNumber": "502.26",
        "examples": null,
        "ruleText": "Morph"
    },
    "410.8": {
        "navigation": {
            "nextRule": "410.9",
            "previousRule": "410.7"
        },
        "ruleNumber": "410.8",
        "examples": null,
        "ruleText": "Triggered abilities with a condition directly following the trigger event (for example, \"When/Whenever/At [trigger], if [condition], [effect]\"), check for the condition to be true as part of the trigger event; if it isn't, the ability doesn't trigger. The ability checks the condition again on resolution. If it's not satisfied, the ability does nothing. Note that this mirrors the check for legal targets. Note that this rule doesn't apply to any triggered ability with a condition elsewhere within its text."
    },
    "101.4": {
        "navigation": {
            "nextRule": "101.5",
            "previousRule": "101.3"
        },
        "ruleNumber": "101.4",
        "examples": null,
        "ruleText": "The player who plays first skips the draw step (see rule 304, \"Draw Step\") of his or her first turn."
    },
    "502.13a": {
        "navigation": {
            "nextRule": "502.13b",
            "previousRule": "502.13"
        },
        "ruleNumber": "502.13a",
        "examples": null,
        "ruleText": "Cumulative upkeep is a triggered ability that imposes an increasing cost on a permanent. The phrase \"Cumulative upkeep [cost]\" means \"At the beginning of your upkeep, put an age counter on this permanent, then sacrifice this permanent unless you pay [cost] for each age counter on it.\""
    },
    "418.4b": {
        "navigation": {
            "nextRule": "418.5",
            "previousRule": "418.4a"
        },
        "ruleNumber": "418.4b",
        "examples": "Example: A permanent with the static ability \"All white creatures get +1/+1\" generates an effect that continuously gives +1/+1 to each white creature in play. If a creature becomes white, it gets this bonus; a creature that stops being white loses it. A creature spell that would normally create a 1/1 white creature instead creates a 2/2 white creature. The creature doesn't come into play as 1/1 and then change to 2/2.",
        "ruleText": "The effect applies at all times that the permanent generating it is in play or the card generating it is in the appropriate zone."
    },
    "408.2h": {
        "navigation": {
            "nextRule": "409.1",
            "previousRule": "408.2g"
        },
        "ruleNumber": "408.2h",
        "examples": null,
        "ruleText": "The controller of a face-down permanent may turn it face up whenever he or she has priority. (See rule 504, \"Face-Down Spells and Permanents.\")"
    },
    "310.3": {
        "navigation": {
            "nextRule": "310.4",
            "previousRule": "310.2"
        },
        "ruleNumber": "310.3",
        "examples": null,
        "ruleText": "Although combat-damage assignments go on the stack, they aren't spells or abilities, so they can't be countered."
    },
    "217.9c": {
        "navigation": {
            "nextRule": "300.1",
            "previousRule": "217.9b"
        },
        "ruleNumber": "217.9c",
        "examples": null,
        "ruleText": "A few cards have the text \"Remove [this card] from your deck before playing if you're not playing for ante.\" This text isn't an ability. These are the only cards that can add or remove cards from a player's ante zone, or change a card's owner."
    },
    "302.2": {
        "navigation": {
            "nextRule": "302.3",
            "previousRule": "302.1"
        },
        "ruleNumber": "302.2",
        "examples": null,
        "ruleText": "No player receives priority during the untap step, so no spells or abilities can be played or resolved. Any ability that triggers during this step will be held until a player would receive priority during the upkeep step. (See rule 303, \"Upkeep Step.\")"
    },
    "415.2b": {
        "navigation": {
            "nextRule": "415.3",
            "previousRule": "415.2a"
        },
        "ruleNumber": "415.2b",
        "examples": null,
        "ruleText": "The word \"you\" in a card's text isn't a target. If a spell affects only its controller, its target can't be changed."
    },
    "402.7": {
        "navigation": {
            "nextRule": "402.8",
            "previousRule": "402.6"
        },
        "ruleNumber": "402.7",
        "examples": null,
        "ruleText": "A card may have several abilities. Aside from certain defined abilities that may be strung together on a single line (see rule 502, \"Keyword Abilities\"), each paragraph break in a card's text marks a separate ability. A card may also have multiple instances of the same ability. Each instance functions independently. This may or may not produce more effects than a single instance; refer to the specific ability for more information."
    },
    "214.2": {
        "navigation": {
            "nextRule": "214.3",
            "previousRule": "214.1"
        },
        "ruleNumber": "214.2",
        "examples": null,
        "ruleText": "A nontoken permanent's type(s) and subtype(s) are the same as those printed on its card. A token's type(s) and subtype(s) are set by the spell or ability that created it."
    },
    "102.7": {
        "navigation": {
            "nextRule": "102.8",
            "previousRule": "102.6"
        },
        "ruleNumber": "102.7",
        "examples": null,
        "ruleText": "A player may concede a game at any time."
    },
    "414.1": {
        "navigation": {
            "nextRule": "414.2",
            "previousRule": "413.2i"
        },
        "ruleNumber": "414.1",
        "examples": null,
        "ruleText": "To counter a spell is to move the spell card from the stack to its owner's graveyard. Countering a copy of a spell removes the copy from the stack. Countering an ability removes its pseudospell from the stack. Spells and abilities that are countered don't resolve and none of their effects occur."
    },
    "403.1": {
        "navigation": {
            "nextRule": "403.2",
            "previousRule": "402.10"
        },
        "ruleNumber": "403.1",
        "examples": null,
        "ruleText": "An activated ability can exist in one of two places: on a permanent or on a card outside the in-play zone. An activated ability is written as \"cost: effect.\" The activation cost is everything before the colon (:). The ability's controller must pay its activation cost to play it."
    },
    "418.1": {
        "navigation": {
            "nextRule": "418.2",
            "previousRule": "417.2"
        },
        "ruleNumber": "418.1",
        "examples": null,
        "ruleText": "A continuous effect modifies characteristics of cards and/or permanents or modifies the rules of the game for a fixed or indefinite period. A continuous effect may be generated by the resolution of a spell or ability or by a static ability of a permanent."
    },
    "411.3": {
        "navigation": {
            "nextRule": "411.3a",
            "previousRule": "411.2"
        },
        "ruleNumber": "411.3",
        "examples": "Example: An enchantment reads, \"Whenever a player taps a land for mana, that land produces one additional mana of the same color.\" If a player taps lands for mana while playing a spell, the additional mana is added to the player's mana pool immediately and can be used to pay for the spell.",
        "ruleText": "Triggered mana abilities trigger when an activated mana ability is played. These abilities resolve immediately after the mana ability that triggered them, without waiting for priority. If an activated or triggered ability produces both mana and another effect, both the mana and the other effect resolve immediately."
    },
    "502.15d": {
        "navigation": {
            "nextRule": "502.15e",
            "previousRule": "502.15c"
        },
        "ruleNumber": "502.15d",
        "examples": null,
        "ruleText": "Permanents phasing in don't trigger any comes-into-play abilities, and effects that modify how a permanent comes into play are ignored. Abilities and effects that specifically mention phasing can modify or trigger on this event, however. Permanents phasing out trigger leaves-play abilities as usual. (Because no player receives priority during the untap step, any abilities triggering off of the phasing event won't go onto the stack until the upkeep step begins.)"
    },
    "402.3": {
        "navigation": {
            "nextRule": "402.4",
            "previousRule": "402.2"
        },
        "ruleNumber": "402.3",
        "examples": null,
        "ruleText": "Text on a card stating that the card \"is\" a particular type or color isn't an ability. Such statements apply no matter what zone the card is in and aren't removed by effects that cause a permanent to lose its abilities. This rule applies only to text that states a card's type or color, not to other characteristic-setting text."
    },
    "214.9e": {
        "navigation": {
            "nextRule": "214.9f",
            "previousRule": "214.9d"
        },
        "ruleNumber": "214.9e",
        "examples": null,
        "ruleText": "A land with a basic land type has an intrinsic ability to produce colored mana. (See rule 406.1, \"Mana Abilities.\") The card is treated as if its text box read, \"T: Add [mana symbol] to your mana pool,\" even if the text box doesn't actually contain text. Plains produce white mana; islands, blue; swamps, black; mountains, red; and forests, green."
    },
    "405.1": {
        "navigation": {
            "nextRule": "406.1",
            "previousRule": "404.3"
        },
        "ruleNumber": "405.1",
        "examples": null,
        "ruleText": "A static ability does something all the time rather than being activated or triggered. The ability isn't played-it just \"is.\""
    },
    "503.10a": {
        "navigation": {
            "nextRule": "503.11",
            "previousRule": "503.10"
        },
        "ruleNumber": "503.10a",
        "examples": null,
        "ruleText": "A copy of a spell in a zone other than the stack ceases to exist. (This is a state-based effect. See rule 420.)"
    },
    "502.11b": {
        "navigation": {
            "nextRule": "502.11c",
            "previousRule": "502.11a"
        },
        "ruleNumber": "502.11b",
        "examples": null,
        "ruleText": "An attacking creature with \"bands with other [creature type]\" can form an attacking band with other creatures that have the same \"bands with other [creature type]\" ability. Creatures with banding can also join this band, but creatures without banding can't. The creatures in this band don't have to have the creature type specified in the \"bands with other [creature type]\" ability. Blocking this band follows the same general rules as for banding."
    },
    "502.15": {
        "navigation": {
            "nextRule": "502.15a",
            "previousRule": "502.14c"
        },
        "ruleNumber": "502.15",
        "examples": null,
        "ruleText": "Phasing"
    },
    "400.1": {
        "navigation": {
            "nextRule": "401.1",
            "previousRule": "314.1c"
        },
        "ruleNumber": "400.1",
        "examples": null,
        "ruleText": "An ability is text in a card's text box that generates an effect. Reminder text, flavor text, characteristic-setting text, and spell text are not abilities. Reminder text and flavor text always appear in italics. Characteristic-setting text is any text that states that that card, permanent, or spell \"is\" a particular characteristic. Spell text is any text that's followed as a spell is played or is resolving. Abilities generate effects only from the in-play zone unless they state otherwise. Text itself is never an effect. Spells, activated abilities, and triggered abilities generate effects when they resolve. Static abilities generate continuous effects."
    },
    "310.1a": {
        "navigation": {
            "nextRule": "310.1b",
            "previousRule": "310.1"
        },
        "ruleNumber": "310.1a",
        "examples": null,
        "ruleText": "Each attacking creature and each blocking creature will assign combat damage equal to its power."
    },
    "502.14a": {
        "navigation": {
            "nextRule": "502.14b",
            "previousRule": "502.14"
        },
        "ruleNumber": "502.14a",
        "examples": null,
        "ruleText": "Snow-covered is an ability that doesn't do anything in its own right; it's simply a keyword that other cards look for. When a card refers to a \"snow-covered land,\" it means a land with the snow-covered ability. When a card refers to a \"snow-covered forest,\" it means a forest with the snow-covered ability, and so on."
    },
    "216.1": {
        "navigation": {
            "nextRule": "216.2",
            "previousRule": "215.3"
        },
        "ruleNumber": "216.1",
        "examples": null,
        "ruleText": "Some spells and abilities put a token creature into play. The token is controlled by whomever put it into play and owned by the controller of the spell or ability that created it. The rules text of the spell or ability may define any number of characteristics for the token. These are the token permanent's initial values. A token doesn't have any characteristics not defined by the spell or ability that created it. A token's creature type is the same as its name. A Goblin creature token, for example, is named Goblin and has the creature subtype Goblin. If a token's name is two words or more, it has the creature subtype for each of those words. For example, a Goblin Scout token is named Goblin Scout and has two creature subtypes: Goblin and Scout. Once a token is in play, changing its name doesn't change its creature type, and vice versa."
    },
    "214.6": {
        "navigation": {
            "nextRule": "214.6a",
            "previousRule": "214.5"
        },
        "ruleNumber": "214.6",
        "examples": null,
        "ruleText": "Artifacts"
    },
    "216.3": {
        "navigation": {
            "nextRule": "217.1",
            "previousRule": "216.2"
        },
        "ruleNumber": "216.3",
        "examples": null,
        "ruleText": "A token in a zone other than the in-play zone ceases to exist. This is a state-based effect. (Note that a token changing zones will set off triggered abilities before the token ceases to exist.) Once a token has left play, it can't be returned to play by any means."
    },
    "502.19": {
        "navigation": {
            "nextRule": "502.19a",
            "previousRule": "502.18b"
        },
        "ruleNumber": "502.19",
        "examples": null,
        "ruleText": "Echo"
    },
    "408.2g": {
        "navigation": {
            "nextRule": "408.2h",
            "previousRule": "408.2f"
        },
        "ruleNumber": "408.2g",
        "examples": null,
        "ruleText": "Game actions-untapping during the untap step, declaring attacking or blocking creatures, cleanup, and mana burn-don't use the stack. The two exceptions are combat damage and the draw action of the draw step."
    },
    "217.3b": {
        "navigation": {
            "nextRule": "217.3c",
            "previousRule": "217.3a"
        },
        "ruleNumber": "217.3b",
        "examples": null,
        "ruleText": "Each player has a maximum hand size, which is normally seven cards. A player may have any number of cards in his or her hand, but as part of his or her cleanup step, the player must discard excess cards down to the maximum hand size."
    },
    "502.7c": {
        "navigation": {
            "nextRule": "502.8",
            "previousRule": "502.7b"
        },
        "ruleNumber": "502.7c",
        "examples": null,
        "ruleText": "Multiple instances of protection from the same quality on the same permanent are redundant."
    },
    "203.3": {
        "navigation": {
            "nextRule": "203.4",
            "previousRule": "203.2"
        },
        "ruleNumber": "203.3",
        "examples": null,
        "ruleText": "The converted mana cost of a card is the total amount of mana in the mana cost, regardless of color (For example, a mana cost of 3UU translates to a converted mana cost of 5). The converted mana cost is a generic mana cost-it may be paid with any combination of colored and/or colorless mana, regardless of the colors in the spell's mana cost."
    },
    "502.15e": {
        "navigation": {
            "nextRule": "502.15f",
            "previousRule": "502.15d"
        },
        "ruleNumber": "502.15e",
        "examples": null,
        "ruleText": "When a permanent phases out, all damage dealt to it is removed."
    },
    "308.5": {
        "navigation": {
            "nextRule": "308.5a",
            "previousRule": "308.4"
        },
        "ruleNumber": "308.5",
        "examples": null,
        "ruleText": "A creature becomes an attacking creature when it has been declared as part of a legal attack and all attack costs have been paid, but only if it's controlled by the active player. It remains an attacking creature until it's removed from combat or the combat phase ends, whichever comes first. The nonactive player is considered to have been attacked that turn at this time if one or more creatures are attacking."
    },
    "201.1": {
        "navigation": {
            "nextRule": "201.2",
            "previousRule": "200.1"
        },
        "ruleNumber": "201.1",
        "examples": null,
        "ruleText": "The parts of a card are name, mana cost, illustration, type, expansion symbol, text box, power and toughness, credit, legal text, and collector number. Some cards may have more than one of any or all of these parts."
    },
    "402.6": {
        "navigation": {
            "nextRule": "402.7",
            "previousRule": "402.5"
        },
        "ruleNumber": "402.6",
        "examples": null,
        "ruleText": "Once activated or triggered, an ability exists independently of its source (the card on which it's printed) as a pseudospell on the stack. Destruction or removal of the source after that time won't affect the ability. Note that some abilities cause a source to do something (for example, \"Prodigal Sorcerer deals 1 damage to target creature or player\") rather than the ability doing anything directly. In these cases, any spell, activated ability, or triggered ability that references information about the source will check that information when the ability resolves, or will use the source's last known information if it's no longer in play."
    },
    "214.8g": {
        "navigation": {
            "nextRule": "214.8h",
            "previousRule": "214.8f"
        },
        "ruleNumber": "214.8g",
        "examples": null,
        "ruleText": "The permanent a local enchantment is attached to is called \"enchanted.\" The enchantment \"enchants\" or, in more casual terms, \"is attached to\" that permanent."
    },
    "420.1": {
        "navigation": {
            "nextRule": "420.2",
            "previousRule": "419.8b"
        },
        "ruleNumber": "420.1",
        "examples": null,
        "ruleText": "State-based effects are a special category that applies only to those conditions listed below. Abilities that watch for a specified game state are triggered abilities. (See rule 410.8.)"
    },
    "502.10": {
        "navigation": {
            "nextRule": "502.10a",
            "previousRule": "502.9g"
        },
        "ruleNumber": "502.10",
        "examples": null,
        "ruleText": "Banding"
    },
    "217.5c": {
        "navigation": {
            "nextRule": "217.5d",
            "previousRule": "217.5b"
        },
        "ruleNumber": "217.5c",
        "examples": null,
        "ruleText": "Whenever a card enters the in-play zone, it's considered a brand-new permanent and has no relationship to any previous permanent represented by the same card (see rule 217.8, \"Phased-Out\")."
    },
    "217.7a": {
        "navigation": {
            "nextRule": "217.7b",
            "previousRule": "217.7"
        },
        "ruleNumber": "217.7a",
        "examples": null,
        "ruleText": "Effects can remove cards from the game. Some effects may provide a way for the card to return to play and use the term \"set aside.\" Cards that are set aside this way are still removed from the game, even though that removal may be temporary."
    },
    "502.18": {
        "navigation": {
            "nextRule": "502.18a",
            "previousRule": "502.17c"
        },
        "ruleNumber": "502.18",
        "examples": null,
        "ruleText": "Cycling"
    },
    "419.1": {
        "navigation": {
            "nextRule": "419.2",
            "previousRule": "418.5e"
        },
        "ruleNumber": "419.1",
        "examples": null,
        "ruleText": "Replacement and prevention effects are continuous effects that watch for a particular event to happen and then completely or partially replace that event. (A prevention effect replaces an event with nothing or with a lessened version of the event.) These effects act like \"shields\" around whatever they're affecting. All replacement effects use the word \"instead\" to indicate what events will be replaced with other events, and prevention effects use \"prevent\" to indicate what events will not occur. Abilities that contain \"instead\" or \"prevent\" generate replacement or prevention effects, respectively."
    },
    "409.1e": {
        "navigation": {
            "nextRule": "409.1f",
            "previousRule": "409.1d"
        },
        "ruleNumber": "409.1e",
        "examples": null,
        "ruleText": "If the spell or ability requires the player to divide an effect (such as damage or counters) among a number of targets, the player announces the division. Each of these targets must receive at least one of whatever is being divided (for example, damage or counters)."
    },
    "502.13": {
        "navigation": {
            "nextRule": "502.13a",
            "previousRule": "502.12c"
        },
        "ruleNumber": "502.13",
        "examples": null,
        "ruleText": "Cumulative Upkeep"
    },
    "408.1g": {
        "navigation": {
            "nextRule": "408.1h",
            "previousRule": "408.1f"
        },
        "ruleNumber": "408.1g",
        "examples": null,
        "ruleText": "Combat damage goes on the stack once it's been assigned. For more information, see rule 310, \"Combat Damage Step.\""
    },
    "502.28a": {
        "navigation": {
            "nextRule": "502.28b",
            "previousRule": "502.28"
        },
        "ruleNumber": "502.28a",
        "examples": null,
        "ruleText": "Double strike is a static ability that modifies the rules for the combat damage step."
    },
    "502.17b": {
        "navigation": {
            "nextRule": "502.17c",
            "previousRule": "502.17a"
        },
        "ruleNumber": "502.17b",
        "examples": null,
        "ruleText": "A creature with horsemanship can't be blocked by creatures without horsemanship. A creature with horsemanship can block a creature with or without horsemanship."
    },
    "413.2e": {
        "navigation": {
            "nextRule": "413.2f",
            "previousRule": "413.2d"
        },
        "ruleNumber": "413.2e",
        "examples": null,
        "ruleText": "If an effect gives a player the option to pay mana, he or she may play mana abilities as part of the action. No other spells or abilities can be played during resolution."
    },
    "314.1a": {
        "navigation": {
            "nextRule": "314.1b",
            "previousRule": "314.1"
        },
        "ruleNumber": "314.1a",
        "examples": null,
        "ruleText": "First, if the active player's hand contains more cards than his or her maximum hand size (normally seven), he or she discards enough cards to reduce the hand size to that number. This action doesn't go on the stack."
    },
    "214.8k": {
        "navigation": {
            "nextRule": "214.9",
            "previousRule": "214.8i"
        },
        "ruleNumber": "214.8k",
        "examples": null,
        "ruleText": "An enchant world card is a global enchantment."
    },
    "310.1": {
        "navigation": {
            "nextRule": "310.1a",
            "previousRule": "309.5"
        },
        "ruleNumber": "310.1",
        "examples": null,
        "ruleText": "First the active player announces how each attacking creature will assign its combat damage. Then the defending player announces how each blocking creature will assign its combat damage. (See also rule 502.2, \"First Strike.\") A player may divide a creature's combat damage as he or she chooses among the legal recipients. Dividing combat damage is subject to the following restrictions:"
    },
    "412.2": {
        "navigation": {
            "nextRule": "412.3",
            "previousRule": "412.1"
        },
        "ruleNumber": "412.2",
        "examples": null,
        "ruleText": "Many local enchantments have static abilities that modify their enchanted permanent, but those abilities don't target that permanent. If a local enchantment is moved to a different permanent, the ability stops applying to the original permanent and starts modifying the new one."
    },
    "504.6": {
        "navigation": {
            "nextRule": "505.1",
            "previousRule": "504.5"
        },
        "ruleNumber": "504.6",
        "examples": null,
        "ruleText": "If a face-down permanent moves from the in-play zone to any zone other than the phased-out zone, its owner must reveal it to all players as he or she moves it. If a face-down spell moves from the stack to any zone other than the in-play zone, its owner must reveal it to all players as he or she moves it. At the end of each game, all face-down spells and permanents must be revealed to all players."
    },
    "408.1": {
        "navigation": {
            "nextRule": "408.1a",
            "previousRule": "407.3"
        },
        "ruleNumber": "408.1",
        "examples": null,
        "ruleText": "Timing, Priority, and the Stack"
    },
    "502.14b": {
        "navigation": {
            "nextRule": "502.14c",
            "previousRule": "502.14a"
        },
        "ruleNumber": "502.14b",
        "examples": null,
        "ruleText": "Five snow-covered lands were printed in the Ice Age™ expansion. Their names are Snow-Covered Plains, Snow-Covered Island, Snow-Covered Swamp, Snow-Covered Mountain, and Snow-Covered Forest. These lands are basic lands, even though they have a different name and they have the snow-covered ability."
    },
    "217.8d": {
        "navigation": {
            "nextRule": "217.9",
            "previousRule": "217.8c"
        },
        "ruleNumber": "217.8d",
        "examples": null,
        "ruleText": "Tokens in the phased-out zone cease to exist. This is a state-based effect (see rule 420, \"State-Based Effects\"). Any local enchantments that were attached to those token creatures remain phased out for the rest of the game."
    },
    "101.3": {
        "navigation": {
            "nextRule": "101.4",
            "previousRule": "101.2"
        },
        "ruleNumber": "101.3",
        "examples": null,
        "ruleText": "Once the starting player has been determined, each player sets his or her life total to 20 and draws a hand of seven cards."
    },
    "300.6": {
        "navigation": {
            "nextRule": "301.1",
            "previousRule": "300.5"
        },
        "ruleNumber": "300.6",
        "examples": null,
        "ruleText": "Some spells and abilities can give a player extra turns. They do this by adding the turns directly after the current turn. If a player gets multiple extra turns or if both players get extra turns during a single turn, the extra turns are added one at a time. The most recently created turn will be taken first."
    },
    "502.22": {
        "navigation": {
            "nextRule": "502.22a",
            "previousRule": "502.21d"
        },
        "ruleNumber": "502.22",
        "examples": null,
        "ruleText": "Flashback"
    },
    "406.2d": {
        "navigation": {
            "nextRule": "406.2e",
            "previousRule": "406.2c"
        },
        "ruleNumber": "406.2d",
        "examples": "Example: An ability reading, \"At end of turn, remove this creature from the game\" won't do anything if the creature leaves play before the end of turn step.",
        "ruleText": "A delayed ability that refers to a particular permanent will fail if the permanent leaves play (even if it returns again before the specified time). Similarly, delayed triggered abilities that apply to a card in a particular zone will fail if the card leaves that zone."
    },
    "413.2h": {
        "navigation": {
            "nextRule": "413.2i",
            "previousRule": "413.2g"
        },
        "ruleNumber": "413.2h",
        "examples": null,
        "ruleText": "A spell card is put into play from the stack under the control of the spell's controller (for permanents) or is put into its owner's graveyard from the stack (for instants and sorceries) as the final step of the spell's resolution."
    },
    "217.6b": {
        "navigation": {
            "nextRule": "217.6c",
            "previousRule": "217.6a"
        },
        "ruleNumber": "217.6b",
        "examples": null,
        "ruleText": "When a spell is played, it goes on the stack face up. Other spells or abilities played in response go on top of it. Abilities that go on the stack are represented by imaginary cards called pseudospells. Each pseudospell from an activated or triggered ability has the text of the ability that created it. The controller of a pseudospell from an activated ability is the player who played the ability. The controller of a pseudospell from a triggered ability is the player who controlled the ability's source when it triggered."
    },
    "503.5": {
        "navigation": {
            "nextRule": "503.6",
            "previousRule": "503.4"
        },
        "ruleNumber": "503.5",
        "examples": "Example: Skyshroud Behemoth reads, \"Fading 2 (This creature comes into play with two fade counters on it. At the beginning of your upkeep, remove a fade counter from it. If you can't, sacrifice it.) / Skyshroud Behemoth comes into play tapped.\" A Clone that comes into play as a copy of a Skyshroud Behemoth will also come into play tapped with two fade counters on it.\nExample: Striped Bears reads, \"When Striped Bears comes into play, draw a card.\" A Clone comes into play as a copy of Striped Bears. The Clone has the Bears' comes-into-play triggered ability, so the Clone's controller draws a card.",
        "ruleText": "A copy card that comes into play \"as a copy\" of another permanent will come into play with any copied abilities of that permanent. If the copy gains any abilities that modify the comes-into-play event (such as \"comes into play with\" or \"as [this] comes into play\" abilities), those abilities will take effect. Also, any comes-into-play triggered abilities of the copy will have a chance to trigger."
    },
    "407.1": {
        "navigation": {
            "nextRule": "407.2",
            "previousRule": "406.2e"
        },
        "ruleNumber": "407.1",
        "examples": null,
        "ruleText": "Effects can add or remove abilities of permanents. If two or more effects add and remove the same ability, in general the most recent one prevails. (See rule 418.5, \"Interaction of Continuous Effects.\")"
    },
    "502.9g": {
        "navigation": {
            "nextRule": "502.10",
            "previousRule": "502.9f"
        },
        "ruleNumber": "502.9g",
        "examples": null,
        "ruleText": "Multiple instances of trample on the same creature are redundant."
    },
    "212.2d": {
        "navigation": {
            "nextRule": "213.1",
            "previousRule": "212.2c"
        },
        "ruleNumber": "212.2d",
        "examples": null,
        "ruleText": "There are no subtypes for artifact cards, instant cards, or sorcery cards."
    },
    "502.25a": {
        "navigation": {
            "nextRule": "502.25b",
            "previousRule": "502.25"
        },
        "ruleNumber": "502.25a",
        "examples": null,
        "ruleText": "Fear is an evasion ability."
    },
    "502.6e": {
        "navigation": {
            "nextRule": "502.7",
            "previousRule": "502.6d"
        },
        "ruleNumber": "502.6e",
        "examples": null,
        "ruleText": "Multiple instances of the same type of landwalk or snow-covered landwalk on the same creature are redundant."
    },
    "502.6": {
        "navigation": {
            "nextRule": "502.6a",
            "previousRule": "502.5c"
        },
        "ruleNumber": "502.6",
        "examples": null,
        "ruleText": "Landwalk"
    },
    "504.1": {
        "navigation": {
            "nextRule": "504.2",
            "previousRule": "503.11"
        },
        "ruleNumber": "504.1",
        "examples": null,
        "ruleText": "One old card (Illusionary Mask) and the morph ability (see rule 502.26) allow spells and permanents to be face down."
    },
    "502.7b": {
        "navigation": {
            "nextRule": "502.7c",
            "previousRule": "502.7a"
        },
        "ruleNumber": "502.7b",
        "examples": null,
        "ruleText": "A permanent with protection can't be targeted by spells with the stated quality, can't be targeted by abilities from a source with the stated quality, and can't be enchanted by enchantments that have the stated quality. Such enchantments enchanting the permanent with protection will be put into their owners' graveyards as a state-based effect. In addition, any damage that would be dealt to it from sources having that quality is prevented. If it attacks, it can't be blocked by creatures having that quality."
    },
    "402.5": {
        "navigation": {
            "nextRule": "402.6",
            "previousRule": "402.4"
        },
        "ruleNumber": "402.5",
        "examples": null,
        "ruleText": "An ability isn't a spell and therefore can't be countered by anything that counters only spells. Abilities can be countered by effects that specifically counter abilities, as well as by the rules (for example, an ability with one or more targets is countered if all its targets become illegal)."
    },
    "302.1": {
        "navigation": {
            "nextRule": "302.2",
            "previousRule": "301.1"
        },
        "ruleNumber": "302.1",
        "examples": null,
        "ruleText": "First, the active player determines which permanents he or she controls will untap. (Normally they all do, but effects may modify this.) Then he or she untaps them all simultaneously. Effects can keep one or more of a player's permanents from untapping normally."
    },
    "421.3": {
        "navigation": {
            "nextRule": "421.4",
            "previousRule": "421.2"
        },
        "ruleNumber": "421.3",
        "examples": "Example: One player controls a creature with the ability \"0: [This creature] gains flying.\" Another player controls a permanent with the ability \"0: Target creature loses flying.\" The \"infinity rule\" ensures that regardless of which player initiated the gain/lose flying ability, the nonactive player will always have the final choice and therefore be able to determine whether the creature has flying. (Note that this assumes that the first player attempted to give the creature flying at least once.)",
        "ruleText": "If the loop contains at least one optional action controlled by each player and actions by both players are required to continue the loop, the active player chooses a number. The nonactive player then has two choices. He or she can choose a lower number, in which case the loop continues that number of times plus whatever fraction is necessary for the active player to \"have the last word.\" Or he or she can agree to the number the active player chose, in which case the loop continues that number of times plus whatever fraction is necessary for the nonactive player to \"have the last word.\" (Note that either fraction may be zero.)"
    },
    "502.20a": {
        "navigation": {
            "nextRule": "502.21",
            "previousRule": "502.20"
        },
        "ruleNumber": "502.20a",
        "examples": null,
        "ruleText": "Fading is a keyword that represents two abilities. The first is a static ability that puts counters onto a permanent as it comes into play. The second is a triggered ability that makes the permanent's controller remove one of these counters at the beginning of each of his or her upkeeps. If the player can't remove a counter, he or she sacrifices the permanent. The phrase \"Fading [X]\" means \"This permanent comes into play with X fade counters on it\" and \"At the beginning of your upkeep, remove a fade counter from this permanent. If you can't, sacrifice the permanent.\""
    },
    "418.3c": {
        "navigation": {
            "nextRule": "418.3d",
            "previousRule": "418.3b"
        },
        "ruleNumber": "418.3c",
        "examples": null,
        "ruleText": "If the spell or ability creating a continuous effect contains a variable, the value of that variable is determined only once, on resolution. See rule 413.2f."
    },
    "214.9b": {
        "navigation": {
            "nextRule": "214.9c",
            "previousRule": "214.9a"
        },
        "ruleNumber": "214.9b",
        "examples": null,
        "ruleText": "A player may normally play only one land card during each of his or her own turns, only during a main phase, and only when the stack is empty. Spells and abilities may allow the playing of additional lands; playing an additional land in this way doesn't prevent a player from taking the normal action of playing a land. Players can't begin to play a land that an effect prohibits from being played. As a player plays a land, he or she announces whether he or she is using the once-per-turn action of playing a land. If not, he or she specifies which effect is allowing the additional land play. Spells and abilities may also allow you to \"put\" lands into play. This isn't the same as \"playing a land\" and doesn't count as the player's one land played during his or her turn."
    },
    "214.4": {
        "navigation": {
            "nextRule": "214.4a",
            "previousRule": "214.3"
        },
        "ruleNumber": "214.4",
        "examples": null,
        "ruleText": "When a permanent's type or subtype changes, the new type(s) replaces any existing type(s). This changes only the permanent type-the card type doesn't change. Counters, effects, and damage affecting the permanent remain with it, even if they are meaningless to the new type."
    },
    "502.3b": {
        "navigation": {
            "nextRule": "502.3c",
            "previousRule": "502.3a"
        },
        "ruleNumber": "502.3b",
        "examples": null,
        "ruleText": "Whenever a creature with flanking is blocked by a creature without flanking, the blocking creature gets -1/-1 until end of turn."
    },
    "410.9d": {
        "navigation": {
            "nextRule": "410.10",
            "previousRule": "410.9c"
        },
        "ruleNumber": "410.9d",
        "examples": null,
        "ruleText": "If an ability triggers when a creature blocks or is blocked by a particular number of creatures, the ability triggers only if the creature blocks or is blocked by that many creatures when the attack or block declaration is made. Effects that add or remove blockers can cause such abilities to trigger, but effects that switch blockers cannot. This also applies to abilities that trigger on a creature blocking or being blocked by at least a certain number of creatures."
    },
    "214.4a": {
        "navigation": {
            "nextRule": "214.4b",
            "previousRule": "214.4"
        },
        "ruleNumber": "214.4a",
        "examples": "Example: An ability reads, \"All lands are 1/1 creatures that are still lands.\" The affected lands now have two types: creature and land. If there were any lands that also had the artifact type before the ability's effect applied to them, those lands would become \"land creatures,\" not \"artifact land creatures.\" The effect allows them to retain the land type, but wipes out the artifact type.",
        "ruleText": "Some effects change a permanent's type or subtype but specify that the permanent retains a prior type or subtype. In such cases, the retained type isn't replaced, but any other types the permanent has are replaced."
    },
    "502.1": {
        "navigation": {
            "nextRule": "502.2",
            "previousRule": "501.3"
        },
        "ruleNumber": "502.1",
        "examples": null,
        "ruleText": "Most creature abilities describe exactly what they do in the card's rules text. Some, though, are very common or would require too much space to define on the card. In these cases, the card lists only the name of the ability as a \"keyword\"; sometimes reminder text summarizes the game rule."
    },
    "212.2a": {
        "navigation": {
            "nextRule": "212.2b",
            "previousRule": "212.2"
        },
        "ruleNumber": "212.2a",
        "examples": "Example: \"Creature - Minotaur\" means the card is a creature with the Minotaur subtype. \"Creature - Goblin Wizard\" means the card is a creature with the creature types Goblin and Wizard.",
        "ruleText": "Creature subtypes are always a single word and are listed after \"Creature,\" separated by a long dash: \"Creature - Minotaur,\" \"Artifact Creature - Golem Legend,\" etc. Creature subtypes are one word each and are also called \"creature types.\" Creature cards may have multiple creature types."
    },
    "502.24b": {
        "navigation": {
            "nextRule": "502.25",
            "previousRule": "502.24a"
        },
        "ruleNumber": "502.24b",
        "examples": null,
        "ruleText": "Playing a spell using its madness ability follows the rules for paying alternative costs in rules 409.1b and 409.1f."
    },
    "502.15f": {
        "navigation": {
            "nextRule": "502.15g",
            "previousRule": "502.15e"
        },
        "ruleNumber": "502.15f",
        "examples": null,
        "ruleText": "A card that returns to play from the phased-out zone is in some respects considered the same permanent it was when it left. This is an exception to rule 217.8, which stipulates that a permanent \"forgets\" its previous existence when it changes zones."
    },
    "306.1": {
        "navigation": {
            "nextRule": "306.2",
            "previousRule": "305.4"
        },
        "ruleNumber": "306.1",
        "examples": null,
        "ruleText": "The combat phase has five steps, which proceed in order: beginning of combat, declare attackers, declare blockers, combat damage, and end of combat. The declare blockers and combat damage steps are skipped if no creatures are declared as attackers (see rule 308.4)."
    },
    "503.11": {
        "navigation": {
            "nextRule": "504.1",
            "previousRule": "503.10a"
        },
        "ruleNumber": "503.11",
        "examples": "Example: An Unstable Shapeshifter copies a Crazed Armodon. Crazed Armodon reads, \"G: Crazed Armodon gets +3/+0 and gains trample until end of turn. Destroy Crazed Armodon at end of turn. Play this ability only once each turn.\" If this activated ability of the Shapeshifter is played, the Shapeshifter will be destroyed at end of turn, even if it's no longer a copy of Crazed Armodon at that time.",
        "ruleText": "If an effect refers to a permanent by name, the effect still tracks that permanent even if it changes names or becomes a copy of something else."
    },
    "217.3c": {
        "navigation": {
            "nextRule": "217.4",
            "previousRule": "217.3b"
        },
        "ruleNumber": "217.3c",
        "examples": null,
        "ruleText": "A player may arrange his or her hand in any convenient fashion and look at it as much as he or she wishes. A player can't look at the cards in another player's hand but may count those cards at any time."
    },
    "419.8b": {
        "navigation": {
            "nextRule": "420.1",
            "previousRule": "419.8a"
        },
        "ruleNumber": "419.8b",
        "examples": "Example: One effect reads, \"For each 1 life you would gain, instead draw a card,\" and another reads, \"Instead of drawing a card, return target card from your graveyard to your hand.\" Both effects combine (regardless of the order they came into play): Instead of gaining 1 life, the player puts a card from his or her graveyard into his or her hand.",
        "ruleText": "A replacement effect can become applicable to an event as the result of another replacement effect that modifies the event."
    },
    "410.10": {
        "navigation": {
            "nextRule": "410.10a",
            "previousRule": "410.9d"
        },
        "ruleNumber": "410.10",
        "examples": null,
        "ruleText": "Trigger events that involve cards or permanents changing zones are called \"zone-change triggers.\" Many abilities with zone-change triggers attempt to do something to that card after it changes zones. During resolution, these abilities look for the card in the zone that it moved to. If the card is unable to be found in the zone it went to, the part of the ability attempting to do something to the card will fail to do anything. The ability could be unable to find the card because the card never entered the specified zone, because it left the zone before the ability resolved, or because it is in a zone that is hidden from a player, such as a library or an opponent's hand. (This rule applies even if the card leaves the zone and returns again before the ability resolves.) The most common types of zone-change triggers are comes-into-play triggers and leaves-play triggers."
    },
    "411.1": {
        "navigation": {
            "nextRule": "411.2",
            "previousRule": "410.11"
        },
        "ruleNumber": "411.1",
        "examples": null,
        "ruleText": "To play a mana ability, the player announces that he or she is playing it and pays the activation cost. It resolves immediately afterward and doesn't go on the stack. (See rule 408.2e.)"
    },
    "402.8": {
        "navigation": {
            "nextRule": "402.9",
            "previousRule": "402.7"
        },
        "ruleNumber": "402.8",
        "examples": "Example: An ability with a cost that includes \"discard this card from your hand\" can be played only if the card is in your hand.",
        "ruleText": "Abilities function only while the permanent with the ability is in play unless the ability states otherwise or unless the ability can only work, trigger, or be played in a zone other than the in-play zone."
    },
    "314.1c": {
        "navigation": {
            "nextRule": "400.1",
            "previousRule": "314.1b"
        },
        "ruleNumber": "314.1c",
        "examples": null,
        "ruleText": "Then, only if the conditions for any state-based effects exist or if any triggered abilities are waiting to be put onto the stack, the active player receives priority to play spells and abilities. Once the stack is empty and both players pass, another cleanup step begins. Otherwise, no player receives priority and the step ends."
    },
    "217.2b": {
        "navigation": {
            "nextRule": "217.2c",
            "previousRule": "217.2a"
        },
        "ruleNumber": "217.2b",
        "examples": null,
        "ruleText": "Each library must be kept in a single face-down pile. Players can't look at or change the order of cards in a library."
    },
    "410.9": {
        "navigation": {
            "nextRule": "410.9a",
            "previousRule": "410.8"
        },
        "ruleNumber": "410.9",
        "examples": null,
        "ruleText": "Some abilities trigger when creatures block or are blocked in combat. (See rules 306-311 and section 5, \"Additional Rules.\") They may trigger once or repeatedly, depending on the wording of the ability."
    },
    "408.2": {
        "navigation": {
            "nextRule": "408.2a",
            "previousRule": "408.1h"
        },
        "ruleNumber": "408.2",
        "examples": null,
        "ruleText": "Actions That Don't Use the Stack"
    },
    "416.3": {
        "navigation": {
            "nextRule": "417.1",
            "previousRule": "416.2"
        },
        "ruleNumber": "416.3",
        "examples": "Example: If a player is holding only one card, an effect that reads \"Discard two cards\" causes him or her to discard only that card. If an effect moves cards out of the library (as opposed to drawing), it moves as many as possible.",
        "ruleText": "If an effect attempts to do something impossible, it does only as much as possible."
    },
    "404.2": {
        "navigation": {
            "nextRule": "404.3",
            "previousRule": "404.1"
        },
        "ruleNumber": "404.2",
        "examples": null,
        "ruleText": "Triggered abilities aren't played. Instead, a triggered ability automatically \"triggers\" each time its trigger event occurs. Once an ability has triggered, it goes on the stack the next time a player would receive priority."
    },
    "102.2": {
        "navigation": {
            "nextRule": "102.3",
            "previousRule": "102.1"
        },
        "ruleNumber": "102.2",
        "examples": null,
        "ruleText": "When a player is required to draw more cards than are left in his or her library, he or she draws the remaining cards, then loses the game the next time a player would receive priority. (This is a state-based effect. See rule 420.)"
    },
    "217.8b": {
        "navigation": {
            "nextRule": "217.8c",
            "previousRule": "217.8a"
        },
        "ruleNumber": "217.8b",
        "examples": null,
        "ruleText": "Cards in the phased-out zone may be examined by either player at any time."
    },
    "212.2b": {
        "navigation": {
            "nextRule": "212.2c",
            "previousRule": "212.2a"
        },
        "ruleNumber": "212.2b",
        "examples": null,
        "ruleText": "Enchantment subtypes consist of the word \"enchant\" and the word(s) that follows it: \"enchant creature,\" \"enchant land,\" etc. (\"enchant world\" isn't a type or subtype, but a special category of enchantment found only in some older sets). A card with the type \"enchantment\" has no enchantment subtype. An enchantment subtype specifies what the enchantment can be legally attached to. \"Local enchantment\" and \"global enchantment\" aren't types or subtypes; they're categories of enchantments. (Also see rule 214.8, \"Enchantments.\")"
    },
    "502.25": {
        "navigation": {
            "nextRule": "502.25a",
            "previousRule": "502.24b"
        },
        "ruleNumber": "502.25",
        "examples": null,
        "ruleText": "Fear"
    },
    "420.5b": {
        "navigation": {
            "nextRule": "420.5c",
            "previousRule": "420.5a"
        },
        "ruleNumber": "420.5b",
        "examples": null,
        "ruleText": "A creature with toughness 0 or less is put into its owner's graveyard. Regeneration can't replace this event."
    },
    "409.1": {
        "navigation": {
            "nextRule": "409.1a",
            "previousRule": "408.2h"
        },
        "ruleNumber": "409.1",
        "examples": null,
        "ruleText": "Playing a spell or activated ability follows the steps listed below, in order. If, at any point during the playing of a spell or ability, a player is unable to comply with any of the steps listed below, the spell was played illegally; the game returns to the moment before that spell or ability was played (see rule 422, \"Handling Illegal Actions\"). Announcements and payments can't be altered after they've been made. Some spells and abilities specify that their controller's opponent does something the controller would normally do while it's being played, such as choose a mode, choose targets, or choose how the spell or ability will affect its targets. In these cases, the opponent does so when the spell or ability's controller normally would do so. If the spell or ability instructs both players to do something at the same time as it's being played, the spell's controller goes first, then his or her opponent. This applies to all parts of rule 409.1."
    },
    "502.23": {
        "navigation": {
            "nextRule": "502.23a",
            "previousRule": "502.22a"
        },
        "ruleNumber": "502.23",
        "examples": null,
        "ruleText": "Threshold"
    },
    "217.1a": {
        "navigation": {
            "nextRule": "217.1b",
            "previousRule": "217.1"
        },
        "ruleNumber": "217.1a",
        "examples": null,
        "ruleText": "If a card would go to any library, graveyard, or hand other than its owner's, it goes to the corresponding zone of its owner's instead. If an instant or sorcery card would come into play, it remains in its previous zone instead."
    },
    "102.4": {
        "navigation": {
            "nextRule": "102.5",
            "previousRule": "102.3"
        },
        "ruleNumber": "102.4",
        "examples": null,
        "ruleText": "If both players lose simultaneously, the game is a draw."
    },
    "408.1h": {
        "navigation": {
            "nextRule": "408.2",
            "previousRule": "408.1g"
        },
        "ruleNumber": "408.1h",
        "examples": null,
        "ruleText": "Static abilities aren't played-they continuously affect the game. Priority doesn't apply to them. (See rule 418, \"Continuous Effects,\" and rule 419, \"Replacement and Prevention Effects.\")"
    },
    "101.1": {
        "navigation": {
            "nextRule": "101.2",
            "previousRule": "100.5"
        },
        "ruleNumber": "101.1",
        "examples": null,
        "ruleText": "At the start of a game, each player shuffles his or her own deck so that the cards are in a random order. Each player may then shuffle his or her opponent's deck."
    },
    "501.2": {
        "navigation": {
            "nextRule": "501.3",
            "previousRule": "501.1"
        },
        "ruleNumber": "501.2",
        "examples": "Example: A Wall without flying can't block a creature that can be blocked only by Walls and by creatures with flying.",
        "ruleText": "Evasion abilities are cumulative."
    },
    "502.29a": {
        "navigation": {
            "nextRule": "502.29b",
            "previousRule": "502.29"
        },
        "ruleNumber": "502.29a",
        "examples": null,
        "ruleText": "Provoke is a triggered ability. \"Provoke\" means \"Whenever this creature attacks, you may choose to have target creature defending player controls block this creature this combat if able. If you do, untap that creature.\""
    },
    "502.27": {
        "navigation": {
            "nextRule": "502.27a",
            "previousRule": "502.26f"
        },
        "ruleNumber": "502.27",
        "examples": null,
        "ruleText": "Amplify"
    },
    "502.8a": {
        "navigation": {
            "nextRule": "502.8b",
            "previousRule": "502.8"
        },
        "ruleNumber": "502.8a",
        "examples": null,
        "ruleText": "Shadow is an evasion ability."
    },
    "408.1d": {
        "navigation": {
            "nextRule": "408.1e",
            "previousRule": "408.1c"
        },
        "ruleNumber": "408.1d",
        "examples": null,
        "ruleText": "A player may play a spell or activated ability only when he or she has priority. Spells other than instants can be played only during a player's main phase, when that player has priority, and only when the stack is empty."
    },
    "502.10e": {
        "navigation": {
            "nextRule": "502.10f",
            "previousRule": "502.10d"
        },
        "ruleNumber": "502.10e",
        "examples": "Example: A player attacks with a band consisting of a creature with flying and a creature with swampwalk. The defending player, who controls a swamp, can block the flying creature if able. If he or she does, then the creature with swampwalk will also become blocked by the blocking creature(s).",
        "ruleText": "If an attacking creature becomes blocked by a creature, each other creature in the same band as the attacking creature becomes blocked by that same blocking creature."
    },
    "420.5i": {
        "navigation": {
            "nextRule": "420.5j",
            "previousRule": "420.5h"
        },
        "ruleNumber": "420.5i",
        "examples": null,
        "ruleText": "If two or more enchant worlds are in play, all except the one that has been an enchant world for the shortest amount of time are put into their owners' graveyards. In the event of a tie for the shortest amount of time, all are put into their owners' graveyards."
    },
    "409.2": {
        "navigation": {
            "nextRule": "409.3",
            "previousRule": "409.1g"
        },
        "ruleNumber": "409.2",
        "examples": null,
        "ruleText": "Activated abilities that read \"Play this ability only any time you could play [spell type]\" mean the player must follow the timing rules for that spell type, though the ability isn't actually of that spell type."
    },
    "502.21a": {
        "navigation": {
            "nextRule": "502.21b",
            "previousRule": "502.21"
        },
        "ruleNumber": "502.21a",
        "examples": null,
        "ruleText": "Kicker is a static ability that functions while the card is on the stack (that is, while it's a spell). The phrase \"Kicker [cost]\" means \"You may pay an additional [cost] as you play this spell.\" The phrase \"Kicker [cost 1] and/or [cost 2]\" means the same thing as \"Kicker [cost 1], kicker [cost 2].\" Paying a spell's kicker cost(s) follows the rules for paying additional costs in rules 409.1b and 409.1f."
    },
    "502.9c": {
        "navigation": {
            "nextRule": "502.9d",
            "previousRule": "502.9b"
        },
        "ruleNumber": "502.9c",
        "examples": null,
        "ruleText": "If all the creatures blocking an attacking creature with trample are removed from combat before the combat damage step, all its damage is assigned to the defending player."
    },
    "502.15c": {
        "navigation": {
            "nextRule": "502.15d",
            "previousRule": "502.15b"
        },
        "ruleNumber": "502.15c",
        "examples": null,
        "ruleText": "If a spell or ability causes a player to skip his or her untap step, the phasing event simply doesn't occur that turn."
    },
    "502.8": {
        "navigation": {
            "nextRule": "502.8a",
            "previousRule": "502.7c"
        },
        "ruleNumber": "502.8",
        "examples": null,
        "ruleText": "Shadow"
    },
    "408.2d": {
        "navigation": {
            "nextRule": "408.2e",
            "previousRule": "408.2c"
        },
        "ruleNumber": "408.2d",
        "examples": null,
        "ruleText": "Playing a land is a special action consisting of putting that land into play. (See rule 214.9, \"Lands.\")"
    },
    "502.15k": {
        "navigation": {
            "nextRule": "502.15m",
            "previousRule": "502.15j"
        },
        "ruleNumber": "502.15k",
        "examples": null,
        "ruleText": "If two or more permanents phase in at the same time, the active player determines their relative timestamp order at the time they come into play. Local enchantments that phase in indirectly must always have later timestamps than the permanents they enchant, and if several enchantments phase in indirectly on the same permanent, their original relative timestamp order must be maintained. (See glossary, \"Timestamp Order.\") This doesn't change the fact that the permanents phase in simultaneously, however. For example, if two Legends with the same name phase in, they both go to their owners' graveyards."
    },
    "502.21d": {
        "navigation": {
            "nextRule": "502.22",
            "previousRule": "502.21c"
        },
        "ruleNumber": "502.21d",
        "examples": null,
        "ruleText": "A card with kicker may contain the phrases \"if you paid the [A] kicker cost\" and \"if you paid the [B] kicker cost,\" where A and B are the first and second kicker costs listed on the card, respectively. This text just refers to one kicker cost or the other, regardless of what the spell's controller actually spent when paying the cost. In other words, read \"if you paid the [A] kicker cost\" as \"if you paid the first kicker cost listed,\" and read \"if you paid the [B] kicker cost\" as \"if you paid the second kicker cost listed.\""
    },
    "402.2": {
        "navigation": {
            "nextRule": "402.3",
            "previousRule": "402.1"
        },
        "ruleNumber": "402.2",
        "examples": null,
        "ruleText": "Abilities can be beneficial or detrimental. For example, \"[This creature] can't block\" is an ability."
    },
    "502.26d": {
        "navigation": {
            "nextRule": "502.26e",
            "previousRule": "502.26c"
        },
        "ruleNumber": "502.26d",
        "examples": null,
        "ruleText": "Any time you could play an instant, you may turn a face-down permanent you control face up. To do this, show all players the permanent's morph cost, pay that cost, then turn the permanent face up. The morph effect on it ends, and it regains the card's normal characteristics. Any abilities relating to the permanent coming into play don't trigger when it's turned face up and don't have any effect, because the permanent has already come into play."
    },
    "502.2d": {
        "navigation": {
            "nextRule": "502.3",
            "previousRule": "502.2c"
        },
        "ruleNumber": "502.2d",
        "examples": null,
        "ruleText": "Multiple instances of first strike on the same creature are redundant."
    },
    "207.2": {
        "navigation": {
            "nextRule": "208.1",
            "previousRule": "207.1"
        },
        "ruleNumber": "207.2",
        "examples": null,
        "ruleText": "The text box may also contain italicized reminder text (in parentheses), which summarizes a rule that applies to that card, and italicized flavor text, which has no game function, but like the illustration, adds artistic appeal to the game."
    },
    "502.12c": {
        "navigation": {
            "nextRule": "502.13",
            "previousRule": "502.12b"
        },
        "ruleNumber": "502.12c",
        "examples": null,
        "ruleText": "If a creature has multiple instances of rampage, each triggers separately."
    },
    "215.2": {
        "navigation": {
            "nextRule": "215.3",
            "previousRule": "215.1"
        },
        "ruleNumber": "215.2",
        "examples": null,
        "ruleText": "\"Legend\" is a creature type; \"legendary\" is not. If a \"legendary\" noncreature permanent becomes a creature, it gets the creature type \"Legend\" for as long as it's a creature. If a creature of type \"Legend\" becomes a noncreature permanent, it's a \"legendary\" permanent of the new type. In other words, they mean the same thing, except that one refers to creatures and the other to noncreatures. "
    },
    "413.1": {
        "navigation": {
            "nextRule": "413.2",
            "previousRule": "412.5"
        },
        "ruleNumber": "413.1",
        "examples": null,
        "ruleText": "Each time both players pass in succession, the spell, ability, or combat damage on top of the stack resolves. (See rule 416, \"Effects.\")"
    },
    "502.6c": {
        "navigation": {
            "nextRule": "502.6d",
            "previousRule": "502.6b"
        },
        "ruleNumber": "502.6c",
        "examples": null,
        "ruleText": "Snow-covered landwalk is a special type of landwalk. If a player is allowed to choose any landwalk ability, that player may choose a snow-covered landwalk ability. If an effect causes a permanent to lose all landwalk abilities, snow-covered landwalk abilities are removed as well."
    },
    "502.6b": {
        "navigation": {
            "nextRule": "502.6c",
            "previousRule": "502.6a"
        },
        "ruleNumber": "502.6b",
        "examples": null,
        "ruleText": "Landwalk and snow-covered landwalk are evasion abilities. A creature with landwalk is unblockable as long as the defending player controls at least one land of the specified type. A creature with snow-covered landwalk is unblockable as long as the defending player controls at least one land of the specified type that has snow-covered."
    },
    "214.8h": {
        "navigation": {
            "nextRule": "214.8i",
            "previousRule": "214.8g"
        },
        "ruleNumber": "214.8h",
        "examples": null,
        "ruleText": "A local enchantment's abilities don't target the permanent it enchants unless they state they can target it. Only the enchantment spell targets the permanent it will enchant; the resulting enchantment permanent doesn't continue to target the enchanted permanent after the enchantment spell resolves. If a permanent \"can't be enchanted\" in general or by enchantments with specified characteristics, it also can't be the target of a spell that would enchant it with such an enchantment."
    },
    "214.5": {
        "navigation": {
            "nextRule": "214.6",
            "previousRule": "214.4b"
        },
        "ruleNumber": "214.5",
        "examples": "Example: A player plays an artifact's ability that reads \"2: This permanent is a 3/2 artifact creature.\" Later in the turn, the artifact creature is affected by an ability that reads \"Target creature is 0/2.\" At this point, playing the ability of the artifact again won't do anything; because the type-changing ability changes characteristics at the initial level, it can't override the effect. The artifact creature remains 0/2.",
        "ruleText": "The initial value of a permanent's characteristic is the value printed on the card or specified by the spell or ability that created the token or changed the type of the permanent. A permanent-type-changing ability that changes one or more characteristics changes the initial values of those characteristics stated in the ability's text, not the current values. Continuous effects that don't change a permanent's type affect current values of characteristics and can override characteristics set by type-changing abilities."
    },
    "309.3": {
        "navigation": {
            "nextRule": "309.4",
            "previousRule": "309.2"
        },
        "ruleNumber": "309.3",
        "examples": null,
        "ruleText": "If the proposed block isn't legal or the defending player can't pay all required costs, all actions described in rules 309.1 and 309.2 are canceled. Then the defending player redeclares blocking creatures. (See rule 422, \"Handling Illegal Actions.\")"
    },
    "217.2c": {
        "navigation": {
            "nextRule": "217.2d",
            "previousRule": "217.2b"
        },
        "ruleNumber": "217.2c",
        "examples": null,
        "ruleText": "Any player may count the number of cards remaining in either player's library at any time."
    },
    "410.4": {
        "navigation": {
            "nextRule": "410.5",
            "previousRule": "410.3"
        },
        "ruleNumber": "410.4",
        "examples": null,
        "ruleText": "When a triggered ability goes on the stack, the controller of the pseudospell makes all required choices, following the rules for activated abilities (see rule 409, \"Playing Spells and Activated Abilities\"). If no legal choice can be made (or if a rule or a continuous effect otherwise makes the ability illegal), the pseudospell is simply removed from the stack."
    },
    "419.7a": {
        "navigation": {
            "nextRule": "419.7b",
            "previousRule": "419.7"
        },
        "ruleNumber": "419.7a",
        "examples": null,
        "ruleText": "Prevention effects usually apply to damage that would be dealt."
    },
    "502.23a": {
        "navigation": {
            "nextRule": "502.23b",
            "previousRule": "502.23"
        },
        "ruleNumber": "502.23a",
        "examples": null,
        "ruleText": "Threshold is a static ability, written \"Threshold - [text].\" The text can be a static ability, activated ability, triggered ability, characteristic-setting text, spell text, or any combination of the five. The phrase \"Threshold - [text]\" means \"As long as you have seven or more cards in your graveyard, this card has '[text].'\""
    },
    "406.1": {
        "navigation": {
            "nextRule": "406.1a",
            "previousRule": "405.1"
        },
        "ruleNumber": "406.1",
        "examples": null,
        "ruleText": "Mana Abilities"
    },
    "503.8": {
        "navigation": {
            "nextRule": "503.9",
            "previousRule": "503.7"
        },
        "ruleNumber": "503.8",
        "examples": "Example: A Vesuvan Doppelganger comes into play as a copy of Chameleon Spirit, and the Doppelganger's controller chooses blue. Later, the Doppelganger copies Quirion Elves. The Elves has the ability, \"T: Add one mana of the chosen color to your mana pool.\" If the mana ability of the Doppelganger is played, it will produce blue mana.\nExample: A Vesuvan Doppelganger comes into play as a copy of Caller of the Hunt. Caller of the Hunt reads, in part, \"As Caller of the Hunt comes into play, choose a creature type.\" The Doppelganger's controller chooses Goblin. Later, the Doppelganger copies Quirion Elves. If the mana ability of the Doppelganger is played, it will fail to produce any mana. It won't produce Goblin mana.",
        "ruleText": "If an ability of a copy card causes a player to make a choice as the copy comes into play, the copy will \"remember\" that choice and continue to use it for its abilities if appropriate. If the choice is not appropriate, it is considered to be \"zero\" or \"undefined.\""
    },
    "502.8b": {
        "navigation": {
            "nextRule": "502.8c",
            "previousRule": "502.8a"
        },
        "ruleNumber": "502.8b",
        "examples": null,
        "ruleText": "A creature with shadow can't be blocked by creatures without shadow, and a creature without shadow can't be blocked by creatures with shadow."
    },
    "419.6d": {
        "navigation": {
            "nextRule": "419.7",
            "previousRule": "419.6c"
        },
        "ruleNumber": "419.6d",
        "examples": null,
        "ruleText": "Some spells and abilities replace part or all of their own effect(s) when they resolve. Such effects are called \"self-replacement effects.\" When applying replacement effects to an event, apply self-replacement effects first, then apply other replacement effects."
    },
    "502.28e": {
        "navigation": {
            "nextRule": "502.29",
            "previousRule": "502.28d"
        },
        "ruleNumber": "502.28e",
        "examples": null,
        "ruleText": "Multiple instances of double strike on the same creature are redundant."
    },
    "214.9h": {
        "navigation": {
            "nextRule": "215.1",
            "previousRule": "214.9g"
        },
        "ruleNumber": "214.9h",
        "examples": null,
        "ruleText": "Unlike basic lands and lands that have one or more basic types, nonbasic lands don't necessarily have mana abilities."
    },
    "300.4": {
        "navigation": {
            "nextRule": "300.5",
            "previousRule": "300.3"
        },
        "ruleNumber": "300.4",
        "examples": null,
        "ruleText": "When a phase ends (but not a step), any unused mana left in a player's mana pool is lost. That player loses 1 life for each one mana lost this way. This is called mana burn. Note that mana burn is loss of life, not damage, so it can't be prevented or altered by effects that affect damage. (See rule 406.1, \"Mana Abilities.\")"
    },
    "418.4": {
        "navigation": {
            "nextRule": "418.4a",
            "previousRule": "418.3d"
        },
        "ruleNumber": "418.4",
        "examples": null,
        "ruleText": "Continuous Effects from Static Abilities"
    },
    "217.9a": {
        "navigation": {
            "nextRule": "217.9b",
            "previousRule": "217.9"
        },
        "ruleNumber": "217.9a",
        "examples": null,
        "ruleText": "Earlier versions of the Magic rules included an ante rule as a way of playing \"for keeps.\" Playing Magic for ante is now considered an optional variation on the game, and it's allowed only where it's not forbidden by law or by other rules. Playing for ante is strictly forbidden under the DCI Universal Tournament Rules."
    },
    "212.2": {
        "navigation": {
            "nextRule": "212.2a",
            "previousRule": "212.1"
        },
        "ruleNumber": "212.2",
        "examples": null,
        "ruleText": "Some card types include subtypes, printed on the same line. Creature subtypes (including those of artifact creatures) appear after a dash that follows their card type(s). Enchantment subtypes consist of the word \"enchant\" and the word(s) that follows it, such as \"enchant creature\" or \"enchant artifact.\" Land subtypes are not printed on the card type line (see rule 212.2c)."
    },
    "420.4": {
        "navigation": {
            "nextRule": "420.5",
            "previousRule": "420.3"
        },
        "ruleNumber": "420.4",
        "examples": "Example: A player controls a creature with the ability \"This creature's power and toughness are each equal to the number of cards in your hand\" and plays a spell whose effect is \"Discard your hand, then draw seven cards.\" The creature will temporarily have toughness 0 in the middle of the spell's resolution but will be back up to toughness 7 when the spell finishes resolving. Thus the creature will survive when state-based effects are checked. In contrast, an ability that triggers when the player has no cards in hand goes on the stack after the spell resolves, because its trigger event happened during resolution.",
        "ruleText": "Unlike triggered abilities, state-based effects pay no attention to what happens during the resolution of a spell or ability."
    },
    "411.3a": {
        "navigation": {
            "nextRule": "412.1",
            "previousRule": "411.3"
        },
        "ruleNumber": "411.3a",
        "examples": null,
        "ruleText": "If a triggered mana ability adds mana \"of the same type\" to a player's mana pool, and the mana ability that triggered it produced more than one type of mana, the player to whose mana pool the mana is being added chooses which type of mana the triggered ability adds."
    },
    "101.5": {
        "navigation": {
            "nextRule": "102.1",
            "previousRule": "101.4"
        },
        "ruleNumber": "101.5",
        "examples": null,
        "ruleText": "A player who is dissatisfied with his or her initial hand may mulligan. That player shuffles his or her hand back into the deck, then draws a new hand of six cards. He or she may repeat this process as many times as desired, drawing one fewer card each time, until the hand size reaches zero cards. Once the first player has decided to keep a hand, the second player may mulligan. Once both players are satisfied with their hands, the first player takes his or her turn."
    },
    "409.1a": {
        "navigation": {
            "nextRule": "409.1b",
            "previousRule": "409.1"
        },
        "ruleNumber": "409.1a",
        "examples": null,
        "ruleText": "The player announces that he or she is playing the spell or ability. It goes on the stack and remains there until it's countered or resolves. Spell cards are physically placed on the stack. For abilities, a pseudospell with the text of the ability goes on the stack. All other characteristics of the pseudospell depend on the characteristics of the ability's source. For example, such a pseudospell's color would be continuously determined by the color of its source, not just the source's color when the pseudospell went on the stack."
    },
    "102.1": {
        "navigation": {
            "nextRule": "102.2",
            "previousRule": "101.5"
        },
        "ruleNumber": "102.1",
        "examples": null,
        "ruleText": "If a player's life total is 0 or less, he or she loses the game the next time a player would receive priority. (This is a state-based effect. See rule 420.)"
    },
    "217.7": {
        "navigation": {
            "nextRule": "217.7a",
            "previousRule": "217.6c"
        },
        "ruleNumber": "217.7",
        "examples": null,
        "ruleText": "Removed from the Game"
    },
    "415.2a": {
        "navigation": {
            "nextRule": "415.2b",
            "previousRule": "415.2"
        },
        "ruleNumber": "415.2a",
        "examples": null,
        "ruleText": "Modal spells may have different targeting requirements for each mode. Changing a spell or ability's target can't change its mode."
    },
    "504.5": {
        "navigation": {
            "nextRule": "504.6",
            "previousRule": "504.4"
        },
        "ruleNumber": "504.5",
        "examples": null,
        "ruleText": "As a face-down permanent is turned face up, its initial characteristics revert to its normal initial characteristics. Any effects that have been applied to the face-down permanent still apply to the face-up permanent. Any abilities relating to the permanent coming into play don't trigger and don't have any effect, because the permanent has already come into play."
    },
    "502.26a": {
        "navigation": {
            "nextRule": "502.26b",
            "previousRule": "502.26"
        },
        "ruleNumber": "502.26a",
        "examples": null,
        "ruleText": "Morph is a static ability that functions any time you could play the card it's on, and the morph effect works any time the card is face down. The phrase \"Morph [cost]\" means \"You may play this card as a 2/2 face-down creature, with no text, no name, no subtypes, no expansion symbol, and a mana cost of 0 by paying 3 rather than its mana cost.\" Any time you could play an instant, you may show all players the morph cost for any face-down permanent you control, pay that cost, then turn the permanent face up. This action does not use the stack."
    },
    "102.3": {
        "navigation": {
            "nextRule": "102.4",
            "previousRule": "102.2"
        },
        "ruleNumber": "102.3",
        "examples": null,
        "ruleText": "A game immediately ends when either these rules or a card effect states that a player loses or wins."
    },
    "502.27a": {
        "navigation": {
            "nextRule": "502.27b",
            "previousRule": "502.27"
        },
        "ruleNumber": "502.27a",
        "examples": null,
        "ruleText": "Amplify is a static ability. \"Amplify [X]\" means \"As this card comes into play, reveal any number of cards from your hand that share a creature type with this card. This card comes into play with X +1/+1 counters on it for each card revealed this way. You can't reveal this card or any other cards that are coming into play at the same time as this card.\""
    },
    "413.2a": {
        "navigation": {
            "nextRule": "413.2b",
            "previousRule": "413.2"
        },
        "ruleNumber": "413.2a",
        "examples": null,
        "ruleText": "If the spell or ability specifies targets, it checks whether the targets are still legal. A target that's removed from play, or from the zone designated by the spell or ability, is illegal. A target may also become illegal if its characteristics changed since the spell or ability was played or if an effect changed the wording of the spell or ability. If all targets are now illegal, the spell or ability is countered. If the spell or ability is not countered it will resolve normally, affecting only the targets that are still legal. If a target is illegal, the spell or ability can't perform any actions on it or make the target perform any actions. If the spell or ability needs to know information about one or more targets that are now illegal, it will use the illegal targets' current or last known information."
    },
    "216.2": {
        "navigation": {
            "nextRule": "216.3",
            "previousRule": "216.1"
        },
        "ruleNumber": "216.2",
        "examples": null,
        "ruleText": "A token is subject to anything that affects permanents in general or that affects the token's type or subtype. A token isn't considered a card (even if represented by cards from other games or Unglued cards) and isn't subject to any effect that specifically uses the word \"card.\""
    },
    "217.2a": {
        "navigation": {
            "nextRule": "217.2b",
            "previousRule": "217.2"
        },
        "ruleNumber": "217.2a",
        "examples": null,
        "ruleText": "When a game begins, each player's deck becomes his or her library."
    },
    "422.2": {
        "navigation": {
            "nextRule": "500.1",
            "previousRule": "422.1"
        },
        "ruleNumber": "422.2",
        "examples": null,
        "ruleText": "When reversing illegal spells and abilities, the player who had priority retains it and may take another action or pass. The player may redo the reversed action in a legal way or take any other action allowed by the rules."
    },
    "421.1": {
        "navigation": {
            "nextRule": "421.2",
            "previousRule": "420.5j"
        },
        "ruleNumber": "421.1",
        "examples": null,
        "ruleText": "Occasionally the game can get into a state in which a set of actions could be repeated forever. The \"infinity rule\" governs how to break such loops."
    },
    "502.17c": {
        "navigation": {
            "nextRule": "502.18",
            "previousRule": "502.17b"
        },
        "ruleNumber": "502.17c",
        "examples": null,
        "ruleText": "Multiple instances of horsemanship on the same creature are redundant."
    },
    "403.3": {
        "navigation": {
            "nextRule": "404.1",
            "previousRule": "403.2"
        },
        "ruleNumber": "403.3",
        "examples": null,
        "ruleText": "If an activated ability has a restriction on its use (for example, \"Play this ability only once each turn\"), the restriction continues to apply to that permanent even if its controller changes."
    },
    "418.3b": {
        "navigation": {
            "nextRule": "418.3c",
            "previousRule": "418.3a"
        },
        "ruleNumber": "418.3b",
        "examples": "Example: An effect that reads \"All white creatures get +1/+1 until end of turn\" gives the bonus to all permanents that are white creatures when the spell or ability resolves-even if they change color later-and doesn't affect those that come into play or turn white afterward.\nExample: An effect that reads \"Prevent all damage creatures would deal this turn\" doesn't modify any card's or permanent's characteristics, so it's modifying the rules of the game. That means the effect will apply even to creatures that weren't in play when the continuous effect began. It also affects permanents that become creatures later in the turn.",
        "ruleText": "Continuous effects from spells, activated abilities, and triggered abilities that modify the characteristics or change the controller of one or more cards and/or permanents don't affect cards and/or permanents that weren't affected when the continuous effect began. Note that these work differently than continuous effects from static abilities. Continuous effects that don't modify characteristics or change the controller of cards and/or permanents modify the rules of the game, so they can affect cards and/or permanents that weren't affected when the continuous effect began."
    },
    "408.2a": {
        "navigation": {
            "nextRule": "408.2b",
            "previousRule": "408.2"
        },
        "ruleNumber": "408.2a",
        "examples": null,
        "ruleText": "Effects don't go on the stack; they're the result of spells and abilities resolving. Effects may create delayed triggered abilities, however, and these may go on the stack when they trigger. (See rule 406.2, \"Delayed Triggered Abilities.\")"
    },
    "419.6": {
        "navigation": {
            "nextRule": "419.6a",
            "previousRule": "419.5"
        },
        "ruleNumber": "419.6",
        "examples": null,
        "ruleText": "Replacement Effects"
    },
    "502.10a": {
        "navigation": {
            "nextRule": "502.10b",
            "previousRule": "502.10"
        },
        "ruleNumber": "502.10a",
        "examples": null,
        "ruleText": "Banding is a static ability that modifies the rules for declaring attackers, declaring blockers, and assigning combat damage."
    },
    "502.6d": {
        "navigation": {
            "nextRule": "502.6e",
            "previousRule": "502.6c"
        },
        "ruleNumber": "502.6d",
        "examples": "Example: If a player controls a snow-covered forest, that player can't block an attacking creature with snow-covered forestwalk even if he or she also controls a creature with snow-covered forestwalk.",
        "ruleText": "Landwalk or snow-covered landwalk abilities don't \"cancel\" one another."
    },
    "502.3a": {
        "navigation": {
            "nextRule": "502.3b",
            "previousRule": "502.3"
        },
        "ruleNumber": "502.3a",
        "examples": null,
        "ruleText": "Flanking is a triggered ability that triggers during the declare blockers step."
    },
    "502.15i": {
        "navigation": {
            "nextRule": "502.15j",
            "previousRule": "502.15h"
        },
        "ruleNumber": "502.15i",
        "examples": null,
        "ruleText": "When a permanent phases out, any local enchantments attached to that permanent phase out at the same time. This alternate way of phasing out is known as phasing out \"indirectly.\" An enchantment that phased out indirectly won't phase in by itself, but instead phases in along with the card it's attached to."
    },
    "217.5d": {
        "navigation": {
            "nextRule": "217.6",
            "previousRule": "217.5c"
        },
        "ruleNumber": "217.5d",
        "examples": null,
        "ruleText": "A card not in the in-play zone isn't \"in play\" and isn't considered tapped or untapped. Cards that aren't either in play or on the stack aren't controlled by either player."
    },
    "410.9a": {
        "navigation": {
            "nextRule": "410.9b",
            "previousRule": "410.9"
        },
        "ruleNumber": "410.9a",
        "examples": null,
        "ruleText": "An ability that reads \"Whenever [this creature] blocks\" or \"Whenever [this creature] becomes blocked\" triggers only once each combat for that creature, even if it blocks or is blocked by multiple creatures. An effect that causes the creature to become blocked (if the creature wasn't already blocked) will also trigger such abilities."
    },
    "217.5a": {
        "navigation": {
            "nextRule": "217.5b",
            "previousRule": "217.5"
        },
        "ruleNumber": "217.5a",
        "examples": null,
        "ruleText": "Most of the area between the players represents the in-play zone. The in-play zone starts out empty. Permanents a player controls (other than local enchantments enchanting the other player's permanents) are kept in front of him or her."
    },
    "502.18a": {
        "navigation": {
            "nextRule": "502.18b",
            "previousRule": "502.18"
        },
        "ruleNumber": "502.18a",
        "examples": null,
        "ruleText": "Cycling is an activated ability that functions only while the card with cycling is in a player's hand. The phrase \"Cycling [cost]\" means \"[Cost], Discard this card from your hand: Draw a card.\""
    },
    "208.1": {
        "navigation": {
            "nextRule": "208.2",
            "previousRule": "207.2"
        },
        "ruleNumber": "208.1",
        "examples": null,
        "ruleText": "A creature card has two numbers separated by a slash printed on its lower right corner. The first number is the creature's power (the amount of damage it deals in combat); the second is its toughness (the amount of damage needed to destroy it). For example, 2/3 means the creature has power 2 and toughness 3. Power and toughness can be modified or set to particular values by effects."
    },
    "420.5f": {
        "navigation": {
            "nextRule": "420.5g",
            "previousRule": "420.5e"
        },
        "ruleNumber": "420.5f",
        "examples": null,
        "ruleText": "A token in a zone other than the in-play zone ceases to exist."
    },
    "502.19a": {
        "navigation": {
            "nextRule": "502.20",
            "previousRule": "502.19"
        },
        "ruleNumber": "502.19a",
        "examples": null,
        "ruleText": "Echo is a triggered ability. \"Echo\" means \"At the beginning of your upkeep, if this permanent came under your control since the beginning of your last upkeep, sacrifice it unless you pay its mana cost.\""
    },
    "419.7": {
        "navigation": {
            "nextRule": "419.7a",
            "previousRule": "419.6d"
        },
        "ruleNumber": "419.7",
        "examples": null,
        "ruleText": "Prevention Effects"
    },
    "502.29": {
        "navigation": {
            "nextRule": "502.29a",
            "previousRule": "502.28e"
        },
        "ruleNumber": "502.29",
        "examples": null,
        "ruleText": "Provoke"
    },
    "212.1": {
        "navigation": {
            "nextRule": "212.2",
            "previousRule": "211.1"
        },
        "ruleNumber": "212.1",
        "examples": null,
        "ruleText": "All cards have one or more card types: artifact, creature, enchantment, instant, land, or sorcery. Only one multiple type-artifact creature-currently exists. The artifact creature type satisfies the criteria for any effect that applies to an artifact card or a creature card. A card's type appears below its illustration."
    },
    "410.6": {
        "navigation": {
            "nextRule": "410.7",
            "previousRule": "410.5"
        },
        "ruleNumber": "410.6",
        "examples": "Example: A permanent has an ability whose trigger condition reads, \"Whenever a land is put into a graveyard from play, . . . .\" If someone plays a spell that destroys all lands, the ability will trigger once for each land put into the graveyard during the spell's resolution.",
        "ruleText": "An ability triggers only once each time its trigger event occurs. However, it can trigger repeatedly if one event contains multiple occurrences. See also rule 410.9."
    },
    "420.5h": {
        "navigation": {
            "nextRule": "420.5i",
            "previousRule": "420.5g"
        },
        "ruleNumber": "420.5h",
        "examples": null,
        "ruleText": "A player with ten or more poison counters loses the game."
    },
    "502.12b": {
        "navigation": {
            "nextRule": "502.12c",
            "previousRule": "502.12a"
        },
        "ruleNumber": "502.12b",
        "examples": null,
        "ruleText": "The rampage bonus is calculated only once per combat, when the triggered ability resolves. Adding or removing blockers later in combat won't change the bonus."
    },
    "420.5d": {
        "navigation": {
            "nextRule": "420.5e",
            "previousRule": "420.5c"
        },
        "ruleNumber": "420.5d",
        "examples": null,
        "ruleText": "A local enchantment that enchants an illegal or nonexistent permanent is put into its owner's graveyard."
    },
    "505.1": {
        "navigation": {
            "nextRule": "505.2",
            "previousRule": "504.6"
        },
        "ruleNumber": "505.1",
        "examples": null,
        "ruleText": "Split cards have two card faces on a single card. The back of a split card is the normal Magic: The Gathering card back."
    },
    "502.8c": {
        "navigation": {
            "nextRule": "502.9",
            "previousRule": "502.8b"
        },
        "ruleNumber": "502.8c",
        "examples": null,
        "ruleText": "Multiple instances of shadow on the same creature are redundant."
    },
    "408.2e": {
        "navigation": {
            "nextRule": "408.2f",
            "previousRule": "408.2d"
        },
        "ruleNumber": "408.2e",
        "examples": null,
        "ruleText": "Mana abilities resolve immediately. If a mana ability produces both mana and another effect, both the mana and the other effect resolve immediately. If a player had priority before a mana ability was played, that player still has priority after it resolves. (See rule 406.1, \"Mana Abilities.\")"
    },
    "502.2c": {
        "navigation": {
            "nextRule": "502.2d",
            "previousRule": "502.2b"
        },
        "ruleNumber": "502.2c",
        "examples": null,
        "ruleText": "Adding or removing first strike after the first combat damage step won't prevent a creature from dealing combat damage or allow it to deal combat damage twice."
    },
    "100.4": {
        "navigation": {
            "nextRule": "100.5",
            "previousRule": "100.3"
        },
        "ruleNumber": "100.4",
        "examples": null,
        "ruleText": "There is no maximum deck size."
    },
    "300.1": {
        "navigation": {
            "nextRule": "300.2",
            "previousRule": "217.9c"
        },
        "ruleNumber": "300.1",
        "examples": null,
        "ruleText": "A turn consists of five phases, in this order: beginning, first main, combat, second main, and end. Each of these phases takes place every turn, even if nothing happens during the phase. The beginning, combat, and end phases are further broken down into steps, which proceed in order."
    },
    "217.6": {
        "navigation": {
            "nextRule": "217.6a",
            "previousRule": "217.5d"
        },
        "ruleNumber": "217.6",
        "examples": null,
        "ruleText": "Stack"
    },
    "309.4a": {
        "navigation": {
            "nextRule": "309.5",
            "previousRule": "309.4"
        },
        "ruleNumber": "309.4a",
        "examples": null,
        "ruleText": "A creature is considered blocking alone if it's the sole creature declared as a blocker in a given combat phase."
    },
    "214.9d": {
        "navigation": {
            "nextRule": "214.9e",
            "previousRule": "214.9c"
        },
        "ruleNumber": "214.9d",
        "examples": "Example: Taiga is a land with the following text in its text box: \"Taiga is a mountain and a forest in addition to its type.\" Even though Taiga has two basic land types, it's not a basic land, because (a) its name doesn't match a basic land type word, and (b) it doesn't specify that it's basic.",
        "ruleText": "The basic land types are plains, island, swamp, mountain, and forest. A land with one of these words as its name is a basic land. Other lands can state that they are lands of one or more basic land types. A land that has one or more basic land types is not necessarily a basic land. Moreover, the name of a land with a single land type that's basic becomes that basic land-type word."
    },
    "217.2": {
        "navigation": {
            "nextRule": "217.2a",
            "previousRule": "217.1d"
        },
        "ruleNumber": "217.2",
        "examples": null,
        "ruleText": "Library"
    },
    "421.5": {
        "navigation": {
            "nextRule": "422.1",
            "previousRule": "421.4"
        },
        "ruleNumber": "421.5",
        "examples": null,
        "ruleText": "If the loop contains at least one optional action controlled by each player and these actions don't depend on one another, the active player chooses a number. The nonactive player can either agree to that number or choose a higher number. Note that this rule applies even if the actions could exist in separate loops rather than in a single loop."
    },
    "214.8b": {
        "navigation": {
            "nextRule": "214.8c",
            "previousRule": "214.8a"
        },
        "ruleNumber": "214.8b",
        "examples": null,
        "ruleText": "A global enchantment is put into play on the side of the player who controlled the spell that created it, like any other spell that creates a permanent."
    },
    "407.2": {
        "navigation": {
            "nextRule": "407.3",
            "previousRule": "407.1"
        },
        "ruleNumber": "407.2",
        "examples": "Example: An effect reads, \"Enchanted creature has 'This creature is an artifact. It's still a creature.'\" This effect grants an ability to the creature that can be removed by other effects. Another effect reads, \"Enchanted creature is an artifact. It's still a creature.\" This effect simply defines a characteristic of the creature. It doesn't grant an ability, so effects that would cause the creature to lose its abilities wouldn't cause the enchanted creature to stop being an artifact.",
        "ruleText": "A permanent's characteristic set by an effect is different from an ability granted by an effect. When a permanent \"gains\" or \"has\" an ability, it can be removed by another effect. If an effect defines a characteristic of the permanent (\"[permanent] is [characteristic]\"), it's not granting an ability. (See also rule 402.3.)"
    },
    "314.1b": {
        "navigation": {
            "nextRule": "314.1c",
            "previousRule": "314.1a"
        },
        "ruleNumber": "314.1b",
        "examples": null,
        "ruleText": "Then, simultaneously, all damage is removed from permanents and all \"until end of turn\" and \"this turn\" effects end. This action doesn't go on the stack."
    },
    "409.1g": {
        "navigation": {
            "nextRule": "409.2",
            "previousRule": "409.1f"
        },
        "ruleNumber": "409.1g",
        "examples": null,
        "ruleText": "Once the steps described in 409.1a-409.1f are completed, the spell or ability becomes played. Its controller gains priority."
    },
    "302.3": {
        "navigation": {
            "nextRule": "303.1",
            "previousRule": "302.2"
        },
        "ruleNumber": "302.3",
        "examples": null,
        "ruleText": "Before a player untaps his or her permanents, all permanents with phasing that player controls phase out, and all permanents that player controlled when they phased out simultaneously phase in. (See rule 217.8, \"Phased-Out,\" and rule 502.15, \"Phasing.\")"
    },
    "203.4": {
        "navigation": {
            "nextRule": "204.1",
            "previousRule": "203.3"
        },
        "ruleNumber": "203.4",
        "examples": null,
        "ruleText": "Any additional cost listed in a card's rules text isn't part of the mana cost. (See rule 409, \"Playing Spells and Activated Abilities.\") Such costs are paid at the same time as the spell's other costs."
    },
    "418.4a": {
        "navigation": {
            "nextRule": "418.4b",
            "previousRule": "418.4"
        },
        "ruleNumber": "418.4a",
        "examples": null,
        "ruleText": "A continuous effect generated by a static ability isn't \"locked in\"; it applies at any given moment to whatever its text indicates."
    },
    "308.3": {
        "navigation": {
            "nextRule": "308.4",
            "previousRule": "308.2"
        },
        "ruleNumber": "308.3",
        "examples": null,
        "ruleText": "If the proposed attack isn't legal or the active player can't pay all required costs, all actions described in rules 308.1 and 308.2 are canceled. Then the active player redeclares which creatures will attack. (See rule 422, \"Handling Illegal Actions.\")"
    },
    "410.5": {
        "navigation": {
            "nextRule": "410.6",
            "previousRule": "410.4"
        },
        "ruleNumber": "410.5",
        "examples": null,
        "ruleText": "Some triggered abilities' effects are optional (they contain \"may,\" as in \"At the beginning of your upkeep, you may draw a card\"). These abilities go on the stack when they trigger, regardless of whether their controller intends to exercise the ability's option or not. (The choice is made when the ability resolves.) Likewise, triggered abilities that have an effect \"unless\" something is true or a player chooses to do something will go on the stack normally; the \"unless\" part of the ability is dealt with when the ability resolves."
    },
    "309.2": {
        "navigation": {
            "nextRule": "309.3",
            "previousRule": "309.1"
        },
        "ruleNumber": "309.2",
        "examples": null,
        "ruleText": "The defending player determines whether the block is legal. (See section 5, \"Additional Rules.\") If it is, he or she pays all required costs. A player may play mana abilities at this time only if a blocking cost that player could pay includes a mana payment."
    },
    "502.10b": {
        "navigation": {
            "nextRule": "502.10c",
            "previousRule": "502.10a"
        },
        "ruleNumber": "502.10b",
        "examples": null,
        "ruleText": "As a player declares attackers, he or she may declare that any number of those creatures with banding, and up to one of those creatures without banding, are all in a \"band.\" (Defending players can't declare bands but may use banding in a different way; see rule 502.10h.)"
    },
    "420.5": {
        "navigation": {
            "nextRule": "420.5a",
            "previousRule": "420.4"
        },
        "ruleNumber": "420.5",
        "examples": null,
        "ruleText": "The state-based effects are as follows:"
    },
    "310.1c": {
        "navigation": {
            "nextRule": "310.1d",
            "previousRule": "310.1b"
        },
        "ruleNumber": "310.1c",
        "examples": null,
        "ruleText": "A blocked creature will assign combat damage, divided as its controller chooses, to the creatures blocking it. If no creatures are currently blocking it (if, for example, they were destroyed or removed from combat), it will assign no combat damage."
    },
    "406.1a": {
        "navigation": {
            "nextRule": "406.1b",
            "previousRule": "406.1"
        },
        "ruleNumber": "406.1a",
        "examples": null,
        "ruleText": "A mana ability is either (a) an activated ability that puts mana into a player's mana pool when it resolves or (b) a triggered ability that triggers from an activated mana ability and produces additional mana. A mana ability can generate other effects at the same time it produces mana."
    },
    "419.6b": {
        "navigation": {
            "nextRule": "419.6c",
            "previousRule": "419.6a"
        },
        "ruleNumber": "419.6b",
        "examples": null,
        "ruleText": "Regeneration is a destruction-replacement effect. The key word \"instead\" doesn't appear on the card but is implicit in its definition. \"Regenerate [permanent]\" means \"The next time [permanent] would be destroyed this turn, instead remove all damage from it, tap it, and (if it's in combat) remove it from combat.\" Note that if destruction is caused by lethal damage, any abilities that trigger from that damage being dealt still trigger even if the permanent regenerates."
    },
    "300.3": {
        "navigation": {
            "nextRule": "300.4",
            "previousRule": "300.2"
        },
        "ruleNumber": "300.3",
        "examples": null,
        "ruleText": "When a phase or step ends, any effects scheduled to last \"until end of\" that phase or step expire. When a phase or step begins, any effects scheduled to last \"until\" that phase or step expire. Effects that last \"until end of combat\" expire at the end of the combat phase, not at the beginning of the end of combat step. Effects that last \"until end of turn\" are subject to special rules; see rule 314.1b."
    },
    "502.12": {
        "navigation": {
            "nextRule": "502.12a",
            "previousRule": "502.11c"
        },
        "ruleNumber": "502.12",
        "examples": null,
        "ruleText": "Rampage"
    },
    "203.1": {
        "navigation": {
            "nextRule": "203.2",
            "previousRule": "202.3"
        },
        "ruleNumber": "203.1",
        "examples": null,
        "ruleText": "The mana cost of a card is indicated by mana symbols printed on its upper right corner. Tokens and lands have a mana cost of 0. Paying a card's mana cost requires matching the color of any colored mana symbols as well as paying the generic mana cost indicated."
    },
    "214.9": {
        "navigation": {
            "nextRule": "214.9a",
            "previousRule": "214.8k"
        },
        "ruleNumber": "214.9",
        "examples": null,
        "ruleText": "Lands"
    },
    "214.1": {
        "navigation": {
            "nextRule": "214.2",
            "previousRule": "213.2"
        },
        "ruleNumber": "214.1",
        "examples": null,
        "ruleText": "A permanent is a card or token in play. Permanents stay in play unless moved to another zone by an effect or rule. There are four types of permanents: artifacts, creatures, enchantments, and lands. Instant and sorcery cards can't come into play."
    },
    "408.1f": {
        "navigation": {
            "nextRule": "408.1g",
            "previousRule": "408.1e"
        },
        "ruleNumber": "408.1f",
        "examples": null,
        "ruleText": "Triggered abilities can trigger at any time, including during the playing or resolution of a spell or another ability. However, nothing actually happens at the time the abilities trigger. Each time a player would receive priority, a pseudospell goes on the stack for each ability that has triggered but that hasn't yet been put on the stack. Then the player gets priority and may play spells or abilities. (See rule 410, \"Handling Triggered Abilities.\")"
    },
    "502.9e": {
        "navigation": {
            "nextRule": "502.9f",
            "previousRule": "502.9d"
        },
        "ruleNumber": "502.9e",
        "examples": null,
        "ruleText": "Assigning damage from a creature with trample considers only the actual toughness of a blocking creature, not any abilities or effects that might change the final amount of damage dealt."
    },
    "501.1": {
        "navigation": {
            "nextRule": "501.2",
            "previousRule": "500.5"
        },
        "ruleNumber": "501.1",
        "examples": null,
        "ruleText": "Evasion abilities restrict what can block an attacking creature. These are static abilities that modify the declare blockers step of combat."
    },
    "413.2i": {
        "navigation": {
            "nextRule": "414.1",
            "previousRule": "413.2h"
        },
        "ruleNumber": "413.2i",
        "examples": null,
        "ruleText": "If an effect could result in a tie, the text of the spell or ability that created the effect will specify what to do in the event of a tie. The Magic game has no default for ties."
    },
    "502.21": {
        "navigation": {
            "nextRule": "502.21a",
            "previousRule": "502.20a"
        },
        "ruleNumber": "502.21",
        "examples": null,
        "ruleText": "Kicker"
    },
    "214.8e": {
        "navigation": {
            "nextRule": "214.8f",
            "previousRule": "214.8d"
        },
        "ruleNumber": "214.8e",
        "examples": null,
        "ruleText": "If a local enchantment is enchanting an illegal permanent or the permanent it was attached to no longer exists, the enchantment card is put into its owner's graveyard. (This is a state-based effect. See rule 420.)"
    },
    "406.2c": {
        "navigation": {
            "nextRule": "406.2d",
            "previousRule": "406.2b"
        },
        "ruleNumber": "406.2c",
        "examples": "Example: An ability reading, \"At end of turn, destroy that creature\" will destroy the permanent even if it's no longer a creature during the end of turn step.",
        "ruleText": "A delayed ability that refers to a particular permanent still affects it even if the permanent changes characteristics."
    },
    "410.10c": {
        "navigation": {
            "nextRule": "410.10d",
            "previousRule": "410.10b"
        },
        "ruleNumber": "410.10c",
        "examples": null,
        "ruleText": "Leaves-play abilities trigger when a permanent leaves the in-play zone. These are written as, but aren't limited to, \"Whenever [this card] leaves play, . . .\" or \"Whenever [permanent type] is put into a graveyard from play, . . . .\" An ability that attempts to do something to the card that left play checks for it only in the first zone that it went to."
    },
    "214.7b": {
        "navigation": {
            "nextRule": "214.7c",
            "previousRule": "214.7a"
        },
        "ruleNumber": "214.7b",
        "examples": null,
        "ruleText": "Use the Oracle™ card reference when determining creature types. It can be found at www.wizards.com/dci/main.asp?x=oracle."
    },
    "310.4": {
        "navigation": {
            "nextRule": "311.1",
            "previousRule": "310.3"
        },
        "ruleNumber": "310.4",
        "examples": null,
        "ruleText": "Combat damage resolves as though it were a pseudospell. When it resolves, it's dealt as originally assigned. This happens even if the creature dealing damage is no longer in play, its power has changed, or the creature receiving damage has left combat. (Note that the source of the damage is the creature as it currently exists, or as it most recently existed if it is no longer in play.) If a creature that was supposed to receive damage is no longer in play or is no longer a creature, the damage assigned to it isn't dealt. After combat damage finishes resolving, the active player gets priority."
    },
    "312.1": {
        "navigation": {
            "nextRule": "313.1",
            "previousRule": "311.1"
        },
        "ruleNumber": "312.1",
        "examples": null,
        "ruleText": "The end phase consists of two steps: end of turn and cleanup."
    }
}