[
    {
        "names": {
            "old_setcode": "CMA",
            "new_setcode": "HOU",
            "old_full": "Commander Anthology",
            "new_full": "Hour of Devastation"
        }
    },
    {
        "new": {
            "ruleNum": "107.1b",
            "ruleText": "Most of the time, the Magic game uses only positive numbers and zero. You can’t choose a negative number, deal negative damage, gain negative life, and so on. However, it’s possible for a game value, such as a creature’s power, to be less than zero. If a calculation or comparison needs to use a negative value, it does so. If a calculation that would determine the result of an effect yields a negative number, zero is used instead, unless that effect sets a player’s life total to a specific value, doubles a player’s life total, new_start or new_end sets a creature’s power or toughness to a specific new_start value. new_end"
        },
        "old": {
            "ruleNum": "107.1b",
            "ruleText": "Most of the time, the Magic game uses only positive numbers and zero. You can’t choose a negative number, deal negative damage, gain negative life, and so on. However, it’s possible for a game value, such as a creature’s power, to be less than zero. If a calculation or comparison needs to use a negative value, it does so. If a calculation that would determine the result of an effect yields a negative number, zero is used instead, unless that effect sets a player’s life total to a specific value, doubles a player’s life total, sets a creature’s power or toughness to a specific old_start value, or otherwise modifies a creature’s power or toughness. old_end"
        }
    },
    {
        "new": {
            "ruleNum": "205.3j",
            "ruleText": "Planeswalkers have their own unique set of subtypes; these subtypes are called planeswalker types. The planeswalker types are Ajani, Arlinn, Ashiok, Bolas, Chandra, Dack, Daretti, Domri, Dovin, Elspeth, Freyalise, Garruk, Gideon, Jace, Karn, Kaya, Kiora, Koth, Liliana, Nahiri, Narset, Nissa, Nixilis, Ral, Saheeli, new_start Samut, new_end Sarkhan, Sorin, Tamiyo, Teferi, Tezzeret, Tibalt, Ugin, Venser, Vraska, and Xenagos. If a player controls two or more planeswalkers that share a planeswalker type, that player chooses one of them, and the rest are put into their owners’ graveyards. This “planeswalker uniqueness rule” is a state–based action. See rule 704."
        },
        "old": {
            "ruleNum": "205.3j",
            "ruleText": "Planeswalkers have their own unique set of subtypes; these subtypes are called planeswalker types. The planeswalker types are Ajani, Arlinn, Ashiok, Bolas, Chandra, Dack, Daretti, Domri, Dovin, Elspeth, Freyalise, Garruk, Gideon, Jace, Karn, Kaya, Kiora, Koth, Liliana, Nahiri, Narset, Nissa, Nixilis, Ral, Saheeli, Sarkhan, Sorin, Tamiyo, Teferi, Tezzeret, Tibalt, Ugin, Venser, Vraska, and Xenagos. If a player controls two or more planeswalkers that share a planeswalker type, that player chooses one of them, and the rest are put into their owners’ graveyards. This “planeswalker uniqueness rule” is a state–based action. See rule 704."
        }
    },
    {
        "new": {
            "ruleNum": "508.3b",
            "ruleText": "A creature that’s put onto the battlefield new_start attacking new_end isn’t affected by requirements or restrictions that apply to the declaration of new_start attackers. new_end"
        },
        "old": {
            "ruleNum": "509.7b",
            "ruleText": "A creature that’s put onto the battlefield old_start blocking old_end isn’t affected by requirements or restrictions that apply to the declaration of old_start blockers. old_end"
        }
    },
    {
        "new": {
            "ruleNum": "509.7b",
            "ruleText": "A creature that’s put onto the battlefield new_start blocking new_end isn’t affected by requirements or restrictions that apply to the declaration of new_start blockers. new_end"
        },
        "old": {
            "ruleNum": "508.3b",
            "ruleText": "A creature that’s put onto the battlefield old_start attacking old_end isn’t affected by requirements or restrictions that apply to the declaration of old_start attackers. old_end"
        }
    },
    {
        "new": {
            "ruleNum": "615.9",
            "ruleText": "Some effects generated by the resolution of a spell or ability prevent damage from a source of a player’s choice with certain properties. When the source would deal damage, the shield rechecks the source’s properties. If the properties no longer match, the damage isn’t prevented or replaced and the shield isn’t used up. See rule 609.7b."
        },
        "old": null
    },
    {
        "new": {
            "ruleNum": "702.128a",
            "ruleText": "Eternalize is an activated ability that functions while the card with eternalize is in a graveyard. “Eternalize [cost]” means “[Cost], Exile this card from your graveyard: Create a token that’s a copy of this card, except it’s black, it’s 4/4, it has no mana cost, and it’s a Zombie in addition to its other types. Activate this ability only any time you could cast a sorcery.”"
        },
        "old": null
    },
    {
        "new": {
            "ruleNum": "702.129a",
            "ruleText": "Afflict is a triggered ability. “Afflict N” means “Whenever this creature becomes blocked, defending player loses N life.”"
        },
        "old": null
    },
    {
        "new": {
            "ruleNum": "702.129b",
            "ruleText": "If a creature has multiple instances of afflict, each triggers separately."
        },
        "old": null
    },
    {
        "new": {
            "ruleNum": "715.1b",
            "ruleText": "Exile every object on the stack, including the object that’s resolving. Remove all creatures and planeswalkers from combat. All objects not on the battlefield or in the command zone that aren’t represented by cards will cease to exist the next time state–based actions are checked (see rule 704, “State–Based Actions”)."
        },
        "old": {
            "ruleNum": "715.1b",
            "ruleText": "Exile every object on the stack, including the object that’s resolving. Remove all creatures and planeswalkers old_start (including those that are phased out) old_end from combat. All objects not on the battlefield or in the command zone that aren’t represented by cards will cease to exist the next time state–based actions are checked (see rule 704, “State–Based Actions”)."
        }
    },
    {
        "new": {
            "ruleNum": "805.8",
            "ruleText": "If an effect gives a player an extra turn or adds a phase or step to that player’s turn, that player’s team takes the extra turn, phase, or step. If an effect causes a player to skip a step, phase, or turn, that player’s team does so. If a single effect causes more than one player on the same team to add or skip the same step, phase, or turn, that team adds or skips only that step, phase, or turn. If an effect causes a player to control another player, the new_start first player new_end controls the affected player’s team."
        },
        "old": {
            "ruleNum": "805.8",
            "ruleText": "If an effect gives a player an extra turn or adds a phase or step to that player’s turn, that player’s team takes the extra turn, phase, or step. If an effect causes a player to skip a step, phase, or turn, that player’s team does so. If a single effect causes more than one player on the same team to add or skip the same step, phase, or turn, that team adds or skips only that step, phase, or turn. If an effect causes a player to control another player, the old_start controller of that effect old_end controls the affected player’s team."
        }
    },
    {
        "new": {
            "ruleNum": "805.10d",
            "ruleText": "As the declare blockers step begins, the defending team declares blockers. Creatures controlled by the defending players can block creatures attacking any player on the defending new_start team or attacking a planeswalker controlled by one of those players. new_end The defending team has one combined block, and that set of blocking creatures must be legal as a whole. See rule 509.1."
        },
        "old": {
            "ruleNum": "805.10d",
            "ruleText": "As the declare blockers step begins, the defending team declares blockers. Creatures controlled by the defending players can block creatures attacking any player on the defending old_start team. old_end The defending team has one combined block, and that set of blocking creatures must be legal as a whole. See rule 509.1."
        }
    }
]