[
    {
        "names": {
            "old_full": "Kaldheim",
            "new_full": "Strixhaven",
            "new_setcode": "STX",
            "old_setcode": "KHM"
        }
    },
    {
        "old": {
            "ruleText": "If old_start an effect instructs old_end more than one player to draw cards, the active player performs all of their draws first, then each other player in turn order does the same.",
            "ruleNum": "121.2c"
        },
        "new": {
            "ruleText": "If more than one player new_start is instructed new_end to draw cards, the active player performs all of their draws first, then each other player in turn order does the same.",
            "ruleNum": "121.2c"
        }
    },
    {
        "old": {
            "ruleText": "If old_start a rule or effect instructs old_end more than one player to draw cards in a game that’s using the shared team turns option (such as a Two–Headed Giant game), first each player on the active team, in whatever order that team likes, performs their draws, then each player on each nonactive team in turn order does the same.",
            "ruleNum": "121.2d"
        },
        "new": {
            "ruleText": "If more than one player new_start is instructed new_end to draw cards in a game that’s using the shared team turns option (such as a Two–Headed Giant game), first each player on the active team, in whatever order that team likes, performs their draws, then each player on each nonactive team in turn order does the same.",
            "ruleNum": "121.2d"
        }
    },
    {
        "old": {
            "ruleText": "The old_start converted old_end mana old_start cost old_end of an object is a number equal to the total amount of mana in its mana cost, regardless of color.",
            "ruleNum": "202.3"
        },
        "new": {
            "ruleText": "The mana new_start value new_end of an object is a number equal to the total amount of mana in its mana cost, regardless of color.",
            "ruleNum": "202.3"
        }
    },
    {
        "old": {
            "ruleText": "The old_start converted old_end mana old_start cost old_end of an object with no mana cost is 0, unless that object is the back face of a transforming double–faced permanent or is a melded permanent.",
            "ruleNum": "202.3a"
        },
        "new": {
            "ruleText": "The mana new_start value new_end of an object with no mana cost is 0, unless that object is the back face of a transforming double–faced permanent or is a melded permanent.",
            "ruleNum": "202.3a"
        }
    },
    {
        "old": {
            "ruleText": "The old_start converted old_end mana old_start cost old_end of a transforming double–faced permanent’s back face is calculated as though it had the mana cost of its front face. If a permanent is a copy of the back face of a transforming double–faced card (even if the card representing that copy is itself a double–faced card), the old_start converted old_end mana old_start cost old_end of that permanent is 0.",
            "ruleNum": "202.3b"
        },
        "new": {
            "ruleText": "The mana new_start value new_end of a transforming double–faced permanent’s back face is calculated as though it had the mana cost of its front face. If a permanent is a copy of the back face of a transforming double–faced card (even if the card representing that copy is itself a double–faced card), the mana new_start value new_end of that permanent is 0.",
            "ruleNum": "202.3b"
        }
    },
    {
        "old": {
            "ruleText": "The old_start converted old_end mana old_start cost old_end of a melded permanent is calculated as though it had the combined mana cost of the front faces of each card that represents it. If a permanent is a copy of a melded permanent (even if that copy is represented by two other meld cards), the old_start converted old_end mana old_start cost old_end of the copy is 0.",
            "ruleNum": "202.3c"
        },
        "new": {
            "ruleText": "The mana new_start value new_end of a melded permanent is calculated as though it had the combined mana cost of the front faces of each card that represents it. If a permanent is a copy of a melded permanent (even if that copy is represented by two other meld cards), the mana new_start value new_end of the copy is 0.",
            "ruleNum": "202.3c"
        }
    },
    {
        "old": {
            "ruleText": "The old_start converted old_end mana old_start cost old_end of a split card not on the stack or of a fused split spell on the stack is determined from the combined mana costs of its halves. Otherwise, while a split card is on the stack, the old_start converted old_end mana old_start cost old_end of the spell is determined by the mana cost of the half that was chosen to be cast. See rule 708, “Split Cards.”",
            "ruleNum": "202.3d"
        },
        "new": {
            "ruleText": "The mana new_start value new_end of a split card not on the stack or of a fused split spell on the stack is determined from the combined mana costs of its halves. Otherwise, while a split card is on the stack, the mana new_start value new_end of the spell is determined by the mana cost of the half that was chosen to be cast. See rule 708, “Split Cards.”",
            "ruleNum": "202.3d"
        }
    },
    {
        "old": {
            "ruleText": "When calculating the old_start converted old_end mana old_start cost old_end of an object with an {X} in its mana cost, X is treated as 0 while the object is not on the stack, and X is treated as the number chosen for it while the object is on the stack.",
            "ruleNum": "202.3e"
        },
        "new": {
            "ruleText": "When calculating the mana new_start value new_end of an object with an {X} in its mana cost, X is treated as 0 while the object is not on the stack, and X is treated as the number chosen for it while the object is on the stack.",
            "ruleNum": "202.3e"
        }
    },
    {
        "old": {
            "ruleText": "When calculating the old_start converted old_end mana old_start cost old_end of an object with a hybrid mana symbol in its mana cost, use the largest component of each hybrid symbol.",
            "ruleNum": "202.3f"
        },
        "new": {
            "ruleText": "When calculating the mana new_start value new_end of an object with a hybrid mana symbol in its mana cost, use the largest component of each hybrid symbol.",
            "ruleNum": "202.3f"
        }
    },
    {
        "old": {
            "ruleText": "Each Phyrexian mana symbol in a card’s mana cost contributes 1 to its old_start converted old_end mana old_start cost. old_end",
            "ruleNum": "202.3g"
        },
        "new": {
            "ruleText": "Each Phyrexian mana symbol in a card’s mana cost contributes 1 to its mana new_start value. new_end",
            "ruleNum": "202.3g"
        }
    },
    {
        "old": {
            "ruleText": "Instants and sorceries share their lists of subtypes; these subtypes are called spell types. The spell types are Adventure, Arcane, and Trap.",
            "ruleNum": "205.3k"
        },
        "new": {
            "ruleText": "Instants and sorceries share their lists of subtypes; these subtypes are called spell types. The spell types are Adventure, Arcane, new_start Lesson, new_end and Trap.",
            "ruleNum": "205.3k"
        }
    },
    {
        "old": {
            "ruleText": "Creatures and tribals share their lists of subtypes; these subtypes are called creature types. The creature types are Advisor, Aetherborn, Ally, Angel, Antelope, Ape, Archer, Archon, Army, Artificer, Assassin, Assembly–Worker, Atog, Aurochs, Avatar, Azra, Badger, Barbarian, Basilisk, Bat, Bear, Beast, Beeble, Berserker, Bird, Blinkmoth, Boar, Bringer, Brushwagg, Camarid, Camel, Caribou, Carrier, Cat, Centaur, Cephalid, Chimera, Citizen, Cleric, Cockatrice, Construct, Coward, Crab, Crocodile, Cyclops, Dauthi, Demigod, Demon, Deserter, Devil, Dinosaur, Djinn, Dog, Dragon, Drake, Dreadnought, Drone, Druid, Dryad, Dwarf, Efreet, Egg, Elder, Eldrazi, Elemental, Elephant, Elf, Elk, Eye, Faerie, Ferret, Fish, Flagbearer, Fox, Frog, Fungus, Gargoyle, Germ, Giant, Gnome, Goat, Goblin, God, Golem, Gorgon, Graveborn, Gremlin, Griffin, Hag, Harpy, Hellion, Hippo, Hippogriff, Homarid, Homunculus, Horror, Horse, Human, Hydra, Hyena, Illusion, Imp, Incarnation, Insect, Jackal, Jellyfish, Juggernaut, Kavu, Kirin, Kithkin, Knight, Kobold, Kor, Kraken, Lamia, Lammasu, Leech, Leviathan, Lhurgoyf, Licid, Lizard, Manticore, Masticore, Mercenary, Merfolk, Metathran, Minion, Minotaur, Mole, Monger, Mongoose, Monk, Monkey, Moonfolk, Mouse, Mutant, Myr, Mystic, Naga, Nautilus, Nephilim, Nightmare, Nightstalker, Ninja, Noble, Noggle, Nomad, Nymph, Octopus, Ogre, Ooze, Orb, Orc, Orgg, Otter, Ouphe, Ox, Oyster, Pangolin, Peasant, Pegasus, Pentavite, Pest, Phelddagrif, Phoenix, Phyrexian, Pilot, Pincher, Pirate, Plant, Praetor, Prism, Processor, Rabbit, Rat, Rebel, Reflection, Rhino, Rigger, Rogue, Sable, Salamander, Samurai, Sand, Saproling, Satyr, Scarecrow, Scion, Scorpion, Scout, Sculpture, Serf, Serpent, Servo, Shade, Shaman, Shapeshifter, Shark, Sheep, Siren, Skeleton, Slith, Sliver, Slug, Snake, Soldier, Soltari, Spawn, Specter, Spellshaper, Sphinx, Spider, Spike, Spirit, Splinter, Sponge, Squid, Squirrel, Starfish, Surrakar, Survivor, Tentacle, Tetravite, Thalakos, Thopter, Thrull, Treefolk, Trilobite, Triskelavite, Troll, Turtle, Unicorn, Vampire, Vedalken, Viashino, Volver, Wall, Warlock, Warrior, Weird, Werewolf, Whale, Wizard, Wolf, Wolverine, Wombat, Worm, Wraith, Wurm, Yeti, Zombie, and Zubera.",
            "ruleNum": "205.3m"
        },
        "new": {
            "ruleText": "Creatures and tribals share their lists of subtypes; these subtypes are called creature types. The creature types are Advisor, Aetherborn, Ally, Angel, Antelope, Ape, Archer, Archon, Army, Artificer, Assassin, Assembly–Worker, Atog, Aurochs, Avatar, Azra, Badger, Barbarian, Basilisk, Bat, Bear, Beast, Beeble, Berserker, Bird, Blinkmoth, Boar, Bringer, Brushwagg, Camarid, Camel, Caribou, Carrier, Cat, Centaur, Cephalid, Chimera, Citizen, Cleric, Cockatrice, Construct, Coward, Crab, Crocodile, Cyclops, Dauthi, Demigod, Demon, Deserter, Devil, Dinosaur, Djinn, Dog, Dragon, Drake, Dreadnought, Drone, Druid, Dryad, Dwarf, Efreet, Egg, Elder, Eldrazi, Elemental, Elephant, Elf, Elk, Eye, Faerie, Ferret, Fish, Flagbearer, Fox, new_start Fractal, new_end Frog, Fungus, Gargoyle, Germ, Giant, Gnome, Goat, Goblin, God, Golem, Gorgon, Graveborn, Gremlin, Griffin, Hag, Harpy, Hellion, Hippo, Hippogriff, Homarid, Homunculus, Horror, Horse, Human, Hydra, Hyena, Illusion, Imp, Incarnation, new_start Inkling, new_end Insect, Jackal, Jellyfish, Juggernaut, Kavu, Kirin, Kithkin, Knight, Kobold, Kor, Kraken, Lamia, Lammasu, Leech, Leviathan, Lhurgoyf, Licid, Lizard, Manticore, Masticore, Mercenary, Merfolk, Metathran, Minion, Minotaur, Mole, Monger, Mongoose, Monk, Monkey, Moonfolk, Mouse, Mutant, Myr, Mystic, Naga, Nautilus, Nephilim, Nightmare, Nightstalker, Ninja, Noble, Noggle, Nomad, Nymph, Octopus, Ogre, Ooze, Orb, Orc, Orgg, Otter, Ouphe, Ox, Oyster, Pangolin, Peasant, Pegasus, Pentavite, Pest, Phelddagrif, Phoenix, Phyrexian, Pilot, Pincher, Pirate, Plant, Praetor, Prism, Processor, Rabbit, Rat, Rebel, Reflection, Rhino, Rigger, Rogue, Sable, Salamander, Samurai, Sand, Saproling, Satyr, Scarecrow, Scion, Scorpion, Scout, Sculpture, Serf, Serpent, Servo, Shade, Shaman, Shapeshifter, Shark, Sheep, Siren, Skeleton, Slith, Sliver, Slug, Snake, Soldier, Soltari, Spawn, Specter, Spellshaper, Sphinx, Spider, Spike, Spirit, Splinter, Sponge, Squid, Squirrel, Starfish, Surrakar, Survivor, Tentacle, Tetravite, Thalakos, Thopter, Thrull, Treefolk, Trilobite, Triskelavite, Troll, Turtle, Unicorn, Vampire, Vedalken, Viashino, Volver, Wall, Warlock, Warrior, Weird, Werewolf, Whale, Wizard, Wolf, Wolverine, Wombat, Worm, Wraith, Wurm, Yeti, Zombie, and Zubera.",
            "ruleNum": "205.3m"
        }
    },
    {
        "old": {
            "ruleText": "An ability word appears in italics at the beginning of some abilities. Ability words are similar to keywords in that they tie together cards that have similar functionality, but they have no special rules meaning and no individual entries in the Comprehensive Rules. The ability words are adamant, addendum, battalion, bloodrush, channel, chroma, cohort, constellation, converge, council’s dilemma, delirium, domain, eminence, enrage, fateful hour, ferocious, formidable, grandeur, hellbent, heroic, imprint, inspired, join forces, kinship, landfall, lieutenant, metalcraft, morbid, parley, radiance, raid, rally, revolt, spell mastery, strive, sweep, tempting offer, threshold, undergrowth, and will of the council.",
            "ruleNum": "207.2c"
        },
        "new": {
            "ruleText": "An ability word appears in italics at the beginning of some abilities. Ability words are similar to keywords in that they tie together cards that have similar functionality, but they have no special rules meaning and no individual entries in the Comprehensive Rules. The ability words are adamant, addendum, battalion, bloodrush, channel, chroma, cohort, constellation, converge, council’s dilemma, delirium, domain, eminence, enrage, fateful hour, ferocious, formidable, grandeur, hellbent, heroic, imprint, inspired, join forces, kinship, landfall, lieutenant, new_start magecraft, new_end metalcraft, morbid, parley, radiance, raid, rally, revolt, spell mastery, strive, sweep, tempting offer, threshold, undergrowth, and will of the council.",
            "ruleNum": "207.2c"
        }
    },
    {
        "old": {
            "ruleText": "If text states that a player may do something “any time they could cast an instant,” it means only that the player must have priority. The player doesn’t need to have an instant they could cast. Effects that would preclude that player from casting old_start a spell or casting old_end an instant don’t affect the player’s capability to perform that action (unless the action is actually casting old_start a spell or casting old_end an old_start instant). old_end",
            "ruleNum": "304.5"
        },
        "new": {
            "ruleText": "If text states that a player may do something “any time they could cast new_start an instant” or “only as new_end an instant,” it means only that the player must have priority. The player doesn’t need to have an instant new_start card new_end they could cast. Effects that would preclude that player from casting an instant new_start spell new_end don’t affect the player’s capability to perform that action (unless the action is actually casting an new_start instant spell). new_end",
            "ruleNum": "304.5"
        }
    },
    {
        "old": {
            "ruleText": "If a spell, ability, or effect states that a player can do something only “any time they could cast a sorcery,” it means only that the player must have priority, it must be during the main phase of their turn, and the stack must be empty. The player doesn’t need to have a sorcery they could cast. Effects that would preclude that player from casting a spell old_start or casting a sorcery old_end don’t affect the player’s capability to perform that action (unless the action is actually casting a old_start spell or casting a sorcery). old_end",
            "ruleNum": "307.5"
        },
        "new": {
            "ruleText": "If a spell, ability, or effect states that a player can do something only “any time they could cast new_start a sorcery” or “only as new_end a sorcery,” it means only that the player must have priority, it must be during the main phase of their turn, and the stack must be empty. The player doesn’t need to have a sorcery new_start card new_end they could cast. Effects that would preclude that player from casting a new_start sorcery new_end spell don’t affect the player’s capability to perform that action (unless the action is actually casting a new_start sorcery spell). new_end",
            "ruleNum": "307.5"
        }
    },
    {
        "old": {
            "ruleText": "Some effects bring cards into a game from outside of it. Those cards remain in the game until it old_start ends. old_end",
            "ruleNum": "400.11b"
        },
        "new": {
            "ruleText": "Some effects bring cards into a game from outside of it. Those cards remain in the game until it new_start ends or their owner leaves the game, whichever comes first. new_end",
            "ruleNum": "400.11b"
        }
    },
    {
        "old": {
            "ruleText": "Activated abilities that read “Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery” mean the player must follow the timing rules for casting a sorcery spell, though the ability isn’t actually a sorcery. The player doesn’t actually need to have a sorcery card that they could cast.",
            "ruleNum": "602.5d"
        },
        "new": {
            "ruleText": "Activated abilities that read “Activate only new_start as new_end a sorcery” mean the player must follow the timing rules for casting a sorcery spell, though the ability isn’t actually a sorcery. The player doesn’t actually need to have a sorcery card that they could cast.",
            "ruleNum": "602.5d"
        }
    },
    {
        "old": {
            "ruleText": "Activated abilities that read “Activate old_start this ability old_end only old_start any time you could cast old_end an instant” mean the player must follow the timing rules for casting an instant spell, though the ability isn’t actually an instant. The player doesn’t actually need to have an instant card that they could cast.",
            "ruleNum": "602.5e"
        },
        "new": {
            "ruleText": "Activated abilities that read “Activate only new_start as new_end an instant” mean the player must follow the timing rules for casting an instant spell, though the ability isn’t actually an instant. The player doesn’t actually need to have an instant card that they could cast.",
            "ruleNum": "602.5e"
        }
    },
    {
        "old": null,
        "new": {
            "ruleText": "Some older cards have printed text that reads “Activate this ability only any time you could cast an [instant or sorcery].” These cards have received errata in Oracle card reference to match the text in 602.5d or 602.5e, as appropriate.",
            "ruleNum": "602.5f"
        }
    },
    {
        "old": {
            "ruleText": "If multiple abilities have triggered since the last time a player received priority, each player, in APNAP order, puts triggered old_start abilities old_end they control on the stack in any order they choose. (See rule 101.4.) Then the game once again checks for and old_start resolves old_end state–based actions until none are performed, then abilities that triggered during this process go on the stack. This process repeats until no new state–based actions are performed and no abilities trigger. Then the appropriate player gets priority.",
            "ruleNum": "603.3b"
        },
        "new": {
            "ruleText": "If multiple abilities have triggered since the last time a player received priority, new_start the abilities are placed on the stack in a two–part process. First, new_end each player, in APNAP order, puts new_start each new_end triggered new_start ability new_end they control new_start with a trigger condition that isn’t another ability triggering new_end on the stack in any order they choose. (See rule 101.4.) new_start Second, each player, in APNAP order, puts all remaining triggered abilities they control on the stack. new_end Then the game once again checks for and new_start performs new_end state–based actions until none are performed, then abilities that triggered during this process go on the stack. This process repeats until no new state–based actions are performed and no abilities trigger. Then the appropriate player gets priority.",
            "ruleNum": "603.3b"
        }
    },
    {
        "old": {
            "ruleText": "Some activated abilities and some triggered abilities are mana abilities, which are subject to special rules. Only abilities that meet either of the following two sets of criteria are mana abilities, regardless of what other effects they may generate or what timing restrictions (such as “Activate old_start this ability old_end only old_start any time you could cast old_end an instant”) they may have.",
            "ruleNum": "605.1"
        },
        "new": {
            "ruleText": "Some activated abilities and some triggered abilities are mana abilities, which are subject to special rules. Only abilities that meet either of the following two sets of criteria are mana abilities, regardless of what other effects they may generate or what timing restrictions (such as “Activate only new_start as new_end an instant”) they may have.",
            "ruleNum": "605.1"
        }
    },
    {
        "old": {
            "ruleText": "A triggered ability is a mana ability if it meets all of the following criteria: it doesn’t require a target (see rule 115.6), it triggers from the resolution of an activated mana ability (see rule 605.1a) or from mana being added to a player’s mana pool, and it could add mana to a player’s mana pool when it resolves.",
            "ruleNum": "605.1b"
        },
        "new": {
            "ruleText": "A triggered ability is a mana ability if it meets all of the following criteria: it doesn’t require a target (see rule 115.6), it triggers from the new_start activation or new_end resolution of an activated mana ability (see rule 605.1a) or from mana being added to a player’s mana pool, and it could add mana to a player’s mana pool when it resolves.",
            "ruleNum": "605.1b"
        }
    },
    {
        "old": {
            "ruleText": "An ability printed on an old_start emblem old_end is considered to be “printed on” old_start the planeswalker old_end that old_start was the source of the ability that created that emblem old_end for these purposes.",
            "ruleNum": "607.1d"
        },
        "new": {
            "ruleText": "An ability printed on an new_start object within another ability that grants that ability to that object new_end is considered to be “printed on” that new_start object new_end for these purposes.",
            "ruleNum": "607.1a"
        }
    },
    {
        "old": null,
        "new": {
            "ruleText": "Abilities printed on two objects can be linked if one object is a token or emblem and the second object was the source of the ability that created the token or emblem. In these cases, the abilities fit the criteria listed for one of the different kinds of linked abilities in rule 607.2 except they are printed on two objects rather than one.",
            "ruleNum": "607.1d"
        }
    },
    {
        "old": {
            "ruleText": "Any of the above rules can apply to a planeswalker and an emblem with a pair of linked abilities even though the planeswalker and emblem are different objects.",
            "ruleNum": "607.2p"
        },
        "new": null
    },
    {
        "old": {
            "ruleText": "If, within a pair of linked abilities, one ability refers to a single object as “the exiled card,” “a card exiled with [this card],” or a similar phrase, and the other ability has exiled multiple cards (usually because it was copied), the ability refers to each of the exiled cards. If that ability asks for any information about the exiled card, such as a characteristic or old_start converted old_end mana old_start cost, old_end it gets multiple answers. If these answers are used to determine the value of a variable, the sum of the answers is used. If that ability performs any actions on “the” card, it performs that action on each exiled card. If that ability performs any actions on “a” card, the controller of the ability chooses which card is affected.",
            "ruleNum": "607.3"
        },
        "new": {
            "ruleText": "If, within a pair of linked abilities, one ability refers to a single object as “the exiled card,” “a card exiled with [this card],” or a similar phrase, and the other ability has exiled multiple cards (usually because it was copied), the ability refers to each of the exiled cards. If that ability asks for any information about the exiled card, such as a characteristic or mana new_start value, new_end it gets multiple answers. If these answers are used to determine the value of a variable, the sum of the answers is used. If that ability performs any actions on “the” card, it performs that action on each exiled card. If that ability performs any actions on “a” card, the controller of the ability chooses which card is affected.",
            "ruleNum": "607.3"
        }
    },
    {
        "old": {
            "ruleText": "An effect that refers to old_start the “milled card” old_end can find that card in the zone it moved to from the library, as long as that zone is a public zone.",
            "ruleNum": "701.13c"
        },
        "new": {
            "ruleText": "An effect that refers to new_start a milled card new_end can find that card in the zone it moved to from the library, as long as that zone is a public zone.",
            "ruleNum": "701.13c"
        }
    },
    {
        "old": {
            "ruleText": "If an ability checks information about a single milled card but more than one card was milled, that ability refers to each of the milled cards. If that ability asks for any information about the milled card, such as a characteristic or old_start converted old_end mana old_start cost, old_end it gets multiple answers. If these answers are used to determine the value of a variable, the sum of the answers is used. If that ability performs any actions on “the” card, it performs that action on each milled card. If that ability performs any actions on “a” card, the controller of the ability chooses which card is affected.",
            "ruleNum": "701.13d"
        },
        "new": {
            "ruleText": "If an ability checks information about a single milled card but more than one card was milled, that ability refers to each of the milled cards. If that ability asks for any information about the milled card, such as a characteristic or mana new_start value, new_end it gets multiple answers. If these answers are used to determine the value of a variable, the sum of the answers is used. If that ability performs any actions on “the” card, it performs that action on each milled card. If that ability performs any actions on “a” card, the controller of the ability chooses which card is affected.",
            "ruleNum": "701.13d"
        }
    },
    {
        "old": {
            "ruleText": "A player wins a clash if that player revealed a card with a higher old_start converted old_end mana old_start cost old_end than all other cards revealed in that clash.",
            "ruleNum": "701.23d"
        },
        "new": {
            "ruleText": "A player wins a clash if that player revealed a card with a higher mana new_start value new_end than all other cards revealed in that clash.",
            "ruleNum": "701.23d"
        }
    },
    {
        "old": null,
        "new": {
            "ruleText": "“Learn” means “You may discard a card. If you do, draw a card. If you didn’t discard a card, you may reveal a Lesson card you own from outside the game and put it into your hand.”",
            "ruleNum": "701.45a"
        }
    },
    {
        "old": {
            "ruleText": "Equip is an activated ability of Equipment cards. “Equip [cost]” means “[Cost]: Attach this permanent to target creature you control. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "702.6a"
        },
        "new": {
            "ruleText": "Equip is an activated ability of Equipment cards. “Equip [cost]” means “[Cost]: Attach this permanent to target creature you control. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "702.6a"
        }
    },
    {
        "old": {
            "ruleText": "“Equip [quality] creature” is a variant of the equip ability. “Equip [quality] [cost]” means “[Cost]: Attach this permanent to target [quality] creature you control. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.” This ability doesn’t restrict what the Equipment may be attached to.",
            "ruleNum": "702.6c"
        },
        "new": {
            "ruleText": "“Equip [quality] creature” is a variant of the equip ability. “Equip [quality] [cost]” means “[Cost]: Attach this permanent to target [quality] creature you control. Activate only new_start as new_end a sorcery.” This ability doesn’t restrict what the Equipment may be attached to.",
            "ruleNum": "702.6c"
        }
    },
    {
        "old": null,
        "new": {
            "ruleText": "Ward is a triggered ability. Ward [cost] means “Whenever this permanent becomes the target of a spell or ability an opponent controls, counter that spell or ability unless that player pays [cost].”",
            "ruleNum": "702.21a"
        }
    },
    {
        "old": {
            "ruleText": "Soulshift is a triggered ability. “Soulshift N” means “When this permanent is put into a graveyard from the battlefield, you may return target Spirit card with old_start converted old_end mana old_start cost old_end N or less from your graveyard to your hand.”",
            "ruleNum": "702.45a"
        },
        "new": {
            "ruleText": "Soulshift is a triggered ability. “Soulshift N” means “When this permanent is put into a graveyard from the battlefield, you may return target Spirit card with mana new_start value new_end N or less from your graveyard to your hand.”",
            "ruleNum": "702.46a"
        }
    },
    {
        "old": {
            "ruleText": "Transmute is an activated ability that functions only while the card with transmute is in a player’s hand. “Transmute [cost]” means “[Cost], Discard this card: Search your library for a card with the same old_start converted old_end mana old_start cost old_end as the discarded card, reveal that card, and put it into your hand. Then shuffle your library. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "702.52a"
        },
        "new": {
            "ruleText": "Transmute is an activated ability that functions only while the card with transmute is in a player’s hand. “Transmute [cost]” means “[Cost], Discard this card: Search your library for a card with the same mana new_start value new_end as the discarded card, reveal that card, and put it into your hand. Then shuffle your library. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "702.53a"
        }
    },
    {
        "old": {
            "ruleText": "Fortify is an activated ability of Fortification cards. “Fortify [cost]” means “[Cost]: Attach this Fortification to target land you control. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "702.66a"
        },
        "new": {
            "ruleText": "Fortify is an activated ability of Fortification cards. “Fortify [cost]” means “[Cost]: Attach this Fortification to target land you control. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "702.67a"
        }
    },
    {
        "old": {
            "ruleText": "Transfigure is an activated ability. “Transfigure [cost]” means “[Cost], Sacrifice this permanent: Search your library for a creature card with the same old_start converted old_end mana old_start cost old_end as this permanent and put it onto the battlefield. Then shuffle your library. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "702.70a"
        },
        "new": {
            "ruleText": "Transfigure is an activated ability. “Transfigure [cost]” means “[Cost], Sacrifice this permanent: Search your library for a creature card with the same mana new_start value new_end as this permanent and put it onto the battlefield. Then shuffle your library. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "702.71a"
        }
    },
    {
        "old": {
            "ruleText": "Unearth is an activated ability that functions while the card with unearth is in a graveyard. “Unearth [cost]” means “[Cost]: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step. If it would leave the battlefield, exile it instead of putting it anywhere else. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "702.83a"
        },
        "new": {
            "ruleText": "Unearth is an activated ability that functions while the card with unearth is in a graveyard. “Unearth [cost]” means “[Cost]: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step. If it would leave the battlefield, exile it instead of putting it anywhere else. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "702.84a"
        }
    },
    {
        "old": {
            "ruleText": "Cascade is a triggered ability that functions only while the spell with cascade is on the stack. “Cascade” means “When you cast this spell, exile cards from the top of your library until you exile a nonland card whose old_start converted old_end mana old_start cost old_end is less than this spell’s old_start converted old_end mana old_start cost. old_end You may cast that card without paying its mana cost if the resulting spell’s old_start converted old_end mana old_start cost old_end is less than this spell’s old_start converted old_end mana old_start cost. old_end Then put all cards exiled this way that weren’t cast on the bottom of your library in a random order.”",
            "ruleNum": "702.84a"
        },
        "new": {
            "ruleText": "Cascade is a triggered ability that functions only while the spell with cascade is on the stack. “Cascade” means “When you cast this spell, exile cards from the top of your library until you exile a nonland card whose mana new_start value new_end is less than this spell’s mana new_start value. new_end You may cast that card without paying its mana cost if the resulting spell’s mana new_start value new_end is less than this spell’s mana new_start value. new_end Then put all cards exiled this way that weren’t cast on the bottom of your library in a random order.”",
            "ruleNum": "702.85a"
        }
    },
    {
        "old": {
            "ruleText": "Level up is an activated ability. “Level up [cost]” means “[Cost]: Put a level counter on this permanent. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "702.86a"
        },
        "new": {
            "ruleText": "Level up is an activated ability. “Level up [cost]” means “[Cost]: Put a level counter on this permanent. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "702.87a"
        }
    },
    {
        "old": {
            "ruleText": "Scavenge is an activated ability that functions only while the card with scavenge is in a graveyard. “Scavenge [cost]” means “[Cost], Exile this card from your graveyard: Put a number of +1/+1 counters equal to the power of the card you exiled on target creature. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "702.96a"
        },
        "new": {
            "ruleText": "Scavenge is an activated ability that functions only while the card with scavenge is in a graveyard. “Scavenge [cost]” means “[Cost], Exile this card from your graveyard: Put a number of +1/+1 counters equal to the power of the card you exiled on target creature. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "702.97a"
        }
    },
    {
        "old": {
            "ruleText": "Outlast is an activated ability. “Outlast [cost]” means “[Cost], {T}: Put a +1/+1 counter on this creature. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "702.106a"
        },
        "new": {
            "ruleText": "Outlast is an activated ability. “Outlast [cost]” means “[Cost], {T}: Put a +1/+1 counter on this creature. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "702.107a"
        }
    },
    {
        "old": {
            "ruleText": "Emerge represents two static abilities that function while the spell with emerge is on the stack. “Emerge [cost]” means “You may cast this spell by paying [cost] and sacrificing a creature rather than paying its mana cost” and “If you chose to pay this spell’s emerge cost, its total cost is reduced by an amount of generic mana equal to the sacrificed creature’s old_start converted old_end mana old_start cost.” old_end Casting a spell using its emerge ability follows the rules for paying alternative costs in rules 601.2b and 601.2f–h.",
            "ruleNum": "702.118a"
        },
        "new": {
            "ruleText": "Emerge represents two static abilities that function while the spell with emerge is on the stack. “Emerge [cost]” means “You may cast this spell by paying [cost] and sacrificing a creature rather than paying its mana cost” and “If you chose to pay this spell’s emerge cost, its total cost is reduced by an amount of generic mana equal to the sacrificed creature’s mana new_start value.” new_end Casting a spell using its emerge ability follows the rules for paying alternative costs in rules 601.2b and 601.2f–h.",
            "ruleNum": "702.119a"
        }
    },
    {
        "old": {
            "ruleText": "Embalm is an activated ability that functions while the card with embalm is in a graveyard. “Embalm [cost]” means “[Cost], Exile this card from your graveyard: Create a token that’s a copy of this card, except it’s white, it has no mana cost, and it’s a Zombie in addition to its other types. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "702.127a"
        },
        "new": {
            "ruleText": "Embalm is an activated ability that functions while the card with embalm is in a graveyard. “Embalm [cost]” means “[Cost], Exile this card from your graveyard: Create a token that’s a copy of this card, except it’s white, it has no mana cost, and it’s a Zombie in addition to its other types. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "702.128a"
        }
    },
    {
        "old": {
            "ruleText": "Eternalize is an activated ability that functions while the card with eternalize is in a graveyard. “Eternalize [cost]” means “[Cost], Exile this card from your graveyard: Create a token that’s a copy of this card, except it’s black, it’s 4/4, it has no mana cost, and it’s a Zombie in addition to its other types. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "702.128a"
        },
        "new": {
            "ruleText": "Eternalize is an activated ability that functions while the card with eternalize is in a graveyard. “Eternalize [cost]” means “[Cost], Exile this card from your graveyard: Create a token that’s a copy of this card, except it’s black, it’s 4/4, it has no mana cost, and it’s a Zombie in addition to its other types. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "702.129a"
        }
    },
    {
        "old": {
            "ruleText": "Encore is an activated ability that functions while the card with encore is in a graveyard. “Encore [cost]” means “[Cost], Exile this card from your graveyard: For each opponent, create a token that’s a copy of this card that attacks that opponent this turn if able. The tokens gain haste. Sacrifice them at the beginning of the next end step. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "702.140a"
        },
        "new": {
            "ruleText": "Encore is an activated ability that functions while the card with encore is in a graveyard. “Encore [cost]” means “[Cost], Exile this card from your graveyard: For each opponent, create a token that’s a copy of this card that attacks that opponent this turn if able. The tokens gain haste. Sacrifice them at the beginning of the next end step. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "702.141a"
        }
    },
    {
        "old": null,
        "new": {
            "ruleText": "Demonstrate is a triggered ability. “Demonstrate” means “When you cast this spell, you may copy it and you may choose new targets for the copy. If you copy the spell, choose an opponent. That player copies the spell and may choose new targets for that copy.”",
            "ruleNum": "702.144a"
        }
    },
    {
        "old": {
            "ruleText": "The mana cost of a split card is the combined mana costs of its two halves. A split card’s colors and old_start converted old_end mana old_start cost old_end are determined from its combined mana cost. An effect that refers specifically to the symbols in a split card’s mana cost sees the separate symbols rather than the whole mana cost.",
            "ruleNum": "708.4b"
        },
        "new": {
            "ruleText": "The mana cost of a split card is the combined mana costs of its two halves. A split card’s colors and mana new_start value new_end are determined from its combined mana cost. An effect that refers specifically to the symbols in a split card’s mana cost sees the separate symbols rather than the whole mana cost.",
            "ruleNum": "708.4b"
        }
    },
    {
        "old": {
            "ruleText": "While a transforming double–faced permanent has its back face up, it has only the characteristics of its back face. However, its old_start converted old_end mana old_start cost old_end is calculated using the mana cost of its front face. If a permanent is copying the back face of a transforming double–faced card (even if the card representing that copy is itself a double–faced card), the old_start converted old_end mana old_start cost old_end of that permanent is 0.",
            "ruleNum": "711.4c"
        },
        "new": {
            "ruleText": "While a transforming double–faced permanent has its back face up, it has only the characteristics of its back face. However, its mana new_start value new_end is calculated using the mana cost of its front face. If a permanent is copying the back face of a transforming double–faced card (even if the card representing that copy is itself a double–faced card), the mana new_start value new_end of that permanent is 0.",
            "ruleNum": "711.4c"
        }
    },
    {
        "old": {
            "ruleText": "While the two cards of a meld pair are on the battlefield as a melded permanent, the object represented by those cards has only the characteristics of the combined back face, and its old_start converted old_end mana old_start cost old_end is the sum of the old_start converted old_end mana old_start costs old_end of its front faces. If a permanent is copying a melded permanent, the old_start converted old_end mana old_start cost old_end of the copy is 0. See rule 202.3c.",
            "ruleNum": "712.3b"
        },
        "new": {
            "ruleText": "While the two cards of a meld pair are on the battlefield as a melded permanent, the object represented by those cards has only the characteristics of the combined back face, and its mana new_start value new_end is the sum of the mana new_start values new_end of its front faces. If a permanent is copying a melded permanent, the mana new_start value new_end of the copy is 0. See rule 202.3c.",
            "ruleNum": "712.3b"
        }
    },
    {
        "old": null,
        "new": {
            "ruleText": "If an object requires a player who has left the game to pay a cost or choose whether to pay a cost, that cost is not paid.",
            "ruleNum": "800.4f"
        }
    },
    {
        "old": {
            "ruleText": "If an object requires a player who has left the game to make a old_start choice, old_end the controller of the object chooses another player to make that choice. If the original choice was to be made by an opponent of the controller of the object, that player chooses another opponent if possible.",
            "ruleNum": "800.4f"
        },
        "new": {
            "ruleText": "If an object requires a player who has left the game to make a new_start choice other than whether to pay a cost, new_end the controller of the object chooses another player to make that choice. If the original choice was to be made by an opponent of the controller of the object, that player chooses another opponent if possible.",
            "ruleNum": "800.4g"
        }
    },
    {
        "old": {
            "ruleText": "Each creature has the ability “{T}: Target teammate gains control of this creature. Activate old_start this ability old_end only old_start any time you could cast old_end a sorcery.”",
            "ruleNum": "804.2"
        },
        "new": {
            "ruleText": "Each creature has the ability “{T}: Target teammate gains control of this creature. Activate only new_start as new_end a sorcery.”",
            "ruleNum": "804.2"
        }
    }
]