[
    {
        "names": {
            "old_full": "Khans of Tarkir",
            "old_setcode": "KTK",
            "new_full": "Fate Reforged",
            "new_setcode": "FRF"
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "107.3g",
            "ruleText": "If an effect instructs a player to pay an object’s mana cost that includes {X}, the value of X is treated as 0 unless the object is a spell on the stack. In that case, the value of X is the value chosen or determined for it as the spell was cast."
        }
    },
    {
        "old": {
            "ruleNum": "205.2a",
            "ruleText": "The card types are artifact, creature, enchantment, instant, land, phenomenon, plane, planeswalker, scheme, sorcery, tribal, and vanguard. See section 3, “Card Types.”"
        },
        "new": {
            "ruleNum": "205.2a",
            "ruleText": "The card types are artifact, new_start conspiracy, new_end creature, enchantment, instant, land, phenomenon, plane, planeswalker, scheme, sorcery, tribal, and vanguard. See section 3, “Card Types.”"
        }
    },
    {
        "old": {
            "ruleNum": "205.3m",
            "ruleText": "Creatures and tribals share their lists of subtypes; these subtypes are called creature types. The creature types are Advisor, Ally, Angel, old_start Anteater, old_end Antelope, Ape, Archer, Archon, Artificer, Assassin, Assembly–Worker, Atog, Aurochs, Avatar, Badger, Barbarian, Basilisk, Bat, Bear, Beast, Beeble, Berserker, Bird, Blinkmoth, Boar, Bringer, Brushwagg, Camarid, Camel, Caribou, Carrier, Cat, Centaur, Cephalid, Chimera, Citizen, Cleric, Cockatrice, Construct, Coward, Crab, Crocodile, Cyclops, Dauthi, Demon, Deserter, Devil, Djinn, Dragon, Drake, Dreadnought, Drone, Druid, Dryad, Dwarf, Efreet, Elder, Eldrazi, Elemental, Elephant, Elf, Elk, Eye, Faerie, Ferret, Fish, Flagbearer, Fox, Frog, Fungus, Gargoyle, Germ, Giant, Gnome, Goat, Goblin, God, Golem, Gorgon, Graveborn, Gremlin, Griffin, Hag, Harpy, Hellion, Hippo, Hippogriff, Homarid, Homunculus, Horror, Horse, Hound, Human, Hydra, Hyena, Illusion, Imp, Incarnation, Insect, Jellyfish, Juggernaut, Kavu, Kirin, Kithkin, Knight, Kobold, Kor, Kraken, Lamia, Lammasu, Leech, Leviathan, Lhurgoyf, Licid, Lizard, Manticore, Masticore, Mercenary, Merfolk, Metathran, Minion, Minotaur, Monger, Mongoose, Monk, Moonfolk, Mutant, Myr, Mystic, Naga, Nautilus, Nephilim, Nightmare, Nightstalker, Ninja, Noggle, Nomad, Nymph, Octopus, Ogre, Ooze, Orb, Orc, Orgg, Ouphe, Ox, Oyster, Pegasus, Pentavite, Pest, Phelddagrif, Phoenix, Pincher, Pirate, Plant, Praetor, Prism, Rabbit, Rat, Rebel, Reflection, Rhino, Rigger, Rogue, Sable, Salamander, Samurai, Sand, Saproling, Satyr, Scarecrow, Scorpion, Scout, Serf, Serpent, Shade, Shaman, Shapeshifter, Sheep, Siren, Skeleton, Slith, Sliver, Slug, Snake, Soldier, Soltari, Spawn, Specter, Spellshaper, Sphinx, Spider, Spike, Spirit, Splinter, Sponge, Squid, Squirrel, Starfish, Surrakar, Survivor, Tetravite, Thalakos, Thopter, Thrull, Treefolk, Triskelavite, Troll, Turtle, Unicorn, Vampire, Vedalken, Viashino, Volver, Wall, Warrior, Weird, Werewolf, Whale, Wizard, Wolf, Wolverine, Wombat, Worm, Wraith, Wurm, Yeti, Zombie, and Zubera."
        },
        "new": {
            "ruleNum": "205.3m",
            "ruleText": "Creatures and tribals share their lists of subtypes; these subtypes are called creature types. The creature types are Advisor, Ally, Angel, Antelope, Ape, Archer, Archon, Artificer, Assassin, Assembly–Worker, Atog, Aurochs, Avatar, Badger, Barbarian, Basilisk, Bat, Bear, Beast, Beeble, Berserker, Bird, Blinkmoth, Boar, Bringer, Brushwagg, Camarid, Camel, Caribou, Carrier, Cat, Centaur, Cephalid, Chimera, Citizen, Cleric, Cockatrice, Construct, Coward, Crab, Crocodile, Cyclops, Dauthi, Demon, Deserter, Devil, Djinn, Dragon, Drake, Dreadnought, Drone, Druid, Dryad, Dwarf, Efreet, Elder, Eldrazi, Elemental, Elephant, Elf, Elk, Eye, Faerie, Ferret, Fish, Flagbearer, Fox, Frog, Fungus, Gargoyle, Germ, Giant, Gnome, Goat, Goblin, God, Golem, Gorgon, Graveborn, Gremlin, Griffin, Hag, Harpy, Hellion, Hippo, Hippogriff, Homarid, Homunculus, Horror, Horse, Hound, Human, Hydra, Hyena, Illusion, Imp, Incarnation, Insect, Jellyfish, Juggernaut, Kavu, Kirin, Kithkin, Knight, Kobold, Kor, Kraken, Lamia, Lammasu, Leech, Leviathan, Lhurgoyf, Licid, Lizard, Manticore, Masticore, Mercenary, Merfolk, Metathran, Minion, Minotaur, Monger, Mongoose, Monk, Moonfolk, Mutant, Myr, Mystic, Naga, Nautilus, Nephilim, Nightmare, Nightstalker, Ninja, Noggle, Nomad, Nymph, Octopus, Ogre, Ooze, Orb, Orc, Orgg, Ouphe, Ox, Oyster, Pegasus, Pentavite, Pest, Phelddagrif, Phoenix, Pincher, Pirate, Plant, Praetor, Prism, Rabbit, Rat, Rebel, Reflection, Rhino, Rigger, Rogue, Sable, Salamander, Samurai, Sand, Saproling, Satyr, Scarecrow, Scorpion, Scout, Serf, Serpent, Shade, Shaman, Shapeshifter, Sheep, Siren, Skeleton, Slith, Sliver, Slug, Snake, Soldier, Soltari, Spawn, Specter, Spellshaper, Sphinx, Spider, Spike, Spirit, Splinter, Sponge, Squid, Squirrel, Starfish, Surrakar, Survivor, Tetravite, Thalakos, Thopter, Thrull, Treefolk, Triskelavite, Troll, Turtle, Unicorn, Vampire, Vedalken, Viashino, Volver, Wall, Warrior, Weird, Werewolf, Whale, Wizard, Wolf, Wolverine, Wombat, Worm, Wraith, Wurm, Yeti, Zombie, and Zubera."
        }
    },
    {
        "old": {
            "ruleNum": "207.2c",
            "ruleText": "An ability word appears in italics at the beginning of some abilities. Ability words are similar to keywords in that they tie together cards that have similar functionality, but they have no special rules meaning and no individual entries in the Comprehensive Rules. The ability words are battalion, bloodrush, channel, chroma, constellation, domain, fateful hour, ferocious, grandeur, hellbent, heroic, imprint, inspired, join forces, kinship, landfall, metalcraft, morbid, parley, radiance, raid, strive, sweep, tempting offer, threshold, and will of the council."
        },
        "new": {
            "ruleNum": "207.2c",
            "ruleText": "An ability word appears in italics at the beginning of some abilities. Ability words are similar to keywords in that they tie together cards that have similar functionality, but they have no special rules meaning and no individual entries in the Comprehensive Rules. The ability words are battalion, bloodrush, channel, chroma, constellation, domain, fateful hour, ferocious, grandeur, hellbent, heroic, imprint, inspired, join forces, kinship, landfall, new_start lieutenant, new_end metalcraft, morbid, parley, radiance, raid, strive, sweep, tempting offer, threshold, and will of the council."
        }
    },
    {
        "old": {
            "ruleNum": "601.2e",
            "ruleText": "The player determines the total cost of the spell. Usually this is just the mana cost. Some spells have additional or alternative costs. Some effects may increase or reduce the cost to pay, or may provide other alternative costs. Costs may include paying mana, tapping permanents, sacrificing permanents, discarding cards, and so on. The total cost is the mana cost or alternative cost (as determined in rule 601.2b), plus all additional costs and cost increases, and minus all cost reductions. If the mana component of the total cost is reduced to nothing by cost reduction effects, it is considered to be {0}. It can’t be reduced to less than {0}. Once the total cost is determined, any effects that directly affect the total cost are applied. Then the resulting total cost becomes “locked in.” If effects would change the total cost after this time, they have no effect."
        },
        "new": {
            "ruleNum": "601.2e",
            "ruleText": "The player determines the total cost of the spell. Usually this is just the mana cost. Some spells have additional or alternative costs. Some effects may increase or reduce the cost to pay, or may provide other alternative costs. Costs may include paying mana, tapping permanents, sacrificing permanents, discarding cards, and so on. The total cost is the mana cost or alternative cost (as determined in rule 601.2b), plus all additional costs and cost increases, and minus all cost reductions. If new_start multiple cost reductions apply, the player may apply them in any order. If new_end the mana component of the total cost is reduced to nothing by cost reduction effects, it is considered to be {0}. It can’t be reduced to less than {0}. Once the total cost is determined, any effects that directly affect the total cost are applied. Then the resulting total cost becomes “locked in.” If effects would change the total cost after this time, they have no effect."
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "607.2k",
            "ruleText": "Abilities preceded by an anchor word are linked to the ability that allows a player to choose that anchor word. See rule 614.12b."
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "614.12b",
            "ruleText": "Some replacement effects cause a permanent to enter the battlefield with its controller’s choice of one of two abilities, each marked with an anchor word and preceded by a bullet point. “[Anchor word] — [ability]” means “As long as [anchor word] was chosen as this permanent entered the battlefield, this permanent has [ability].” The abilities preceded by anchor words are each linked to the ability that causes a player to choose between them. See rule 607, “Linked Abilities.”"
        }
    },
    {
        "old": {
            "ruleNum": "700.3",
            "ruleText": "old_start Sometimes an effect will old_end cause objects to be temporarily grouped into old_start two or more old_end piles."
        },
        "new": {
            "ruleNum": "700.3",
            "ruleText": "new_start Some effects new_end cause objects to be temporarily grouped into piles."
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "701.30a",
            "ruleText": "“Bolster N” means “Choose a creature you control with the least toughness or tied for least toughness among creatures you control. Put N +1/+1 counters on that creature.”"
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "701.31a",
            "ruleText": "To manifest a card, turn it face down. It becomes a 2/2 face–down creature card with no text, no name, no subtypes, and no mana cost. Put that card onto the battlefield face down. That permanent is a manifested permanent as long as it remains face down. The effect defining its characteristics works while the card is face down and ends when it’s turned face up."
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "701.31b",
            "ruleText": "Any time you have priority, you may turn a manifested permanent you control face up. This is a special action that doesn’t use the stack (see rule 115.2b). To do this, show all players that the card representing that permanent is a creature card and what that card’s mana cost is, pay that cost, then turn the permanent face up. The effect defining its characteristics while it was face down ends, and it regains its normal characteristics. (If the card representing that permanent isn’t a creature card or it doesn’t have a mana cost, it can’t be turned face up this way.)"
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "701.31c",
            "ruleText": "If a card with morph is manifested, its controller may turn that card face up using either the procedure described in rule 702.36d to turn a face–down permanent with morph face up or the procedure described above to turn a manifested permanent face up."
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "701.31d",
            "ruleText": "If an effect instructs a player to manifest multiple cards from his or her library, those cards are manifested one at a time."
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "701.31e",
            "ruleText": "If a manifested permanent that’s represented by an instant or sorcery card would turn face up, its controller reveals it and leaves it face down. Abilities that trigger whenever a permanent is turned face up won’t trigger."
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "701.31f",
            "ruleText": "See rule 707, “Face–Down Spells and Permanents,” for more information."
        }
    },
    {
        "old": {
            "ruleNum": "702.16m",
            "ruleText": "Some Auras both give the enchanted creature protection and say “this effect doesn’t remove” either that specific Aura or all Auras. This means that the specified Auras aren’t put into their owners’ graveyards as a state–based action. If the creature has other instances of protection from the same quality, those instances affect Auras as normal."
        },
        "new": {
            "ruleNum": "702.16m",
            "ruleText": "Some Auras both give the enchanted creature protection and say “this effect doesn’t remove” either that specific Aura or all Auras. This means that the specified Auras new_start can legally enchant that creature and new_end aren’t put into their owners’ graveyards as a state–based action. If the creature has other instances of protection from the same quality, those instances affect Auras as normal."
        }
    },
    {
        "old": {
            "ruleNum": "702.36a",
            "ruleText": "Morph is a static ability that functions in any zone from which you could play the card it’s on, and the morph effect works any time the card is face down. “Morph [cost]” means “You may cast this card as a 2/2 face–down old_start creature, old_end with no text, no name, no subtypes, and no mana cost by paying {3} rather than paying its mana cost.” (See rule 707, “Face–Down Spells and Permanents.”)"
        },
        "new": {
            "ruleNum": "702.36a",
            "ruleText": "Morph is a static ability that functions in any zone from which you could play the card it’s on, and the morph effect works any time the card is face down. “Morph [cost]” means “You may cast this card as a 2/2 face–down new_start creature new_end with no text, no name, no subtypes, and no mana cost by paying {3} rather than paying its mana cost.” (See rule 707, “Face–Down Spells and Permanents.”)"
        }
    },
    {
        "old": {
            "ruleNum": "702.36b",
            "ruleText": "To cast a card using its morph ability, turn it face down. It becomes a 2/2 face–down creature old_start card, old_end with no text, no name, no subtypes, and no mana cost. Any effects or prohibitions that would apply to casting a card with these characteristics (and not the face–up card’s characteristics) are applied to casting this card. These values are the copiable values of that object’s characteristics. (See rule 613, “Interaction of Continuous Effects,” and rule 706, “Copying Objects.”) Put it onto the stack (as a face–down spell with the same characteristics), and pay {3} rather than pay its mana cost. This follows the rules for paying alternative costs. You can use morph to cast a card from any zone from which you could normally play it. When the spell resolves, it enters the battlefield with the same characteristics the spell had. The morph effect applies to the face–down object wherever it is, and it ends when the permanent is turned face up."
        },
        "new": {
            "ruleNum": "702.36b",
            "ruleText": "To cast a card using its morph ability, turn it face down. It becomes a 2/2 face–down creature new_start card new_end with no text, no name, no subtypes, and no mana cost. Any effects or prohibitions that would apply to casting a card with these characteristics (and not the face–up card’s characteristics) are applied to casting this card. These values are the copiable values of that object’s characteristics. (See rule 613, “Interaction of Continuous Effects,” and rule 706, “Copying Objects.”) Put it onto the stack (as a face–down spell with the same characteristics), and pay {3} rather than pay its mana cost. This follows the rules for paying alternative costs. You can use morph to cast a card from any zone from which you could normally play it. When the spell resolves, it enters the battlefield with the same characteristics the spell had. The morph effect applies to the face–down object wherever it is, and it ends when the permanent is turned face up."
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "702.108a",
            "ruleText": "Dash represents three abilities: two static abilities that function while the card with dash is on the stack, one of which may create a delayed triggered ability, and a static ability that functions while the object with dash is on the battlefield. “Dash [cost]” means “You may cast this card by paying [cost] rather that its mana cost,” “If this spell’s dash cost was paid, return the permanent this spell becomes to its owner’s hand at the beginning of the next end step,” and “As long as this permanent’s dash cost was paid, it has haste.” Paying a card’s dash cost follows the rules for paying alternative costs in rules 601.2b and 601.2e–g."
        }
    },
    {
        "old": {
            "ruleNum": "707.1",
            "ruleText": "old_start Two old_end cards old_start (Illusionary Mask old_end and old_start Ixidron) and the morph ability (see rule 702.36) old_end allow spells and permanents to be face down."
        },
        "new": {
            "ruleNum": "707.1",
            "ruleText": "new_start Some new_end cards and new_start abilities new_end allow spells and permanents to be face down."
        }
    },
    {
        "old": {
            "ruleNum": "707.6",
            "ruleText": "If you control multiple face–down spells or face–down permanents, you must ensure at all times that your face–down spells and permanents can be easily differentiated from each other. This includes, but is not limited to, knowing the order spells were cast, the order that face–down permanents entered the battlefield, which old_start creature old_end attacked last turn, and any other differences between face–down spells or permanents. Common methods for distinguishing between face–down objects include using counters or dice to mark the different objects, or clearly placing those objects in order on the table."
        },
        "new": {
            "ruleNum": "707.6",
            "ruleText": "If you control multiple face–down spells or face–down permanents, you must ensure at all times that your face–down spells and permanents can be easily differentiated from each other. This includes, but is not limited to, knowing new_start what ability or rules caused the permanents to be face down, new_end the order spells were cast, the order that face–down permanents entered the battlefield, which new_start creature(s) new_end attacked last turn, and any other differences between face–down spells or permanents. Common methods for distinguishing between face–down objects include using counters or dice to mark the different objects, or clearly placing those objects in order on the table."
        }
    },
    {
        "old": {
            "ruleNum": "711.1c",
            "ruleText": "old_start While a double–faced card is in a public zone, each player may look at both faces. In other zones, each player that is old_end allowed to look at a double–faced card may look at both faces."
        },
        "new": {
            "ruleNum": "711.2",
            "ruleText": "new_start Players who are new_end allowed to look at a double–faced card may look at both faces."
        }
    },
    {
        "old": {
            "ruleNum": "711.9b",
            "ruleText": "The face of old_start each old_end checklist card is divided into sections. Each section lists the name and mana cost of each double–faced card it could represent and includes a fill–in circle. old_start When using old_end a checklist old_start card, old_end exactly one of the fill–in circles must be marked to denote which double–faced card the checklist card represents."
        },
        "new": {
            "ruleNum": "711.3a",
            "ruleText": "new_start A checklist card has a normal Magic card back. new_end The face of new_start a new_end checklist card is divided into sections. Each section lists the name and mana cost of each double–faced card it could represent and includes a fill–in circle. new_start Before new_end a checklist new_start card can be used, new_end exactly one of the fill–in circles must be marked to denote which double–faced card the checklist card represents."
        }
    },
    {
        "old": {
            "ruleNum": "711.9a",
            "ruleText": "If a checklist card is old_start used, old_end the double–faced card it represents old_start must be old_end set aside prior to the beginning of the game (see rule 103.1a) and must old_start be old_end available throughout the game. A checklist card can’t be included in a deck unless it is representing a double–faced card."
        },
        "new": {
            "ruleNum": "711.3b",
            "ruleText": "If a checklist card is new_start used in a deck, new_end the double–faced card it represents new_start is new_end set aside prior to the beginning of the game (see rule 103.1a) and must new_start remain new_end available throughout the game. A checklist card can’t be included in a deck unless it is representing a double–faced card."
        }
    },
    {
        "old": {
            "ruleNum": "711.9c",
            "ruleText": "For all game purposes, the checklist card is considered to be the double–faced card it’s representing. old_start It has that double–faced card’s characteristics in all zones. old_end"
        },
        "new": {
            "ruleNum": "711.3c",
            "ruleText": "For all game purposes, the checklist card is considered to be the double–faced card it’s representing."
        }
    },
    {
        "old": {
            "ruleNum": "711.9d",
            "ruleText": "old_start As old_end the checklist card old_start enters old_end a public zone, old_start the checklist card old_end should be set aside and the double–faced card used instead. old_start If the checklist card is exiled face down, its identity should continue to be hidden using the face–down checklist card. old_end"
        },
        "new": {
            "ruleNum": "711.3d",
            "ruleText": "new_start If new_end the checklist card new_start is face up in new_end a public zone, new_start it new_end should be set aside and the double–faced card used instead."
        }
    },
    {
        "old": {
            "ruleNum": "711.2a",
            "ruleText": "old_start In every old_end zone other than the battlefield, old_start and also old_end on the battlefield with its front face up, old_start a double–faced card old_end has only the characteristics of old_start the old_end front face."
        },
        "new": {
            "ruleNum": "711.4a",
            "ruleText": "new_start While a double–faced card is outside the game, in a new_end zone other than the battlefield, new_start or new_end on the battlefield with its front face up, new_start it new_end has only the characteristics of new_start its new_end front face."
        }
    },
    {
        "old": {
            "ruleNum": "711.4",
            "ruleText": "If a double–faced card is cast as a spell, it’s put on the stack with its front face up. old_start A double–faced card can’t be cast face down. old_end See rule 601, “Casting Spells.”"
        },
        "new": {
            "ruleNum": "711.6",
            "ruleText": "If a double–faced card is cast as a spell, it’s put on the stack with its front face up. See rule 601, “Casting Spells.”"
        }
    },
    {
        "old": {
            "ruleNum": "711.5",
            "ruleText": "A double–faced card enters the battlefield with its front face up old_start unless old_end a spell or ability puts it onto the battlefield “transformed,” old_start in which case old_end it enters the battlefield with its back face up."
        },
        "new": {
            "ruleNum": "711.7",
            "ruleText": "A double–faced card enters the battlefield with its front face up new_start by default. If new_end a spell or ability puts it onto the battlefield “transformed,” it enters the battlefield with its back face up."
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "711.8",
            "ruleText": "If an effect allows a player to cast a double–faced card as a face–down creature spell, or if a double–faced card enters the battlefield face down, it will have the characteristics given to it by the rule or effect that caused it to be face down. That card remains hidden, using either a face–down checklist card or opaque sleeves. See rule 707, “Face–Down Spells and Permanents.”"
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "711.8a",
            "ruleText": "While face down, a double–faced permanent can’t transform. If it is turned face up, it will have its front face up."
        }
    },
    {
        "old": {
            "ruleNum": "711.6",
            "ruleText": "old_start A double–faced permanent always has the status “face up” (see rule 110.6). old_end Double–faced permanents can’t be turned face down. If a spell or ability tries to turn a double–faced permanent face down, nothing happens."
        },
        "new": {
            "ruleNum": "711.9",
            "ruleText": "Double–faced permanents can’t be turned face down. If a spell or ability tries to turn a double–faced permanent face down, nothing happens."
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "711.10",
            "ruleText": "A double–faced card that is exiled face down remains hidden, using either a face–down checklist card or opaque sleeves. See rule 711.3."
        }
    },
    {
        "old": null,
        "new": {
            "ruleNum": "903.3a",
            "ruleText": "Some planeswalker cards have an ability that states the card can be your commander. This ability modifies the rules for deck construction, and it functions before the game begins. See also rule 112.6m."
        }
    },
    {
        "old": {
            "ruleNum": "903.4c",
            "ruleText": "The back face of a double–faced card (see rule 711) is included when determining a card’s color identity."
        },
        "new": {
            "ruleNum": "903.4c",
            "ruleText": "The back face of a double–faced card (see rule 711) is included when determining a card’s color identity. new_start This is an exception to rule 711.4a. new_end"
        }
    },
    {
        "old": {
            "ruleNum": "904.1",
            "ruleText": "In the Archenemy variant, a team of players faces off against a single opponent old_start bolstered old_end with powerful scheme cards. The Archenemy variant uses all the normal rules for a Magic game, with the following additions."
        },
        "new": {
            "ruleNum": "904.1",
            "ruleText": "In the Archenemy variant, a team of players faces off against a single opponent new_start strengthened new_end with powerful scheme cards. The Archenemy variant uses all the normal rules for a Magic game, with the following additions."
        }
    }
]