[
    {
        "names": {
            "old_full": "Core Set 2021",
            "old_setcode": "M21",
            "new_full": "Double Masters",
            "new_setcode": "2XM"
        }
    },
    {
        "new": {
            "ruleText": "Some one–shot effects cause a permanent to phase out “until” a specified event occurs. A second one–shot effect is created immediately after the specified event. This second one–shot effect causes the permanent to phase in.",
            "ruleNum": "610.4"
        },
        "old": null
    },
    {
        "new": {
            "ruleText": "A permanent phased out this way doesn’t phase in as a result of the turn–based action during a player’s untap step (see rule 502.1). Other effects may cause it to phase in. If a permanent phased out this way phases in due to another effect, the second one–shot effect doesn’t happen, even if that permanent has phased out again.",
            "ruleNum": "610.4a"
        },
        "old": null
    },
    {
        "new": {
            "ruleText": "If a resolving spell or activated ability creates the initial one–shot effect that causes the permanent to phase out, and the specified event has already occurred before that one–shot effect would occur but after that spell or ability was put onto the stack, the permanent doesn’t phase out.",
            "ruleNum": "610.4b"
        },
        "old": null
    },
    {
        "new": {
            "ruleText": "If a resolving triggered ability creates the initial one–shot effect that causes the permanent to phase out, and the specified event has already occurred before that one–shot effect would occur but after that ability triggered, the permanent doesn’t phase out.",
            "ruleNum": "610.4c"
        },
        "old": null
    },
    {
        "new": {
            "ruleText": "If multiple one–shot effects are created this way immediately after one or more simultaneous events, those one–shot effects are also simultaneous.",
            "ruleNum": "610.4d"
        },
        "old": null
    },
    {
        "new": {
            "ruleText": "If a continuous effect generated by the resolution of a spell or ability modifies the characteristics or changes the controller of any objects, a phased–out permanent won’t be included in the set of affected objects. This includes continuous effects that reference the permanent specifically, unless they also specifically refer to the permanent as phased out.",
            "ruleNum": "702.25e"
        },
        "old": null
    }
]